una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91SAM9264.h*/
/* - Object              : AT91SAM9264 definitions*/
/* - Generated           : AT91 SW Application Group  04/28/2008 (18:15:01)*/
/* - */
/* - CVS Reference       : /AT91SAM9264.pl/1.47/Wed Jan  2 11:35:59 2008  */
/* - CVS Reference       : /SYS_SAM9264.pl/1.2/Fri Oct  5 09:08:21 2007  */
/* - CVS Reference       : /HMATRIX2_SAM9264.pl/1.5/Thu Aug  9 13:21:11 2007  */
/* - CVS Reference       : /CCR_SAM9264.pl/1.6/Wed Feb 13 13:27:21 2008  */
/* - CVS Reference       : /PMC_SAM9264.pl/1.9/Wed Jan  2 11:36:06 2008  */
/* - CVS Reference       : /HDDRSDRC2_6304B.pl/1.1/Thu Oct 11 10:44:49 2007  */
/* - CVS Reference       : /EBI_SAM9260.pl/1.1/Fri Sep 30 12:12:14 2005  */
/* - CVS Reference       : /HSMC3_SAM9264.pl/1.1/Wed Oct 10 09:39:31 2007  */
/* - CVS Reference       : /HECC_6143A.pl/1.1/Wed Feb  9 17:16:57 2005  */
/* - CVS Reference       : /SFR_SAM9264.pl/1.4/Thu Jan 17 16:52:02 2008  */
/* - CVS Reference       : /AIC_6075A.pl/1.1/Mon Jul 12 17:04:01 2004  */
/* - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb  3 09:02:11 2005  */
/* - CVS Reference       : /DBGU_6059D.pl/1.1/Mon Jan 31 13:54:41 2005  */
/* - CVS Reference       : /PIO_SAM9264.pl/1.1/Wed Oct 10 09:38:26 2007  */
/* - CVS Reference       : /RSTC_6098A.pl/1.3/Thu Nov  4 13:57:00 2004  */
/* - CVS Reference       : /SHDWC_6122A.pl/1.3/Wed Oct  6 14:16:58 2004  */
/* - CVS Reference       : /RTTC_6081A.pl/1.2/Thu Nov  4 13:57:22 2004  */
/* - CVS Reference       : /PITC_6079A.pl/1.2/Thu Nov  4 13:56:22 2004  */
/* - CVS Reference       : /WDTC_6080A.pl/1.3/Thu Nov  4 13:58:52 2004  */
/* - CVS Reference       : /TC_6082A.pl/1.7/Wed Mar  9 16:31:51 2005  */
/* - CVS Reference       : /MCI_6101F.pl/1.1/Tue Sep 11 16:25:38 2007  */
/* - CVS Reference       : /TWI_6061B.pl/1.2/Fri Aug  4 08:53:02 2006  */
/* - CVS Reference       : /US_6089J.pl/1.2/Wed Oct 11 13:26:02 2006  */
/* - CVS Reference       : /SSC_6078B.pl/1.2/Thu Apr 17 13:55:44 2008  */
/* - CVS Reference       : /SPI_6088D.pl/1.3/Fri May 20 14:23:02 2005  */
/* - CVS Reference       : /AC97C_XXXX.pl/1.3/Tue Feb 22 17:08:27 2005  */
/* - CVS Reference       : /PWM_6044D.pl/1.2/Tue May 10 12:39:09 2005  */
/* - CVS Reference       : /LCDC_6063A.pl/1.3/Fri Dec  9 10:59:26 2005  */
/* - CVS Reference       : /HDMA_SAM9264.pl/1.2/Mon Sep 17 12:01:17 2007  */
/* - CVS Reference       : /UDPHS_SAM9_7ept6dma4iso.pl/1.3/Mon Apr 28 13:59:55 2008  */
/* - CVS Reference       : /TSC_SAM9264.pl/1.1/Fri Jul 13 10:30:41 2007  */
/* - CVS Reference       : /RTC_1245D.pl/1.3/Fri Sep 17 14:01:31 2004  */
/* - CVS Reference       : /EMACB_SAM9264.pl/1.1/Tue Sep 25 12:07:23 2007  */
/* - CVS Reference       : /uhphs_ohci.pl/1.1/Fri Jun 22 14:20:34 2007  */
/* - CVS Reference       : /uhphs_ehci.pl/1.3/Tue Jul 17 07:50:29 2007  */
/* - CVS Reference       : /VDEC_7190.pl/1.2/Fri Aug 31 15:21:50 2007  */
/* - CVS Reference       : /ISI_SAM9264.pl/1.1/Tue Aug 14 10:20:03 2007  */
/* - CVS Reference       : /AES_6149B.pl/1.1/Fri Oct 14 13:30:02 2005  */
/* - CVS Reference       : /DES3_6150A.pl/1.1/Mon Jan 17 13:30:33 2005  */
/* - CVS Reference       : /SHA_6156B.pl/1.1/Fri Jun 22 13:26:18 2007  */
/* - CVS Reference       : /TRNG_xxxxx.pl/1.1/Wed Jul 18 12:02:58 2007  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91SAM9264_H
#define AT91SAM9264_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR SPECIAL FUNCTION REGISTER*/
/* ******************************************************************************/
typedef struct _AT91S_SFR {
	AT91_REG	 SFR_EMA; 	/* memory Extra Margin Adjustment control*/
	AT91_REG	 SFR_DDRCFG; 	/* DDR2 SSTL18 control*/
	AT91_REG	 SFR_DDRDELAY; 	/* DDR2 controller clock delay*/
	AT91_REG	 SFR_EBIDELAY; 	/* EBI DDR controller clock delay*/
	AT91_REG	 SFR_UTMICFG; 	/* UTMI Software Reset, and OHCI suspend interrupt control*/
	AT91_REG	 SFR_INT; 	/* OHCI suspend Interrupt status*/
} AT91S_SFR, *AT91PS_SFR;

/* -------- SFR_EMA : (SFR Offset: 0x0) memory Extra Margin Adjustment control register -------- */
#define AT91C_SFR_RAM_EMA     ((unsigned int) 0x7 <<  0) /* (SFR) SRAM EMA*/
#define 	AT91C_SFR_RAM_EMA_0                    ((unsigned int) 0x0) /* (SFR) Normal Mode*/
#define 	AT91C_SFR_RAM_EMA_1                    ((unsigned int) 0x1) /* (SFR) DEBUG MODE 1*/
#define 	AT91C_SFR_RAM_EMA_2                    ((unsigned int) 0x2) /* (SFR) DEBUG MODE 2*/
#define 	AT91C_SFR_RAM_EMA_3                    ((unsigned int) 0x3) /* (SFR) DEBUG MODE 3*/
#define 	AT91C_SFR_RAM_EMA_4                    ((unsigned int) 0x4) /* (SFR) DEBUG MODE 4*/
#define 	AT91C_SFR_RAM_EMA_5                    ((unsigned int) 0x5) /* (SFR) DEBUG MODE 5*/
#define 	AT91C_SFR_RAM_EMA_6                    ((unsigned int) 0x6) /* (SFR) DEBUG MODE 6*/
#define 	AT91C_SFR_RAM_EMA_7                    ((unsigned int) 0x7) /* (SFR) DEBUG MODE 7*/
#define AT91C_SFR_DPRAM_EMA   ((unsigned int) 0x7 <<  4) /* (SFR) SRAM EMA*/
#define 	AT91C_SFR_DPRAM_EMA_0                    ((unsigned int) 0x0 <<  4) /* (SFR) Normal Mode*/
#define 	AT91C_SFR_DPRAM_EMA_1                    ((unsigned int) 0x1 <<  4) /* (SFR) DEBUG MODE 1*/
#define 	AT91C_SFR_DPRAM_EMA_2                    ((unsigned int) 0x2 <<  4) /* (SFR) DEBUG MODE 2*/
#define 	AT91C_SFR_DPRAM_EMA_3                    ((unsigned int) 0x3 <<  4) /* (SFR) DEBUG MODE 3*/
#define 	AT91C_SFR_DPRAM_EMA_4                    ((unsigned int) 0x4 <<  4) /* (SFR) DEBUG MODE 4*/
#define 	AT91C_SFR_DPRAM_EMA_5                    ((unsigned int) 0x5 <<  4) /* (SFR) DEBUG MODE 5*/
#define 	AT91C_SFR_DPRAM_EMA_6                    ((unsigned int) 0x6 <<  4) /* (SFR) DEBUG MODE 6*/
#define 	AT91C_SFR_DPRAM_EMA_7                    ((unsigned int) 0x7 <<  4) /* (SFR) DEBUG MODE 7*/
#define AT91C_SFR_RF_EMA      ((unsigned int) 0x7 <<  8) /* (SFR) SRAM EMA*/
#define 	AT91C_SFR_RF_EMA_0                    ((unsigned int) 0x0 <<  8) /* (SFR) Normal Mode*/
#define 	AT91C_SFR_RF_EMA_1                    ((unsigned int) 0x1 <<  8) /* (SFR) DEBUG MODE 1*/
#define 	AT91C_SFR_RF_EMA_2                    ((unsigned int) 0x2 <<  8) /* (SFR) DEBUG MODE 2*/
#define 	AT91C_SFR_RF_EMA_3                    ((unsigned int) 0x3 <<  8) /* (SFR) DEBUG MODE 3*/
#define 	AT91C_SFR_RF_EMA_4                    ((unsigned int) 0x4 <<  8) /* (SFR) DEBUG MODE 4*/
#define 	AT91C_SFR_RF_EMA_5                    ((unsigned int) 0x5 <<  8) /* (SFR) DEBUG MODE 5*/
#define 	AT91C_SFR_RF_EMA_6                    ((unsigned int) 0x6 <<  8) /* (SFR) DEBUG MODE 6*/
#define 	AT91C_SFR_RF_EMA_7                    ((unsigned int) 0x7 <<  8) /* (SFR) DEBUG MODE 7*/
#define AT91C_SFR_DPRF_EMA    ((unsigned int) 0x7 << 12) /* (SFR) SRAM EMA*/
#define 	AT91C_SFR_DPRF_EMA_0                    ((unsigned int) 0x0 << 12) /* (SFR) Normal Mode*/
#define 	AT91C_SFR_DPRF_EMA_1                    ((unsigned int) 0x1 << 12) /* (SFR) DEBUG MODE 1*/
#define 	AT91C_SFR_DPRF_EMA_2                    ((unsigned int) 0x2 << 12) /* (SFR) DEBUG MODE 2*/
#define 	AT91C_SFR_DPRF_EMA_3                    ((unsigned int) 0x3 << 12) /* (SFR) DEBUG MODE 3*/
#define 	AT91C_SFR_DPRF_EMA_4                    ((unsigned int) 0x4 << 12) /* (SFR) DEBUG MODE 4*/
#define 	AT91C_SFR_DPRF_EMA_5                    ((unsigned int) 0x5 << 12) /* (SFR) DEBUG MODE 5*/
#define 	AT91C_SFR_DPRF_EMA_6                    ((unsigned int) 0x6 << 12) /* (SFR) DEBUG MODE 6*/
#define 	AT91C_SFR_DPRF_EMA_7                    ((unsigned int) 0x7 << 12) /* (SFR) DEBUG MODE 7*/
#define AT91C_SFR_ROM_EMA     ((unsigned int) 0x7 << 16) /* (SFR) SRAM EMA*/
#define 	AT91C_SFR_ROM_EMA_0                    ((unsigned int) 0x0 << 16) /* (SFR) Normal Mode*/
#define 	AT91C_SFR_ROM_EMA_1                    ((unsigned int) 0x1 << 16) /* (SFR) DEBUG MODE 1*/
#define 	AT91C_SFR_ROM_EMA_2                    ((unsigned int) 0x2 << 16) /* (SFR) DEBUG MODE 2*/
#define 	AT91C_SFR_ROM_EMA_3                    ((unsigned int) 0x3 << 16) /* (SFR) DEBUG MODE 3*/
#define 	AT91C_SFR_ROM_EMA_4                    ((unsigned int) 0x4 << 16) /* (SFR) DEBUG MODE 4*/
#define 	AT91C_SFR_ROM_EMA_5                    ((unsigned int) 0x5 << 16) /* (SFR) DEBUG MODE 5*/
#define 	AT91C_SFR_ROM_EMA_6                    ((unsigned int) 0x6 << 16) /* (SFR) DEBUG MODE 6*/
#define 	AT91C_SFR_ROM_EMA_7                    ((unsigned int) 0x7 << 16) /* (SFR) DEBUG MODE 7*/
/* -------- SFR_DDRCFG : (SFR Offset: 0x4) DDR2 SSTL18 control register -------- */
#define AT91C_SFR_DDRCFG_SSTL ((unsigned int) 0x1 <<  0) /* (SFR) Control DDR2 pads SSTL mode control*/
#define 	AT91C_SFR_DDRCFG_SSTL_NORMAL               ((unsigned int) 0x0) /* (SFR) Force pads in SSTL18 mode when DDR2 is connected*/
#define 	AT91C_SFR_DDRCFG_SSTL_COMPATIBLE           ((unsigned int) 0x1) /* (SFR) LVCMOS level (compatible SSTL18)*/
#define AT91C_SFR_DDRCFG_CLKDELAY ((unsigned int) 0x1 <<  8) /* (SFR) Control DDR2 pads clocks delay on clk, dqs0, dqs1*/
#define 	AT91C_SFR_DDRCFG_CLKDELAY_HARD                 ((unsigned int) 0x0 <<  8) /* (SFR) Fixed by hardware*/
#define 	AT91C_SFR_DDRCFG_CLKDELAY_SOFT                 ((unsigned int) 0x1 <<  8) /* (SFR) Software must write correct delay value*/
/* -------- SFR_DDRDELAY : (SFR Offset: 0x8) DDR2 controller clock delay -------- */
#define AT91C_SFR_DDRDELAY_CLK ((unsigned int) 0xFF <<  0) /* (SFR) Control CLK clock delay*/
#define 	AT91C_SFR_DDRDELAY_CLK_0                    ((unsigned int) 0x0) /* (SFR) minimum delay*/
#define 	AT91C_SFR_DDRDELAY_CLK_1                    ((unsigned int) 0x1) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_2                    ((unsigned int) 0x2) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_3                    ((unsigned int) 0x3) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_4                    ((unsigned int) 0x4) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_5                    ((unsigned int) 0x5) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_6                    ((unsigned int) 0x6) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_7                    ((unsigned int) 0x7) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_8                    ((unsigned int) 0x8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_9                    ((unsigned int) 0x9) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_10                   ((unsigned int) 0xA) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_11                   ((unsigned int) 0xB) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_12                   ((unsigned int) 0xC) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_13                   ((unsigned int) 0xD) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_14                   ((unsigned int) 0xE) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_15                   ((unsigned int) 0xF) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_CLK_16                   ((unsigned int) 0x10) /* (SFR) */
#define AT91C_SFR_DDRDELAY_DQS0 ((unsigned int) 0xFF <<  8) /* (SFR) Control DQS0 clock delay*/
#define 	AT91C_SFR_DDRDELAY_DQS0_0                    ((unsigned int) 0x0 <<  8) /* (SFR) minimum delay*/
#define 	AT91C_SFR_DDRDELAY_DQS0_1                    ((unsigned int) 0x1 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_2                    ((unsigned int) 0x2 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_3                    ((unsigned int) 0x3 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_4                    ((unsigned int) 0x4 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_5                    ((unsigned int) 0x5 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_6                    ((unsigned int) 0x6 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_7                    ((unsigned int) 0x7 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_8                    ((unsigned int) 0x8 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_9                    ((unsigned int) 0x9 <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_10                   ((unsigned int) 0xA <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_11                   ((unsigned int) 0xB <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_12                   ((unsigned int) 0xC <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_13                   ((unsigned int) 0xD <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_14                   ((unsigned int) 0xE <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_15                   ((unsigned int) 0xF <<  8) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS0_16                   ((unsigned int) 0x10 <<  8) /* (SFR) */
#define AT91C_SFR_DDRDELAY_DQS1 ((unsigned int) 0xFF << 16) /* (SFR) Control DQS1 clock delay*/
#define 	AT91C_SFR_DDRDELAY_DQS1_0                    ((unsigned int) 0x0 << 16) /* (SFR) minimum delay*/
#define 	AT91C_SFR_DDRDELAY_DQS1_1                    ((unsigned int) 0x1 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_2                    ((unsigned int) 0x2 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_3                    ((unsigned int) 0x3 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_4                    ((unsigned int) 0x4 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_5                    ((unsigned int) 0x5 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_6                    ((unsigned int) 0x6 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_7                    ((unsigned int) 0x7 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_8                    ((unsigned int) 0x8 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_9                    ((unsigned int) 0x9 << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_10                   ((unsigned int) 0xA << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_11                   ((unsigned int) 0xB << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_12                   ((unsigned int) 0xC << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_13                   ((unsigned int) 0xD << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_14                   ((unsigned int) 0xE << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_15                   ((unsigned int) 0xF << 16) /* (SFR) */
#define 	AT91C_SFR_DDRDELAY_DQS1_16                   ((unsigned int) 0x10 << 16) /* (SFR) */
/* -------- SFR_EBIDELAY : (SFR Offset: 0xc) EBI DDR controller clock delay -------- */
#define AT91C_SFR_EBIDELAY_CLK ((unsigned int) 0xFF <<  0) /* (SFR) Control CLK clock delay*/
#define 	AT91C_SFR_EBIDELAY_CLK_0                    ((unsigned int) 0x0) /* (SFR) minimum delay*/
#define 	AT91C_SFR_EBIDELAY_CLK_1                    ((unsigned int) 0x1) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_2                    ((unsigned int) 0x2) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_3                    ((unsigned int) 0x3) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_4                    ((unsigned int) 0x4) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_5                    ((unsigned int) 0x5) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_6                    ((unsigned int) 0x6) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_7                    ((unsigned int) 0x7) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_8                    ((unsigned int) 0x8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_9                    ((unsigned int) 0x9) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_10                   ((unsigned int) 0xA) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_11                   ((unsigned int) 0xB) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_12                   ((unsigned int) 0xC) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_13                   ((unsigned int) 0xD) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_14                   ((unsigned int) 0xE) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_15                   ((unsigned int) 0xF) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_CLK_16                   ((unsigned int) 0x10) /* (SFR) */
#define AT91C_SFR_EBIDELAY_DQS0 ((unsigned int) 0xFF <<  8) /* (SFR) Control DQS0 clock delay*/
#define 	AT91C_SFR_EBIDELAY_DQS0_0                    ((unsigned int) 0x0 <<  8) /* (SFR) minimum delay*/
#define 	AT91C_SFR_EBIDELAY_DQS0_1                    ((unsigned int) 0x1 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_2                    ((unsigned int) 0x2 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_3                    ((unsigned int) 0x3 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_4                    ((unsigned int) 0x4 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_5                    ((unsigned int) 0x5 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_6                    ((unsigned int) 0x6 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_7                    ((unsigned int) 0x7 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_8                    ((unsigned int) 0x8 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_9                    ((unsigned int) 0x9 <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_10                   ((unsigned int) 0xA <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_11                   ((unsigned int) 0xB <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_12                   ((unsigned int) 0xC <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_13                   ((unsigned int) 0xD <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_14                   ((unsigned int) 0xE <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_15                   ((unsigned int) 0xF <<  8) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS0_16                   ((unsigned int) 0x10 <<  8) /* (SFR) */
#define AT91C_SFR_EBIDELAY_DQS1 ((unsigned int) 0xFF << 16) /* (SFR) Control DQS1 clock delay*/
#define 	AT91C_SFR_EBIDELAY_DQS1_0                    ((unsigned int) 0x0 << 16) /* (SFR) minimum delay*/
#define 	AT91C_SFR_EBIDELAY_DQS1_1                    ((unsigned int) 0x1 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_2                    ((unsigned int) 0x2 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_3                    ((unsigned int) 0x3 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_4                    ((unsigned int) 0x4 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_5                    ((unsigned int) 0x5 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_6                    ((unsigned int) 0x6 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_7                    ((unsigned int) 0x7 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_8                    ((unsigned int) 0x8 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_9                    ((unsigned int) 0x9 << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_10                   ((unsigned int) 0xA << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_11                   ((unsigned int) 0xB << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_12                   ((unsigned int) 0xC << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_13                   ((unsigned int) 0xD << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_14                   ((unsigned int) 0xE << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_15                   ((unsigned int) 0xF << 16) /* (SFR) */
#define 	AT91C_SFR_EBIDELAY_DQS1_16                   ((unsigned int) 0x10 << 16) /* (SFR) */
/* -------- SFR_UTMICFG : (SFR Offset: 0x10) UTMI Software Reset -------- */
#define AT91C_SFR_UTMICFG_PORT0 ((unsigned int) 0x1 <<  0) /* (SFR) UTMI Software Reset port 0*/
#define AT91C_SFR_UTMICFG_PORT1 ((unsigned int) 0x1 <<  1) /* (SFR) UTMI Software Reset port 1*/
#define AT91C_SFR_UTMICFG_OHCI_SUSP_INT_ENABLE ((unsigned int) 0x1 <<  2) /* (SFR) OHCI Suspend Interrupt enable*/
/* -------- SFR_OHCI_SUSP_INT : (SFR Offset: 0x14) OHCI suspend Interrupt status -------- */
#define AT91C_SFR_OHCI_SUSP_INT_STATUS ((unsigned int) 0x3 <<  0) /* (SFR) OHCI suspend Interrupt status*/
#define 	AT91C_SFR_OHCI_SUSP_INT_STATUS_PORT0                ((unsigned int) 0x1) /* (SFR) OHCI suspend Interrupt status for port 0*/
#define 	AT91C_SFR_OHCI_SUSP_INT_STATUS_PORT1                ((unsigned int) 0x2) /* (SFR) OHCI suspend Interrupt status for port 1*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 Reserved0[3904]; 	/* */
	AT91_REG	 SYS_RSTC_RCR; 	/* Reset Control Register*/
	AT91_REG	 SYS_RSTC_RSR; 	/* Reset Status Register*/
	AT91_REG	 SYS_RSTC_RMR; 	/* Reset Mode Register*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 SYS_SHDWC_SHCR; 	/* Shut Down Control Register*/
	AT91_REG	 SYS_SHDWC_SHMR; 	/* Shut Down Mode Register*/
	AT91_REG	 SYS_SHDWC_SHSR; 	/* Shut Down Status Register*/
	AT91_REG	 Reserved2[1]; 	/* */
	AT91_REG	 SYS_RTTC0_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 SYS_RTTC0_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 SYS_RTTC0_RTVR; 	/* Real-time Value Register*/
	AT91_REG	 SYS_RTTC0_RTSR; 	/* Real-time Status Register*/
	AT91_REG	 SYS_PITC_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 SYS_PITC_PISR; 	/* Period Interval Status Register*/
	AT91_REG	 SYS_PITC_PIVR; 	/* Period Interval Value Register*/
	AT91_REG	 SYS_PITC_PIIR; 	/* Period Interval Image Register*/
	AT91_REG	 SYS_WDTC_WDCR; 	/* Watchdog Control Register*/
	AT91_REG	 SYS_WDTC_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 SYS_WDTC_WDSR; 	/* Watchdog Status Register*/
	AT91_REG	 Reserved3[1]; 	/* */
	AT91_REG	 SYS_SLCKSEL; 	/* Slow Clock Selection Register*/
	AT91_REG	 Reserved4[3]; 	/* */
	AT91_REG	 SYS_GPBR[4]; 	/* General Purpose Register*/
	AT91_REG	 Reserved5[16]; 	/* */
	AT91_REG	 RTC_CR; 	/* Control Register*/
	AT91_REG	 RTC_MR; 	/* Mode Register*/
	AT91_REG	 RTC_TIMR; 	/* Time Register*/
	AT91_REG	 RTC_CALR; 	/* Calendar Register*/
	AT91_REG	 RTC_TIMALR; 	/* Time Alarm Register*/
	AT91_REG	 RTC_CALALR; 	/* Calendar Alarm Register*/
	AT91_REG	 RTC_SR; 	/* Status Register*/
	AT91_REG	 RTC_SCCR; 	/* Status Clear Command Register*/
	AT91_REG	 RTC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 RTC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 RTC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 RTC_VER; 	/* Valid Entry Register*/
} AT91S_SYS, *AT91PS_SYS;

