una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- SLCKSEL : (SYS Offset: 0x3d50) Slow Clock Selection Register -------- */
#define AT91C_SLCKSEL_RCEN    ((unsigned int) 0x1 <<  0) /* (SYS) Enable Internal RC Oscillator*/
#define AT91C_SLCKSEL_OSC32EN ((unsigned int) 0x1 <<  1) /* (SYS) Enable External Oscillator*/
#define AT91C_SLCKSEL_OSC32BYP ((unsigned int) 0x1 <<  2) /* (SYS) Bypass External Oscillator*/
#define AT91C_SLCKSEL_OSCSEL  ((unsigned int) 0x1 <<  3) /* (SYS) OSC Selection*/
/* -------- GPBR : (SYS Offset: 0x3d60) GPBR General Purpose Register -------- */
#define AT91C_GPBR_GPRV       ((unsigned int) 0x0 <<  0) /* (SYS) General Purpose Register Value*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR External Bus Interface*/
/* ******************************************************************************/
typedef struct _AT91S_EBI {
	AT91_REG	 EBI_DUMMY; 	/* Dummy register - Do not use*/
} AT91S_EBI, *AT91PS_EBI;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR DDR2/SDRAM Controller*/
/* ******************************************************************************/
typedef struct _AT91S_HDDRSDRC2 {
	AT91_REG	 HDDRSDRC2_MR; 	/* Mode Register*/
	AT91_REG	 HDDRSDRC2_RTR; 	/* Refresh Timer Register*/
	AT91_REG	 HDDRSDRC2_CR; 	/* Configuration Register*/
	AT91_REG	 HDDRSDRC2_T0PR; 	/* Timing0 Register*/
	AT91_REG	 HDDRSDRC2_T1PR; 	/* Timing1 Register*/
	AT91_REG	 HDDRSDRC2_T2PR; 	/* Timing2 Register*/
	AT91_REG	 HDDRSDRC2_T3PR; 	/* Timing3 Register*/
	AT91_REG	 HDDRSDRC2_LPR; 	/* Low-power Register*/
	AT91_REG	 HDDRSDRC2_MDR; 	/* Memory Device Register*/
	AT91_REG	 HDDRSDRC2_DLL; 	/* DLL Information Register*/
	AT91_REG	 HDDRSDRC2_VER; 	/* DLL Version Register*/
	AT91_REG	 HDDRSDRC2_HS; 	/* High Speed Register*/
	AT91_REG	 HDDRSDRC2_DELAY1; 	/* Pad delay1 Register*/
	AT91_REG	 HDDRSDRC2_DELAY2; 	/* Pad delay2 Register*/
	AT91_REG	 HDDRSDRC2_DELAY3; 	/* Pad delay3 Register*/
	AT91_REG	 HDDRSDRC2_DELAY4; 	/* Pad delay4 Register*/
	AT91_REG	 HDDRSDRC2_DELAY5; 	/* Pad delay5 Register*/
	AT91_REG	 HDDRSDRC2_DELAY6; 	/* Pad delay6 Register*/
	AT91_REG	 HDDRSDRC2_DELAY7; 	/* Pad delay7 Register*/
	AT91_REG	 HDDRSDRC2_DELAY8; 	/* Pad delay8 Register*/
	AT91_REG	 Reserved0[37]; 	/* */
	AT91_REG	 HDDRSDRC2_WPCR; 	/* High Speed Register*/
	AT91_REG	 HDDRSDRC2_WPSR; 	/* High Speed Register*/
	AT91_REG	 Reserved1[4]; 	/* */
	AT91_REG	 HDDRSDRC2_VERSION; 	/* Version Register*/
} AT91S_HDDRSDRC2, *AT91PS_HDDRSDRC2;

/* -------- HDDRSDRC2_MR : (HDDRSDRC2 Offset: 0x0) Mode Register -------- */
#define AT91C_DDRC2_MODE      ((unsigned int) 0x7 <<  0) /* (HDDRSDRC2) DDR/SDRAM Command Mode*/
#define 	AT91C_DDRC2_MODE_NORMAL_CMD           ((unsigned int) 0x0) /* (HDDRSDRC2) Normal Mode*/
#define 	AT91C_DDRC2_MODE_NOP_CMD              ((unsigned int) 0x1) /* (HDDRSDRC2) Issue a NOP Command at every access*/
#define 	AT91C_DDRC2_MODE_PRCGALL_CMD          ((unsigned int) 0x2) /* (HDDRSDRC2) Issue a All Banks Precharge Command at every access*/
#define 	AT91C_DDRC2_MODE_LMR_CMD              ((unsigned int) 0x3) /* (HDDRSDRC2) Issue a Load Mode Register at every access*/
#define 	AT91C_DDRC2_MODE_RFSH_CMD             ((unsigned int) 0x4) /* (HDDRSDRC2) Issue a Refresh*/
#define 	AT91C_DDRC2_MODE_EXT_LMR_CMD          ((unsigned int) 0x5) /* (HDDRSDRC2) Issue an Extended Load Mode Register*/
#define 	AT91C_DDRC2_MODE_DEEP_CMD             ((unsigned int) 0x6) /* (HDDRSDRC2) Enter Deep Power Mode*/
#define 	AT91C_DDRC2_MODE_Reserved             ((unsigned int) 0x7) /* (HDDRSDRC2) Reserved value*/
/* -------- HDDRSDRC2_RTR : (HDDRSDRC2 Offset: 0x4) Refresh Timer Register -------- */
#define AT91C_DDRC2_COUNT     ((unsigned int) 0xFFF <<  0) /* (HDDRSDRC2) Refresh Timer Count*/
/* -------- HDDRSDRC2_CR : (HDDRSDRC2 Offset: 0x8) Configuration Register -------- */
#define AT91C_DDRC2_NC        ((unsigned int) 0x3 <<  0) /* (HDDRSDRC2) Number of Column Bits*/
#define 	AT91C_DDRC2_NC_DDR9_SDR8            ((unsigned int) 0x0) /* (HDDRSDRC2) DDR 9 Bits | SDR 8 Bits*/
#define 	AT91C_DDRC2_NC_DDR10_SDR9           ((unsigned int) 0x1) /* (HDDRSDRC2) DDR 10 Bits | SDR 9 Bits*/
#define 	AT91C_DDRC2_NC_DDR11_SDR10          ((unsigned int) 0x2) /* (HDDRSDRC2) DDR 11 Bits | SDR 10 Bits*/
#define 	AT91C_DDRC2_NC_DDR12_SDR11          ((unsigned int) 0x3) /* (HDDRSDRC2) DDR 12 Bits | SDR 11 Bits*/
#define AT91C_DDRC2_NR        ((unsigned int) 0x3 <<  2) /* (HDDRSDRC2) Number of Row Bits*/
#define 	AT91C_DDRC2_NR_11                   ((unsigned int) 0x0 <<  2) /* (HDDRSDRC2) 11 Bits*/
#define 	AT91C_DDRC2_NR_12                   ((unsigned int) 0x1 <<  2) /* (HDDRSDRC2) 12 Bits*/
#define 	AT91C_DDRC2_NR_13                   ((unsigned int) 0x2 <<  2) /* (HDDRSDRC2) 13 Bits*/
#define 	AT91C_DDRC2_NR_14                   ((unsigned int) 0x3 <<  2) /* (HDDRSDRC2) 14 Bits*/
#define AT91C_DDRC2_CAS       ((unsigned int) 0x7 <<  4) /* (HDDRSDRC2) CAS Latency*/
#define 	AT91C_DDRC2_CAS_2                    ((unsigned int) 0x2 <<  4) /* (HDDRSDRC2) 2 cycles (DDR1/SDR)*/
#define 	AT91C_DDRC2_CAS_3                    ((unsigned int) 0x3 <<  4) /* (HDDRSDRC2) 3 cycles (DDR2/DDR1/SDR)*/
#define 	AT91C_DDRC2_CAS_4                    ((unsigned int) 0x4 <<  4) /* (HDDRSDRC2) 4 cycles (DDR2)*/
#define 	AT91C_DDRC2_CAS_2_5                  ((unsigned int) 0x6 <<  4) /* (HDDRSDRC2) 2.5 cycles (DDR1)*/
#define AT91C_DDRC2_DLL       ((unsigned int) 0x1 <<  7) /* (HDDRSDRC2) DLL Reset*/
#define 	AT91C_DDRC2_DLL_RESET_DISABLED       ((unsigned int) 0x0 <<  7) /* (HDDRSDRC2) DLL normal mode*/
#define 	AT91C_DDRC2_DLL_RESET_ENABLED        ((unsigned int) 0x1 <<  7) /* (HDDRSDRC2) Reset DLL*/
#define AT91C_DDRC2_DIC_DS    ((unsigned int) 0x1 <<  8) /* (HDDRSDRC2) Output driver impedance control*/
#define AT91C_DDRC2_OCD       ((unsigned int) 0x7 << 12) /* (HDDRSDRC2) Off chip driver*/
#define 	AT91C_DDRC2_OCD_EXIT                 ((unsigned int) 0x0 << 12) /* (HDDRSDRC2) Exit OCD calibration mode.*/
#define 	AT91C_DDRC2_OCD_DEFAULT              ((unsigned int) 0x7 << 12) /* (HDDRSDRC2) Program OCD calibration default value.*/
#define AT91C_DDRC2_DQMS      ((unsigned int) 0x1 << 16) /* (HDDRSDRC2) Data Mask share*/
#define 	AT91C_DDRC2_DQMS_NOT_SHARED           ((unsigned int) 0x0 << 16) /* (HDDRSDRC2) Used DQM bits are not shared*/
#define 	AT91C_DDRC2_DQMS_SHARED               ((unsigned int) 0x1 << 16) /* (HDDRSDRC2) Used DQM bits are shared*/
#define AT91C_DDRC2_ENRDM     ((unsigned int) 0x1 << 17) /* (HDDRSDRC2) DQS/DATA phase error correction*/
#define 	AT91C_DDRC2_ENRDM_OFF                  ((unsigned int) 0x0 << 17) /* (HDDRSDRC2) phase error correction disabled*/
#define 	AT91C_DDRC2_ENRDM_ON                   ((unsigned int) 0x1 << 17) /* (HDDRSDRC2) phase error correction enabled*/
/* -------- HDDRSDRC2_T0PR : (HDDRSDRC2 Offset: 0xc) Timing0 Register -------- */
#define AT91C_DDRC2_TRAS      ((unsigned int) 0xF <<  0) /* (HDDRSDRC2) Active to precharge delay*/
#define 	AT91C_DDRC2_TRAS_0                    ((unsigned int) 0x0) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRAS_1                    ((unsigned int) 0x1) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRAS_2                    ((unsigned int) 0x2) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRAS_3                    ((unsigned int) 0x3) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRAS_4                    ((unsigned int) 0x4) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRAS_5                    ((unsigned int) 0x5) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRAS_6                    ((unsigned int) 0x6) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRAS_7                    ((unsigned int) 0x7) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRAS_8                    ((unsigned int) 0x8) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRAS_9                    ((unsigned int) 0x9) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRAS_10                   ((unsigned int) 0xA) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRAS_11                   ((unsigned int) 0xB) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRAS_12                   ((unsigned int) 0xC) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRAS_13                   ((unsigned int) 0xD) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRAS_14                   ((unsigned int) 0xE) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRAS_15                   ((unsigned int) 0xF) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TRCD      ((unsigned int) 0xF <<  4) /* (HDDRSDRC2) Row to column delay*/
#define 	AT91C_DDRC2_TRCD_0                    ((unsigned int) 0x0 <<  4) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRCD_1                    ((unsigned int) 0x1 <<  4) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRCD_2                    ((unsigned int) 0x2 <<  4) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRCD_3                    ((unsigned int) 0x3 <<  4) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRCD_4                    ((unsigned int) 0x4 <<  4) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRCD_5                    ((unsigned int) 0x5 <<  4) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRCD_6                    ((unsigned int) 0x6 <<  4) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRCD_7                    ((unsigned int) 0x7 <<  4) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRCD_8                    ((unsigned int) 0x8 <<  4) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRCD_9                    ((unsigned int) 0x9 <<  4) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRCD_10                   ((unsigned int) 0xA <<  4) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRCD_11                   ((unsigned int) 0xB <<  4) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRCD_12                   ((unsigned int) 0xC <<  4) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRCD_13                   ((unsigned int) 0xD <<  4) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRCD_14                   ((unsigned int) 0xE <<  4) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRCD_15                   ((unsigned int) 0xF <<  4) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TWR       ((unsigned int) 0xF <<  8) /* (HDDRSDRC2) Write recovery delay*/
#define 	AT91C_DDRC2_TWR_0                    ((unsigned int) 0x0 <<  8) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TWR_1                    ((unsigned int) 0x1 <<  8) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TWR_2                    ((unsigned int) 0x2 <<  8) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TWR_3                    ((unsigned int) 0x3 <<  8) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TWR_4                    ((unsigned int) 0x4 <<  8) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TWR_5                    ((unsigned int) 0x5 <<  8) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TWR_6                    ((unsigned int) 0x6 <<  8) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TWR_7                    ((unsigned int) 0x7 <<  8) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TWR_8                    ((unsigned int) 0x8 <<  8) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TWR_9                    ((unsigned int) 0x9 <<  8) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TWR_10                   ((unsigned int) 0xA <<  8) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TWR_11                   ((unsigned int) 0xB <<  8) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TWR_12                   ((unsigned int) 0xC <<  8) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TWR_13                   ((unsigned int) 0xD <<  8) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TWR_14                   ((unsigned int) 0xE <<  8) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TWR_15                   ((unsigned int) 0xF <<  8) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TRC       ((unsigned int) 0xF << 12) /* (HDDRSDRC2) Row cycle delay*/
#define 	AT91C_DDRC2_TRC_0                    ((unsigned int) 0x0 << 12) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRC_1                    ((unsigned int) 0x1 << 12) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRC_2                    ((unsigned int) 0x2 << 12) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRC_3                    ((unsigned int) 0x3 << 12) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRC_4                    ((unsigned int) 0x4 << 12) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRC_5                    ((unsigned int) 0x5 << 12) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRC_6                    ((unsigned int) 0x6 << 12) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRC_7                    ((unsigned int) 0x7 << 12) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRC_8                    ((unsigned int) 0x8 << 12) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRC_9                    ((unsigned int) 0x9 << 12) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRC_10                   ((unsigned int) 0xA << 12) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRC_11                   ((unsigned int) 0xB << 12) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRC_12                   ((unsigned int) 0xC << 12) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRC_13                   ((unsigned int) 0xD << 12) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRC_14                   ((unsigned int) 0xE << 12) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRC_15                   ((unsigned int) 0xF << 12) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TRP       ((unsigned int) 0xF << 16) /* (HDDRSDRC2) Row precharge delay*/
#define 	AT91C_DDRC2_TRP_0                    ((unsigned int) 0x0 << 16) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRP_1                    ((unsigned int) 0x1 << 16) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRP_2                    ((unsigned int) 0x2 << 16) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRP_3                    ((unsigned int) 0x3 << 16) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRP_4                    ((unsigned int) 0x4 << 16) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRP_5                    ((unsigned int) 0x5 << 16) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRP_6                    ((unsigned int) 0x6 << 16) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRP_7                    ((unsigned int) 0x7 << 16) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRP_8                    ((unsigned int) 0x8 << 16) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRP_9                    ((unsigned int) 0x9 << 16) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRP_10                   ((unsigned int) 0xA << 16) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRP_11                   ((unsigned int) 0xB << 16) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRP_12                   ((unsigned int) 0xC << 16) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRP_13                   ((unsigned int) 0xD << 16) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRP_14                   ((unsigned int) 0xE << 16) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRP_15                   ((unsigned int) 0xF << 16) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TRRD      ((unsigned int) 0xF << 20) /* (HDDRSDRC2) Active bankA to Active bankB*/
#define 	AT91C_DDRC2_TRRD_0                    ((unsigned int) 0x0 << 20) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRRD_1                    ((unsigned int) 0x1 << 20) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRRD_2                    ((unsigned int) 0x2 << 20) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRRD_3                    ((unsigned int) 0x3 << 20) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRRD_4                    ((unsigned int) 0x4 << 20) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRRD_5                    ((unsigned int) 0x5 << 20) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRRD_6                    ((unsigned int) 0x6 << 20) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRRD_7                    ((unsigned int) 0x7 << 20) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRRD_8                    ((unsigned int) 0x8 << 20) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRRD_9                    ((unsigned int) 0x9 << 20) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRRD_10                   ((unsigned int) 0xA << 20) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRRD_11                   ((unsigned int) 0xB << 20) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRRD_12                   ((unsigned int) 0xC << 20) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRRD_13                   ((unsigned int) 0xD << 20) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRRD_14                   ((unsigned int) 0xE << 20) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRRD_15                   ((unsigned int) 0xF << 20) /* (HDDRSDRC2) Value : 15*/
#define AT91C_DDRC2_TWTR      ((unsigned int) 0x1 << 24) /* (HDDRSDRC2) Internal write to read delay*/
#define 	AT91C_DDRC2_TWTR_0                    ((unsigned int) 0x0 << 24) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TWTR_1                    ((unsigned int) 0x1 << 24) /* (HDDRSDRC2) Value :  1*/
#define AT91C_DDRC2_TMRD      ((unsigned int) 0xF << 28) /* (HDDRSDRC2) Load mode register command to active or refresh command*/
#define 	AT91C_DDRC2_TMRD_0                    ((unsigned int) 0x0 << 28) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TMRD_1                    ((unsigned int) 0x1 << 28) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TMRD_2                    ((unsigned int) 0x2 << 28) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TMRD_3                    ((unsigned int) 0x3 << 28) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TMRD_4                    ((unsigned int) 0x4 << 28) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TMRD_5                    ((unsigned int) 0x5 << 28) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TMRD_6                    ((unsigned int) 0x6 << 28) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TMRD_7                    ((unsigned int) 0x7 << 28) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TMRD_8                    ((unsigned int) 0x8 << 28) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TMRD_9                    ((unsigned int) 0x9 << 28) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TMRD_10                   ((unsigned int) 0xA << 28) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TMRD_11                   ((unsigned int) 0xB << 28) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TMRD_12                   ((unsigned int) 0xC << 28) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TMRD_13                   ((unsigned int) 0xD << 28) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TMRD_14                   ((unsigned int) 0xE << 28) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TMRD_15                   ((unsigned int) 0xF << 28) /* (HDDRSDRC2) Value : 15*/
/* -------- HDDRSDRC2_T1PR : (HDDRSDRC2 Offset: 0x10) Timing1 Register -------- */
#define AT91C_DDRC2_TRFC      ((unsigned int) 0x1F <<  0) /* (HDDRSDRC2) row cycle delay*/
#define 	AT91C_DDRC2_TRFC_0                    ((unsigned int) 0x0) /* (HDDRSDRC2) Value :  0*/
#define 	AT91C_DDRC2_TRFC_1                    ((unsigned int) 0x1) /* (HDDRSDRC2) Value :  1*/
#define 	AT91C_DDRC2_TRFC_2                    ((unsigned int) 0x2) /* (HDDRSDRC2) Value :  2*/
#define 	AT91C_DDRC2_TRFC_3                    ((unsigned int) 0x3) /* (HDDRSDRC2) Value :  3*/
#define 	AT91C_DDRC2_TRFC_4                    ((unsigned int) 0x4) /* (HDDRSDRC2) Value :  4*/
#define 	AT91C_DDRC2_TRFC_5                    ((unsigned int) 0x5) /* (HDDRSDRC2) Value :  5*/
#define 	AT91C_DDRC2_TRFC_6                    ((unsigned int) 0x6) /* (HDDRSDRC2) Value :  6*/
#define 	AT91C_DDRC2_TRFC_7                    ((unsigned int) 0x7) /* (HDDRSDRC2) Value :  7*/
#define 	AT91C_DDRC2_TRFC_8                    ((unsigned int) 0x8) /* (HDDRSDRC2) Value :  8*/
#define 	AT91C_DDRC2_TRFC_9                    ((unsigned int) 0x9) /* (HDDRSDRC2) Value :  9*/
#define 	AT91C_DDRC2_TRFC_10                   ((unsigned int) 0xA) /* (HDDRSDRC2) Value : 10*/
#define 	AT91C_DDRC2_TRFC_11                   ((unsigned int) 0xB) /* (HDDRSDRC2) Value : 11*/
#define 	AT91C_DDRC2_TRFC_12                   ((unsigned int) 0xC) /* (HDDRSDRC2) Value : 12*/
#define 	AT91C_DDRC2_TRFC_13                   ((unsigned int) 0xD) /* (HDDRSDRC2) Value : 13*/
#define 	AT91C_DDRC2_TRFC_14                   ((unsigned int) 0xE) /* (HDDRSDRC2) Value : 14*/
#define 	AT91C_DDRC2_TRFC_15                   ((unsigned int) 0xF) /* (HDDRSDRC2) Value : 15*/
#define 	AT91C_DDRC2_TRFC_16                   ((unsigned int) 0x10) /* (HDDRSDRC2) Value : 16*/
#define 	AT91C_DDRC2_TRFC_17                   ((unsigned int) 0x11) /* (HDDRSDRC2) Value : 17*/
#define 	AT91C_DDRC2_TRFC_18                   ((unsigned int) 0x12) /* (HDDRSDRC2) Value : 18*/
#define 	AT91C_DDRC2_TRFC_19                   ((unsigned int) 0x13) /* (HDDRSDRC2) Value : 19*/
#define 	AT91C_DDRC2_TRFC_20                   ((unsigned int) 0x14) /* (HDDRSDRC2) Value : 20*/
#define 	AT91C_DDRC2_TRFC_21                   ((unsigned int) 0x15) /* (HDDRSDRC2) Value : 21*/
#define 	AT91C_DDRC2_TRFC_22                   ((unsigned int) 0x16) /* (HDDRSDRC2) Value : 22*/
#define 	AT91C_DDRC2_TRFC_23                   ((unsigned int) 0x17) /* (HDDRSDRC2) Value : 23*/
#define 	AT91C_DDRC2_TRFC_24                   ((unsigned int) 0x18) /* (HDDRSDRC2) Value : 24*/
#define 	AT91C_DDRC2_TRFC_25                   ((unsigned int) 0x19) /* (HDDRSDRC2) Value : 25*/
#define 	AT91C_DDRC2_TRFC_26                   ((unsigned int) 0x1A) /* (HDDRSDRC2) Value : 26*/
#define 	AT91C_DDRC2_TRFC_27                   ((unsigned int) 0x1B) /* (HDDRSDRC2) Value : 27*/
#define 	AT91C_DDRC2_TRFC_28                   ((unsigned int) 0x1C) /* (HDDRSDRC2) Value : 28*/
#define 	AT91C_DDRC2_TRFC_29                   ((unsigned int) 0x1D) /* (HDDRSDRC2) Value : 29*/
#define 	AT91C_DDRC2_TRFC_30                   ((unsigned int) 0x1E) /* (HDDRSDRC2) Value : 30*/
#define 	AT91C_DDRC2_TRFC_31                   ((unsigned int) 0x1F) /* (HDDRSDRC2) Value : 31*/
#define AT91C_DDRC2_TXSNR     ((unsigned int) 0xFF <<  8) /* (HDDRSDRC2) Exit self refresh delay to Read command*/
#define 	AT91C_DDRC2_TXSNR_0                    ((unsigned int) 0x0 <<  8) /* (HDDRSDRC2) Value :   0*/
#define 	AT91C_DDRC2_TXSNR_8                    ((unsigned int) 0x8 <<  8) /* (HDDRSDRC2) Value :   8*/
#define 	AT91C_DDRC2_TXSNR_16                   ((unsigned int) 0x10 <<  8) /* (HDDRSDRC2) Value :  16*/
#define 	AT91C_DDRC2_TXSNR_32                   ((unsigned int) 0x20 <<  8) /* (HDDRSDRC2) Value :  32*/
#define 	AT91C_DDRC2_TXSNR_48                   ((unsigned int) 0x30 <<  8) /* (HDDRSDRC2) Value :  48*/
#define 	AT91C_DDRC2_TXSNR_64                   ((unsigned int) 0x40 <<  8) /* (HDDRSDRC2) Value :  64*/
#define 	AT91C_DDRC2_TXSNR_80                   ((unsigned int) 0x50 <<  8) /* (HDDRSDRC2) Value :  80*/
#define 	AT91C_DDRC2_TXSNR_96                   ((unsigned int) 0x60 <<  8) /* (HDDRSDRC2) Value :  96*/
#define 	AT91C_DDRC2_TXSNR_112                  ((unsigned int) 0x70 <<  8) /* (HDDRSDRC2) Value : 112*/
#define 	AT91C_DDRC2_TXSNR_128                  ((unsigned int) 0x80 <<  8) /* (HDDRSDRC2) Value : 128*/
