una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_DDRC2_ADPE      ((unsigned int) 0x1 << 16) /* (HDDRSDRC2) Active Power Down Exit time*/
#define 	AT91C_DDRC2_ADPE_FAST                 ((unsigned int) 0x0 << 16) /* (HDDRSDRC2) Fast Exit*/
#define 	AT91C_DDRC2_ADPE_SLOW                 ((unsigned int) 0x1 << 16) /* (HDDRSDRC2) Slow Exit*/
/* -------- HDDRSDRC2_MDR : (HDDRSDRC2 Offset: 0x20) Memory Device Register -------- */
#define AT91C_DDRC2_MD        ((unsigned int) 0x7 <<  0) /* (HDDRSDRC2) memory device*/
#define 	AT91C_DDRC2_MD_SDR_SDRAM            ((unsigned int) 0x0) /* (HDDRSDRC2) SDR SDRAM*/
#define 	AT91C_DDRC2_MD_LP_SDR_SDRAM         ((unsigned int) 0x1) /* (HDDRSDRC2) Low Power SDR SDRAM*/
#define 	AT91C_DDRC2_MD_DDR_SDRAM            ((unsigned int) 0x2) /* (HDDRSDRC2) DDR SDRAM*/
#define 	AT91C_DDRC2_MD_LP_DDR_SDRAM         ((unsigned int) 0x3) /* (HDDRSDRC2) Low Power DDR SDRAM*/
#define 	AT91C_DDRC2_MD_DDR2_SDRAM           ((unsigned int) 0x6) /* (HDDRSDRC2) DDR2 SDRAM*/
#define AT91C_DDRC2_DBW       ((unsigned int) 0x1 <<  4) /* (HDDRSDRC2) Data Bus Width*/
#define 	AT91C_DDRC2_DBW_32_BITS              ((unsigned int) 0x0 <<  4) /* (HDDRSDRC2) 32 Bits datas bus*/
#define 	AT91C_DDRC2_DBW_16_BITS              ((unsigned int) 0x1 <<  4) /* (HDDRSDRC2) 16 Bits datas bus*/
/* -------- HDDRSDRC2_DLL : (HDDRSDRC2 Offset: 0x24) DLL Information Register -------- */
#define AT91C_DDRC2_MDINC     ((unsigned int) 0x1 <<  0) /* (HDDRSDRC2) DLL Master Delay Increment*/
#define AT91C_DDRC2_MDDEC     ((unsigned int) 0x1 <<  1) /* (HDDRSDRC2) DLL Master Delay Decrement*/
#define AT91C_DDRC2_MDOVF     ((unsigned int) 0x1 <<  2) /* (HDDRSDRC2) DLL Master Delay Overflow Flag*/
#define AT91C_DDRC2_SDCOVF    ((unsigned int) 0x1 <<  3) /* (HDDRSDRC2) DLL Slave Delay Correction Overflow Flag*/
#define AT91C_DDRC2_SDCUDF    ((unsigned int) 0x1 <<  4) /* (HDDRSDRC2) DLL Slave Delay Correction Underflow Flag*/
#define AT91C_DDRC2_SDERF     ((unsigned int) 0x1 <<  5) /* (HDDRSDRC2) DLL Slave Delay Correction Error Flag*/
#define AT91C_DDRC2_MDVAL     ((unsigned int) 0xFF <<  8) /* (HDDRSDRC2) DLL Master Delay Value*/
#define AT91C_DDRC2_SDVAL     ((unsigned int) 0xFF << 16) /* (HDDRSDRC2) DLL Slave Delay Value*/
#define AT91C_DDRC2_SDCVAL    ((unsigned int) 0xFF << 24) /* (HDDRSDRC2) DLL Slave Delay Correction Value*/
/* -------- HDDRSDRC2_HS : (HDDRSDRC2 Offset: 0x2c) High Speed Register -------- */
#define AT91C_DDRC2_DA        ((unsigned int) 0x1 <<  0) /* (HDDRSDRC2) Decode cycle*/
#define AT91C_DDRC2_NO_OPT    ((unsigned int) 0x1 <<  1) /* (HDDRSDRC2) Disable optimization*/
#define AT91C_DDRC2_NO_ANT    ((unsigned int) 0x1 <<  2) /* (HDDRSDRC2) Disable Anticipated read*/
#define AT91C_DDRC2_RES_DQS   ((unsigned int) 0x1 <<  3) /* (HDDRSDRC2) Reset DQS Active*/
/* -------- HDDRSDRC2_DELAY1 : (HDDRSDRC2 Offset: 0x30) Pad delay1 Register -------- */
#define AT91C_DDRC2_DELAY     ((unsigned int) 0xF <<  0) /* (HDDRSDRC2) Pad delay value*/
/* -------- HDDRSDRC2_DELAY2 : (HDDRSDRC2 Offset: 0x34) Pad delay2 Register -------- */
/* -------- HDDRSDRC2_DELAY3 : (HDDRSDRC2 Offset: 0x38) Pad delay3 Register -------- */
/* -------- HDDRSDRC2_DELAY4 : (HDDRSDRC2 Offset: 0x3c) Pad delay4 Register -------- */
/* -------- HDDRSDRC2_DELAY5 : (HDDRSDRC2 Offset: 0x40) Pad delay5 Register -------- */
/* -------- HDDRSDRC2_DELAY6 : (HDDRSDRC2 Offset: 0x44) Pad delay6 Register -------- */
/* -------- HDDRSDRC2_DELAY7 : (HDDRSDRC2 Offset: 0x48) Pad delay7 Register -------- */
/* -------- HDDRSDRC2_DELAY8 : (HDDRSDRC2 Offset: 0x4c) Pad delay8 Register -------- */
/* -------- HDDRSDRC2_WPCR : (HDDRSDRC2 Offset: 0xe4) Write Protect Control Register -------- */
#define AT91C_DDRC2_WPEN      ((unsigned int) 0x1 <<  0) /* (HDDRSDRC2) write protect enable*/
#define AT91C_DDRC2_WPKEY     ((unsigned int) 0xFFFFFF <<  8) /* (HDDRSDRC2) write protect key*/
/* -------- HDDRSDRC2_WPSR : (HDDRSDRC2 Offset: 0xe8) Write Protect Status Register -------- */
#define AT91C_DDRC2_WPVS      ((unsigned int) 0x1 <<  0) /* (HDDRSDRC2) write protect violation status*/
#define AT91C_DDRC2_WPSRC     ((unsigned int) 0xFFFF <<  8) /* (HDDRSDRC2) write protect source address*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Static Memory Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SMC {
	AT91_REG	 SMC_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SMC_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SMC_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SMC_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SMC_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SMC_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SMC_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SMC_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SMC_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SMC_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SMC_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SMC_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SMC_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SMC_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SMC_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SMC_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SMC_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SMC_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SMC_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SMC_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SMC_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SMC_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SMC_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SMC_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SMC_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SMC_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SMC_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SMC_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SMC_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SMC_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SMC_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SMC_CTRL7; 	/*  Control Register for CS 7*/
	AT91_REG	 Reserved0[16]; 	/* */
	AT91_REG	 SMC_DELAY1; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY2; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY3; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY4; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY5; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY6; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY7; 	/* SMC Delay Control Register*/
	AT91_REG	 SMC_DELAY8; 	/* SMC Delay Control Register*/
} AT91S_SMC, *AT91PS_SMC;

/* -------- SMC_SETUP : (SMC Offset: 0x0) Setup Register for CS x -------- */
#define AT91C_SMC_NWESETUP    ((unsigned int) 0x3F <<  0) /* (SMC) NWE Setup Length*/
#define AT91C_SMC_NCSSETUPWR  ((unsigned int) 0x3F <<  8) /* (SMC) NCS Setup Length in WRite Access*/
#define AT91C_SMC_NRDSETUP    ((unsigned int) 0x3F << 16) /* (SMC) NRD Setup Length*/
#define AT91C_SMC_NCSSETUPRD  ((unsigned int) 0x3F << 24) /* (SMC) NCS Setup Length in ReaD Access*/
/* -------- SMC_PULSE : (SMC Offset: 0x4) Pulse Register for CS x -------- */
#define AT91C_SMC_NWEPULSE    ((unsigned int) 0x7F <<  0) /* (SMC) NWE Pulse Length*/
#define AT91C_SMC_NCSPULSEWR  ((unsigned int) 0x7F <<  8) /* (SMC) NCS Pulse Length in WRite Access*/
#define AT91C_SMC_NRDPULSE    ((unsigned int) 0x7F << 16) /* (SMC) NRD Pulse Length*/
#define AT91C_SMC_NCSPULSERD  ((unsigned int) 0x7F << 24) /* (SMC) NCS Pulse Length in ReaD Access*/
/* -------- SMC_CYC : (SMC Offset: 0x8) Cycle Register for CS x -------- */
#define AT91C_SMC_NWECYCLE    ((unsigned int) 0x1FF <<  0) /* (SMC) Total Write Cycle Length*/
#define AT91C_SMC_NRDCYCLE    ((unsigned int) 0x1FF << 16) /* (SMC) Total Read Cycle Length*/
/* -------- SMC_CTRL : (SMC Offset: 0xc) Control Register for CS x -------- */
#define AT91C_SMC_READMODE    ((unsigned int) 0x1 <<  0) /* (SMC) Read Mode*/
#define AT91C_SMC_WRITEMODE   ((unsigned int) 0x1 <<  1) /* (SMC) Write Mode*/
#define AT91C_SMC_NWAITM      ((unsigned int) 0x3 <<  5) /* (SMC) NWAIT Mode*/
#define 	AT91C_SMC_NWAITM_NWAIT_DISABLE        ((unsigned int) 0x0 <<  5) /* (SMC) External NWAIT disabled.*/
#define 	AT91C_SMC_NWAITM_NWAIT_ENABLE_FROZEN  ((unsigned int) 0x2 <<  5) /* (SMC) External NWAIT enabled in frozen mode.*/
#define 	AT91C_SMC_NWAITM_NWAIT_ENABLE_READY   ((unsigned int) 0x3 <<  5) /* (SMC) External NWAIT enabled in ready mode.*/
#define AT91C_SMC_BAT         ((unsigned int) 0x1 <<  8) /* (SMC) Byte Access Type*/
#define 	AT91C_SMC_BAT_BYTE_SELECT          ((unsigned int) 0x0 <<  8) /* (SMC) Write controled by ncs, nbs0, nbs1, nbs2, nbs3. Read controled by ncs, nrd, nbs0, nbs1, nbs2, nbs3.*/
#define 	AT91C_SMC_BAT_BYTE_WRITE           ((unsigned int) 0x1 <<  8) /* (SMC) Write controled by ncs, nwe0, nwe1, nwe2, nwe3. Read controled by ncs and nrd.*/
#define AT91C_SMC_DBW         ((unsigned int) 0x3 << 12) /* (SMC) Data Bus Width*/
#define 	AT91C_SMC_DBW_WIDTH_EIGTH_BITS     ((unsigned int) 0x0 << 12) /* (SMC) 8 bits.*/
#define 	AT91C_SMC_DBW_WIDTH_SIXTEEN_BITS   ((unsigned int) 0x1 << 12) /* (SMC) 16 bits.*/
#define 	AT91C_SMC_DBW_WIDTH_THIRTY_TWO_BITS ((unsigned int) 0x2 << 12) /* (SMC) 32 bits.*/
#define AT91C_SMC_TDF         ((unsigned int) 0xF << 16) /* (SMC) Data Float Time.*/
#define AT91C_SMC_TDFEN       ((unsigned int) 0x1 << 20) /* (SMC) TDF Enabled.*/
#define AT91C_SMC_PMEN        ((unsigned int) 0x1 << 24) /* (SMC) Page Mode Enabled.*/
#define AT91C_SMC_PS          ((unsigned int) 0x3 << 28) /* (SMC) Page Size*/
#define 	AT91C_SMC_PS_SIZE_FOUR_BYTES      ((unsigned int) 0x0 << 28) /* (SMC) 4 bytes.*/
#define 	AT91C_SMC_PS_SIZE_EIGHT_BYTES     ((unsigned int) 0x1 << 28) /* (SMC) 8 bytes.*/
#define 	AT91C_SMC_PS_SIZE_SIXTEEN_BYTES   ((unsigned int) 0x2 << 28) /* (SMC) 16 bytes.*/
#define 	AT91C_SMC_PS_SIZE_THIRTY_TWO_BYTES ((unsigned int) 0x3 << 28) /* (SMC) 32 bytes.*/
/* -------- SMC_SETUP : (SMC Offset: 0x10) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x14) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x18) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x1c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x20) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x24) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x28) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x2c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x30) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x34) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x38) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x3c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x40) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x44) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x48) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x4c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x50) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x54) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x58) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x5c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x60) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x64) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x68) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x6c) Control Register for CS x -------- */
/* -------- SMC_SETUP : (SMC Offset: 0x70) Setup Register for CS x -------- */
/* -------- SMC_PULSE : (SMC Offset: 0x74) Pulse Register for CS x -------- */
/* -------- SMC_CYC : (SMC Offset: 0x78) Cycle Register for CS x -------- */
/* -------- SMC_CTRL : (SMC Offset: 0x7c) Control Register for CS x -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR AHB Matrix Interface*/
/* ******************************************************************************/
typedef struct _AT91S_MATRIX {
	AT91_REG	 MATRIX_MCFG0; 	/*  Master Configuration Register 0 : ARM-I*/
	AT91_REG	 MATRIX_MCFG1; 	/*  Master Configuration Register 1 ; ARM-D*/
	AT91_REG	 MATRIX_MCFG2; 	/*  Master Configuration Register 2 : pdc*/
	AT91_REG	 MATRIX_MCFG3; 	/*  Master Configuration Register 3 : USB Host OHCI*/
	AT91_REG	 MATRIX_MCFG4; 	/*  Master Configuration Register 4 : DMA0*/
	AT91_REG	 MATRIX_MCFG5; 	/*  Master Configuration Register 5 : DMA1*/
	AT91_REG	 MATRIX_MCFG6; 	/*  Master Configuration Register 6 : hisi*/
	AT91_REG	 MATRIX_MCFG7; 	/*  Master Configuration Register 7 : lcdc*/
	AT91_REG	 MATRIX_MCFG8; 	/*  Master Configuration Register 8 : eMAC*/
	AT91_REG	 MATRIX_MCFG9; 	/*  Master Configuration Register 9 : USB Device*/
	AT91_REG	 MATRIX_MCFG10; 	/*  Master Configuration Register 10 : USB Host EHCI*/
	AT91_REG	 MATRIX_MCFG11; 	/*  Master Configuration Register 11 : Video Decoder*/
	AT91_REG	 Reserved0[4]; 	/* */
	AT91_REG	 MATRIX_SCFG0; 	/*  Slave Configuration Register 0 : SRAM S0*/
	AT91_REG	 MATRIX_SCFG1; 	/*  Slave Configuration Register 1 : SRAM S1*/
	AT91_REG	 MATRIX_SCFG2; 	/*  Slave Configuration Register 2 : SRAM S2*/
	AT91_REG	 MATRIX_SCFG3; 	/*  Slave Configuration Register 3 : SRAM S3*/
	AT91_REG	 MATRIX_SCFG4; 	/*  Slave Configuration Register 4 ; ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
	AT91_REG	 MATRIX_SCFG5; 	/*  Slave Configuration Register 5 : DDR2 S0*/
	AT91_REG	 MATRIX_SCFG6; 	/*  Slave Configuration Register 6 : DDR2 S1*/
	AT91_REG	 MATRIX_SCFG7; 	/*  Slave Configuration Register 7 : DDR2 S2*/
	AT91_REG	 Reserved1[8]; 	/* */
	AT91_REG	 MATRIX_PRAS0; 	/*  PRAS0 : SRAM S0*/
	AT91_REG	 MATRIX_PRBS0; 	/*  PRBS0 : SRAM S0*/
	AT91_REG	 MATRIX_PRAS1; 	/*  PRAS1 : SRAM S1*/
	AT91_REG	 MATRIX_PRBS1; 	/*  PRBS1 : SRAM S1*/
	AT91_REG	 MATRIX_PRAS2; 	/*  PRAS2 : SRAM S2*/
	AT91_REG	 MATRIX_PRBS2; 	/*  PRBS2 : SRAM S2*/
	AT91_REG	 MATRIX_PRAS3; 	/*  PRAS3 : SRAM S3*/
	AT91_REG	 MATRIX_PRBS3; 	/*  PRBS3 : SRAM S3*/
	AT91_REG	 MATRIX_PRAS4; 	/*  PRAS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
	AT91_REG	 MATRIX_PRBS4; 	/*  PRBS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
	AT91_REG	 MATRIX_PRAS5; 	/*  PRAS5 : DDR2 S0*/
	AT91_REG	 MATRIX_PRBS5; 	/*  PRBS5 : DDR2 S0*/
	AT91_REG	 MATRIX_PRAS6; 	/*  PRAS6 : DDR2 S1*/
	AT91_REG	 MATRIX_PRBS6; 	/*  PRBS6 : DDR2 S1*/
	AT91_REG	 MATRIX_PRAS7; 	/*  PRAS7 : DDR2 S2*/
	AT91_REG	 MATRIX_PRBS7; 	/*  PRBS7 : DDR2 S2*/
	AT91_REG	 Reserved2[16]; 	/* */
	AT91_REG	 MATRIX_MRCR; 	/*  Master Remap Control Register */
	AT91_REG	 Reserved3[56]; 	/* */
	AT91_REG	 MATRIX_WRPROTEN; 	/*  Write Protection Control Register */
	AT91_REG	 MATRIX_WRPROTST; 	/*  Write Protection Status Register */
} AT91S_MATRIX, *AT91PS_MATRIX;

