una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- */
#define AT91C_PMC_DDR         ((unsigned int) 0x1 <<  2) /* (PMC) DDR controller Clock2x*/
#define AT91C_PMC_UHP         ((unsigned int) 0x1 <<  6) /* (PMC) USB Host Port Clock*/
#define AT91C_PMC_UDP         ((unsigned int) 0x1 <<  7) /* (PMC) USB Device Port Clock*/
#define AT91C_PMC_PCK0        ((unsigned int) 0x1 <<  8) /* (PMC) Programmable Clock Output*/
#define AT91C_PMC_PCK1        ((unsigned int) 0x1 <<  9) /* (PMC) Programmable Clock Output*/
/* -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- */
#define AT91C_PMC_PCK         ((unsigned int) 0x1 <<  0) /* (PMC) Processor Clock*/
/* -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- */
/* -------- CKGR_UCKR : (PMC Offset: 0x1c) UTMI Clock Configuration Register -------- */
#define AT91C_CKGR_UPLLEN     ((unsigned int) 0x1 << 16) /* (PMC) UTMI PLL Enable*/
#define 	AT91C_CKGR_UPLLEN_DISABLED             ((unsigned int) 0x0 << 16) /* (PMC) The UTMI PLL is disabled*/
#define 	AT91C_CKGR_UPLLEN_ENABLED              ((unsigned int) 0x1 << 16) /* (PMC) The UTMI PLL is enabled*/
#define AT91C_CKGR_PLLCOUNT   ((unsigned int) 0xF << 20) /* (PMC) UTMI Oscillator Start-up Time*/
#define AT91C_CKGR_BIASEN     ((unsigned int) 0x1 << 24) /* (PMC) UTMI BIAS Enable*/
#define 	AT91C_CKGR_BIASEN_DISABLED             ((unsigned int) 0x0 << 24) /* (PMC) The UTMI BIAS is disabled*/
#define 	AT91C_CKGR_BIASEN_ENABLED              ((unsigned int) 0x1 << 24) /* (PMC) The UTMI BIAS is enabled*/
#define AT91C_CKGR_BIASCOUNT  ((unsigned int) 0xF << 28) /* (PMC) UTMI BIAS Start-up Time*/
/* -------- CKGR_MOR : (PMC Offset: 0x20) Main Oscillator Register -------- */
#define AT91C_CKGR_MOSCEN     ((unsigned int) 0x1 <<  0) /* (PMC) Main Oscillator Enable*/
#define AT91C_CKGR_OSCBYPASS  ((unsigned int) 0x1 <<  1) /* (PMC) Main Oscillator Bypass*/
#define AT91C_CKGR_OSCOUNT    ((unsigned int) 0xFF <<  8) /* (PMC) Main Oscillator Start-up Time*/
/* -------- CKGR_MCFR : (PMC Offset: 0x24) Main Clock Frequency Register -------- */
#define AT91C_CKGR_MAINF      ((unsigned int) 0xFFFF <<  0) /* (PMC) Main Clock Frequency*/
#define AT91C_CKGR_MAINRDY    ((unsigned int) 0x1 << 16) /* (PMC) Main Clock Ready*/
/* -------- CKGR_PLLAR : (PMC Offset: 0x28) PLL A Register -------- */
#define AT91C_CKGR_DIVA       ((unsigned int) 0xFF <<  0) /* (PMC) Divider A Selected*/
#define 	AT91C_CKGR_DIVA_0                    ((unsigned int) 0x0) /* (PMC) Divider A output is 0*/
#define 	AT91C_CKGR_DIVA_BYPASS               ((unsigned int) 0x1) /* (PMC) Divider A is bypassed*/
#define AT91C_CKGR_PLLACOUNT  ((unsigned int) 0x3F <<  8) /* (PMC) PLL A Counter*/
#define AT91C_CKGR_OUTA       ((unsigned int) 0x3 << 14) /* (PMC) PLL A Output Frequency Range*/
#define 	AT91C_CKGR_OUTA_0                    ((unsigned int) 0x0 << 14) /* (PMC) Please refer to the PLLA datasheet*/
#define 	AT91C_CKGR_OUTA_1                    ((unsigned int) 0x1 << 14) /* (PMC) Please refer to the PLLA datasheet*/
#define 	AT91C_CKGR_OUTA_2                    ((unsigned int) 0x2 << 14) /* (PMC) Please refer to the PLLA datasheet*/
#define 	AT91C_CKGR_OUTA_3                    ((unsigned int) 0x3 << 14) /* (PMC) Please refer to the PLLA datasheet*/
#define AT91C_CKGR_MULA       ((unsigned int) 0xFF << 16) /* (PMC) PLL A Multiplier*/
#define AT91C_CKGR_SRCA       ((unsigned int) 0x1 << 29) /* (PMC) */
/* -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- */
#define AT91C_PMC_CSS         ((unsigned int) 0x3 <<  0) /* (PMC) Programmable Clock Selection*/
#define 	AT91C_PMC_CSS_SLOW_CLK             ((unsigned int) 0x0) /* (PMC) Slow Clock is selected*/
#define 	AT91C_PMC_CSS_MAIN_CLK             ((unsigned int) 0x1) /* (PMC) Main Clock is selected*/
#define 	AT91C_PMC_CSS_PLLA_CLK             ((unsigned int) 0x2) /* (PMC) Clock from PLL A is selected*/
#define 	AT91C_PMC_CSS_UPLL_CLK             ((unsigned int) 0x3) /* (PMC) Clock from UTMI PLL is selected*/
#define AT91C_PMC_PRES        ((unsigned int) 0x7 <<  2) /* (PMC) Programmable Clock Prescaler*/
#define 	AT91C_PMC_PRES_CLK                  ((unsigned int) 0x0 <<  2) /* (PMC) Selected clock*/
#define 	AT91C_PMC_PRES_CLK_2                ((unsigned int) 0x1 <<  2) /* (PMC) Selected clock divided by 2*/
#define 	AT91C_PMC_PRES_CLK_4                ((unsigned int) 0x2 <<  2) /* (PMC) Selected clock divided by 4*/
#define 	AT91C_PMC_PRES_CLK_8                ((unsigned int) 0x3 <<  2) /* (PMC) Selected clock divided by 8*/
#define 	AT91C_PMC_PRES_CLK_16               ((unsigned int) 0x4 <<  2) /* (PMC) Selected clock divided by 16*/
#define 	AT91C_PMC_PRES_CLK_32               ((unsigned int) 0x5 <<  2) /* (PMC) Selected clock divided by 32*/
#define 	AT91C_PMC_PRES_CLK_64               ((unsigned int) 0x6 <<  2) /* (PMC) Selected clock divided by 64*/
#define AT91C_PMC_MDIV        ((unsigned int) 0x3 <<  8) /* (PMC) Master Clock Division*/
#define 	AT91C_PMC_MDIV_1                    ((unsigned int) 0x0 <<  8) /* (PMC) Processor clock = Master Clock ; DDR Clock = Master Clock*/
#define 	AT91C_PMC_MDIV_2                    ((unsigned int) 0x1 <<  8) /* (PMC) Processor clock = 2 * Master Clock ; DDR Clock = 2 * Master Clock*/
#define 	AT91C_PMC_MDIV_4                    ((unsigned int) 0x2 <<  8) /* (PMC) Processor clock = 4 * Master Clock ; DDR Clock = 2 * Master Clock*/
#define 	AT91C_PMC_MDIV_3                    ((unsigned int) 0x3 <<  8) /* (PMC) Processor clock = 3 * Master Clock ; DDR Clock = 2 * Master Clock*/
#define AT91C_PMC_PLLADIV2    ((unsigned int) 0x1 << 12) /* (PMC) PLLA divisor by 2*/
#define 	AT91C_PMC_PLLADIV2_1                    ((unsigned int) 0x0 << 12) /* (PMC) PLLA clock frequency is divided by 1*/
#define 	AT91C_PMC_PLLADIV2_2                    ((unsigned int) 0x1 << 12) /* (PMC) PLLA clock frequency is divided by 2*/
/* -------- PMC_USB : (PMC Offset: 0x38) USB Clock Register -------- */
#define AT91C_PMC_USBS        ((unsigned int) 0x1 <<  0) /* (PMC) USBS*/
#define 	AT91C_PMC_USBS_USB_PLLA             ((unsigned int) 0x0) /* (PMC) USB Clock Input is PLLA*/
#define 	AT91C_PMC_USBS_USB_UPLL             ((unsigned int) 0x1) /* (PMC) USB Clock Input is UPLL*/
#define AT91C_PMC_USBDIV      ((unsigned int) 0xF <<  8) /* (PMC) USBDIV*/
#define 	AT91C_PMC_USBDIV_1                    ((unsigned int) 0x0 <<  8) /* (PMC) USB Clock divided by 1*/
#define 	AT91C_PMC_USBDIV_2                    ((unsigned int) 0x1 <<  8) /* (PMC) USB Clock divided by 2*/
#define 	AT91C_PMC_USBDIV_3                    ((unsigned int) 0x2 <<  8) /* (PMC) USB Clock divided by 3*/
#define 	AT91C_PMC_USBDIV_4                    ((unsigned int) 0x3 <<  8) /* (PMC) USB Clock divided by 4*/
#define 	AT91C_PMC_USBDIV_5                    ((unsigned int) 0x4 <<  8) /* (PMC) USB Clock divided by 5*/
#define 	AT91C_PMC_USBDIV_6                    ((unsigned int) 0x5 <<  8) /* (PMC) USB Clock divided by 6*/
#define 	AT91C_PMC_USBDIV_7                    ((unsigned int) 0x6 <<  8) /* (PMC) USB Clock divided by 7*/
#define 	AT91C_PMC_USBDIV_8                    ((unsigned int) 0x7 <<  8) /* (PMC) USB Clock divided by 8*/
#define 	AT91C_PMC_USBDIV_9                    ((unsigned int) 0x8 <<  8) /* (PMC) USB Clock divided by 9*/
#define 	AT91C_PMC_USBDIV_10                   ((unsigned int) 0x9 <<  8) /* (PMC) USB Clock divided by 10*/
#define 	AT91C_PMC_USBDIV_11                   ((unsigned int) 0xA <<  8) /* (PMC) USB Clock divided by 11*/
#define 	AT91C_PMC_USBDIV_12                   ((unsigned int) 0xB <<  8) /* (PMC) USB Clock divided by 12*/
#define 	AT91C_PMC_USBDIV_13                   ((unsigned int) 0xC <<  8) /* (PMC) USB Clock divided by 13*/
#define 	AT91C_PMC_USBDIV_14                   ((unsigned int) 0xD <<  8) /* (PMC) USB Clock divided by 14*/
#define 	AT91C_PMC_USBDIV_15                   ((unsigned int) 0xE <<  8) /* (PMC) USB Clock divided by 15*/
#define 	AT91C_PMC_USBDIV_16                   ((unsigned int) 0xF <<  8) /* (PMC) USB Clock divided by 16*/
/* -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock 0 Register -------- */
#define AT91C_PMC_SLCKMCK     ((unsigned int) 0x1 <<  8) /* (PMC) Programmable Clock Prescaler*/
#define 	AT91C_PMC_SLCKMCK_SLCK                 ((unsigned int) 0x0 <<  8) /* (PMC) Slow Clock selected*/
#define 	AT91C_PMC_SLCKMCK_MCK                  ((unsigned int) 0x1 <<  8) /* (PMC) Master Clock selected*/
/* -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- */
#define AT91C_PMC_MOSCS       ((unsigned int) 0x1 <<  0) /* (PMC) MOSC Status/Enable/Disable/Mask*/
#define AT91C_PMC_LOCKA       ((unsigned int) 0x1 <<  1) /* (PMC) PLL A Status/Enable/Disable/Mask*/
#define AT91C_PMC_MCKRDY      ((unsigned int) 0x1 <<  3) /* (PMC) Master Clock Status/Enable/Disable/Mask*/
#define AT91C_PMC_LOCKU       ((unsigned int) 0x1 <<  6) /* (PMC) PLL UTMI Status/Enable/Disable/Mask*/
#define AT91C_PMC_PCK0RDY     ((unsigned int) 0x1 <<  8) /* (PMC) PCK0_RDY Status/Enable/Disable/Mask*/
#define AT91C_PMC_PCK1RDY     ((unsigned int) 0x1 <<  9) /* (PMC) PCK1_RDY Status/Enable/Disable/Mask*/
/* -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- */
/* -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- */
/* -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- */
/* -------- PMC_PLLICPR : (PMC Offset: 0x80) PLL Charge Pump Current Register -------- */
#define AT91C_PMC_ICPPLLA     ((unsigned int) 0xF <<  0) /* (PMC) PLLA charge pump current setting*/
#define 	AT91C_PMC_ICPPLLA_0                    ((unsigned int) 0x0) /* (PMC) 595-800 MHz*/
#define 	AT91C_PMC_ICPPLLA_1                    ((unsigned int) 0x1) /* (PMC) 395-600 MHz*/
#define AT91C_PMC_REALLOCK    ((unsigned int) 0x1 <<  7) /* (PMC) PLLs use real lock signals when 1*/
#define AT91C_PMC_IPLLA       ((unsigned int) 0xF <<  8) /* (PMC) PLLA special setting*/
#define 	AT91C_PMC_IPLLA_0                    ((unsigned int) 0x0 <<  8) /* (PMC) Internal LFT*/
#define 	AT91C_PMC_IPLLA_1                    ((unsigned int) 0x1 <<  8) /* (PMC) External LFT*/
/* -------- PMC_FEATURES : (PMC Offset: 0xf8)   -------- */
#define AT91C_PMC_CFGAHBCLK   ((unsigned int) 0x1 <<  0) /* (PMC) */
#define 	AT91C_PMC_CFGAHBCLK_0                    ((unsigned int) 0x0) /* (PMC) */
#define 	AT91C_PMC_CFGAHBCLK_1                    ((unsigned int) 0x1) /* (PMC) */
#define AT91C_PMC_HCLKEN      ((unsigned int) 0x1 <<  1) /* (PMC) */
#define 	AT91C_PMC_HCLKEN_0                    ((unsigned int) 0x0 <<  1) /* (PMC) */
#define 	AT91C_PMC_HCLKEN_1                    ((unsigned int) 0x1 <<  1) /* (PMC) */
#define AT91C_PMC_PERMCLK     ((unsigned int) 0x1 <<  2) /* (PMC) */
#define 	AT91C_PMC_PERMCLK_0                    ((unsigned int) 0x0 <<  2) /* (PMC) */
#define 	AT91C_PMC_PERMCLK_1                    ((unsigned int) 0x1 <<  2) /* (PMC) */
#define AT91C_PMC_CORE2       ((unsigned int) 0x1 <<  3) /* (PMC) */
#define 	AT91C_PMC_CORE2_0                    ((unsigned int) 0x0 <<  3) /* (PMC) */
#define 	AT91C_PMC_CORE2_1                    ((unsigned int) 0x1 <<  3) /* (PMC) */
#define AT91C_PMC_USBDEVCK    ((unsigned int) 0x1 <<  4) /* (PMC) */
#define 	AT91C_PMC_USBDEVCK_0                    ((unsigned int) 0x0 <<  4) /* (PMC) */
#define 	AT91C_PMC_USBDEVCK_1                    ((unsigned int) 0x1 <<  4) /* (PMC) */
#define AT91C_PMC_USBHOSTCK   ((unsigned int) 0x1 <<  5) /* (PMC) */
#define 	AT91C_PMC_USBHOSTCK_0                    ((unsigned int) 0x0 <<  5) /* (PMC) */
#define 	AT91C_PMC_USBHOSTCK_1                    ((unsigned int) 0x1 <<  5) /* (PMC) */
#define AT91C_PMC_USBOTGCK    ((unsigned int) 0x1 <<  6) /* (PMC) */
#define 	AT91C_PMC_USBOTGCK_0                    ((unsigned int) 0x0 <<  6) /* (PMC) */
#define 	AT91C_PMC_USBOTGCK_1                    ((unsigned int) 0x1 <<  6) /* (PMC) */
#define AT91C_PMC_UHSYNRST    ((unsigned int) 0x1 <<  7) /* (PMC) */
#define 	AT91C_PMC_UHSYNRST_0                    ((unsigned int) 0x0 <<  7) /* (PMC) */
#define 	AT91C_PMC_UHSYNRST_1                    ((unsigned int) 0x1 <<  7) /* (PMC) */
#define AT91C_PMC_UOSYNRST    ((unsigned int) 0x1 <<  8) /* (PMC) */
#define 	AT91C_PMC_UOSYNRST_0                    ((unsigned int) 0x0 <<  8) /* (PMC) */
#define 	AT91C_PMC_UOSYNRST_1                    ((unsigned int) 0x1 <<  8) /* (PMC) */
#define AT91C_PMC_PLLENPOL    ((unsigned int) 0x1 <<  9) /* (PMC) */
#define 	AT91C_PMC_PLLENPOL_0                    ((unsigned int) 0x0 <<  9) /* (PMC) */
#define 	AT91C_PMC_PLLENPOL_1                    ((unsigned int) 0x1 <<  9) /* (PMC) */
#define AT91C_PMC_BIASREG     ((unsigned int) 0x1 << 10) /* (PMC) */
#define 	AT91C_PMC_BIASREG_0                    ((unsigned int) 0x0 << 10) /* (PMC) */
#define 	AT91C_PMC_BIASREG_1                    ((unsigned int) 0x1 << 10) /* (PMC) */
#define AT91C_PMC_OUTPLL      ((unsigned int) 0x1 << 11) /* (PMC) */
#define 	AT91C_PMC_OUTPLL_0                    ((unsigned int) 0x0 << 11) /* (PMC) */
#define 	AT91C_PMC_OUTPLL_1                    ((unsigned int) 0x1 << 11) /* (PMC) */
#define AT91C_PMC_OUTCURR     ((unsigned int) 0x1 << 12) /* (PMC) */
#define 	AT91C_PMC_OUTCURR_0                    ((unsigned int) 0x0 << 12) /* (PMC) */
#define 	AT91C_PMC_OUTCURR_1                    ((unsigned int) 0x1 << 12) /* (PMC) */
#define AT91C_PMC_FWUP        ((unsigned int) 0x1 << 13) /* (PMC) */
#define 	AT91C_PMC_FWUP_0                    ((unsigned int) 0x0 << 13) /* (PMC) */
#define 	AT91C_PMC_FWUP_1                    ((unsigned int) 0x1 << 13) /* (PMC) */
#define AT91C_PMC_SELMAINCLK  ((unsigned int) 0x1 << 14) /* (PMC) */
#define 	AT91C_PMC_SELMAINCLK_0                    ((unsigned int) 0x0 << 14) /* (PMC) */
#define 	AT91C_PMC_SELMAINCLK_1                    ((unsigned int) 0x1 << 14) /* (PMC) */
#define AT91C_PMC_RSTCLKM     ((unsigned int) 0x1 << 15) /* (PMC) */
#define 	AT91C_PMC_RSTCLKM_0                    ((unsigned int) 0x0 << 15) /* (PMC) */
#define 	AT91C_PMC_RSTCLKM_1                    ((unsigned int) 0x1 << 15) /* (PMC) */
#define AT91C_PMC_NB_PERIPH_CLOCK ((unsigned int) 0xFF << 16) /* (PMC) */
/* -------- PMC_VERSION : (PMC Offset: 0xfc)   -------- */
#define AT91C_PMC_Version     ((unsigned int) 0xFFFF <<  0) /* (PMC) */
#define 	AT91C_PMC_Version_0                    ((unsigned int) 0x0) /* (PMC) */
#define 	AT91C_PMC_Version_1                    ((unsigned int) 0x1) /* (PMC) */
#define AT91C_PMC_MFN         ((unsigned int) 0x7 << 16) /* (PMC) */
#define 	AT91C_PMC_MFN_0                    ((unsigned int) 0x0 << 16) /* (PMC) */
#define 	AT91C_PMC_MFN_1                    ((unsigned int) 0x1 << 16) /* (PMC) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Clock Generator Controler*/
/* ******************************************************************************/
typedef struct _AT91S_CKGR {
	AT91_REG	 CKGR_UCKR; 	/* UTMI Clock Configuration Register*/
	AT91_REG	 CKGR_MOR; 	/* Main Oscillator Register*/
	AT91_REG	 CKGR_MCFR; 	/* Main Clock  Frequency Register*/
	AT91_REG	 CKGR_PLLAR; 	/* PLL A Register*/
} AT91S_CKGR, *AT91PS_CKGR;

/* -------- CKGR_UCKR : (CKGR Offset: 0x0) UTMI Clock Configuration Register -------- */
/* -------- CKGR_MOR : (CKGR Offset: 0x4) Main Oscillator Register -------- */
/* -------- CKGR_MCFR : (CKGR Offset: 0x8) Main Clock Frequency Register -------- */
/* -------- CKGR_PLLAR : (CKGR Offset: 0xc) PLL A Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Reset Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_RSTC {
	AT91_REG	 RSTC_RCR; 	/* Reset Control Register*/
	AT91_REG	 RSTC_RSR; 	/* Reset Status Register*/
	AT91_REG	 RSTC_RMR; 	/* Reset Mode Register*/
} AT91S_RSTC, *AT91PS_RSTC;

/* -------- RSTC_RCR : (RSTC Offset: 0x0) Reset Control Register -------- */
#define AT91C_RSTC_PROCRST    ((unsigned int) 0x1 <<  0) /* (RSTC) Processor Reset*/
#define AT91C_RSTC_ICERST     ((unsigned int) 0x1 <<  1) /* (RSTC) ICE Interface Reset*/
#define AT91C_RSTC_PERRST     ((unsigned int) 0x1 <<  2) /* (RSTC) Peripheral Reset*/
#define AT91C_RSTC_EXTRST     ((unsigned int) 0x1 <<  3) /* (RSTC) External Reset*/
#define AT91C_RSTC_KEY        ((unsigned int) 0xFF << 24) /* (RSTC) Password*/
/* -------- RSTC_RSR : (RSTC Offset: 0x4) Reset Status Register -------- */
#define AT91C_RSTC_URSTS      ((unsigned int) 0x1 <<  0) /* (RSTC) User Reset Status*/
#define AT91C_RSTC_RSTTYP     ((unsigned int) 0x7 <<  8) /* (RSTC) Reset Type*/
#define 	AT91C_RSTC_RSTTYP_GENERAL              ((unsigned int) 0x0 <<  8) /* (RSTC) General reset. Both VDDCORE and VDDBU rising.*/
#define 	AT91C_RSTC_RSTTYP_WAKEUP               ((unsigned int) 0x1 <<  8) /* (RSTC) WakeUp Reset. VDDCORE rising.*/
#define 	AT91C_RSTC_RSTTYP_WATCHDOG             ((unsigned int) 0x2 <<  8) /* (RSTC) Watchdog Reset. Watchdog overflow occured.*/
#define 	AT91C_RSTC_RSTTYP_SOFTWARE             ((unsigned int) 0x3 <<  8) /* (RSTC) Software Reset. Processor reset required by the software.*/
#define 	AT91C_RSTC_RSTTYP_USER                 ((unsigned int) 0x4 <<  8) /* (RSTC) User Reset. NRST pin detected low.*/
#define AT91C_RSTC_NRSTL      ((unsigned int) 0x1 << 16) /* (RSTC) NRST pin level*/
#define AT91C_RSTC_SRCMP      ((unsigned int) 0x1 << 17) /* (RSTC) Software Reset Command in Progress.*/
/* -------- RSTC_RMR : (RSTC Offset: 0x8) Reset Mode Register -------- */
#define AT91C_RSTC_URSTEN     ((unsigned int) 0x1 <<  0) /* (RSTC) User Reset Enable*/
#define AT91C_RSTC_URSTIEN    ((unsigned int) 0x1 <<  4) /* (RSTC) User Reset Interrupt Enable*/
#define AT91C_RSTC_ERSTL      ((unsigned int) 0xF <<  8) /* (RSTC) User Reset Enable*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Shut Down Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SHDWC {
	AT91_REG	 SHDWC_SHCR; 	/* Shut Down Control Register*/
	AT91_REG	 SHDWC_SHMR; 	/* Shut Down Mode Register*/
	AT91_REG	 SHDWC_SHSR; 	/* Shut Down Status Register*/
} AT91S_SHDWC, *AT91PS_SHDWC;

/* -------- SHDWC_SHCR : (SHDWC Offset: 0x0) Shut Down Control Register -------- */
#define AT91C_SHDWC_SHDW      ((unsigned int) 0x1 <<  0) /* (SHDWC) Processor Reset*/
#define AT91C_SHDWC_KEY       ((unsigned int) 0xFF << 24) /* (SHDWC) Shut down KEY Password*/
/* -------- SHDWC_SHMR : (SHDWC Offset: 0x4) Shut Down Mode Register -------- */
#define AT91C_SHDWC_WKMODE0   ((unsigned int) 0x3 <<  0) /* (SHDWC) Wake Up 0 Mode Selection*/
#define 	AT91C_SHDWC_WKMODE0_NONE                 ((unsigned int) 0x0) /* (SHDWC) None. No detection is performed on the wake up input.*/
#define 	AT91C_SHDWC_WKMODE0_HIGH                 ((unsigned int) 0x1) /* (SHDWC) High Level.*/
#define 	AT91C_SHDWC_WKMODE0_LOW                  ((unsigned int) 0x2) /* (SHDWC) Low Level.*/
#define 	AT91C_SHDWC_WKMODE0_ANYLEVEL             ((unsigned int) 0x3) /* (SHDWC) Any level change.*/
#define AT91C_SHDWC_CPTWK0    ((unsigned int) 0xF <<  4) /* (SHDWC) Counter On Wake Up 0*/
#define AT91C_SHDWC_RTTWKEN   ((unsigned int) 0x1 << 16) /* (SHDWC) Real Time Timer Wake Up Enable*/
/* -------- SHDWC_SHSR : (SHDWC Offset: 0x8) Shut Down Status Register -------- */
#define AT91C_SHDWC_WAKEUP0   ((unsigned int) 0x1 <<  0) /* (SHDWC) Wake Up 0 Status*/
#define AT91C_SHDWC_RTTWK     ((unsigned int) 0x1 << 16) /* (SHDWC) Real Time Timer wake Up*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Real Time Timer Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_RTTC {
	AT91_REG	 RTTC_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 RTTC_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 RTTC_RTVR; 	/* Real-time Value Register*/
	AT91_REG	 RTTC_RTSR; 	/* Real-time Status Register*/
} AT91S_RTTC, *AT91PS_RTTC;

