una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- TSADC_CR : (TSADC Offset: 0x0) Control Register -------- */
#define AT91C_TSADC_SWRST     ((unsigned int) 0x1 <<  0) /* (TSADC) Software Reset*/
#define AT91C_TSADC_START     ((unsigned int) 0x1 <<  1) /* (TSADC) Start Conversion*/
/* -------- TSADC_MR : (TSADC Offset: 0x4) Mode Register -------- */
#define AT91C_TSADC_TSAMOD    ((unsigned int) 0x3 <<  0) /* (TSADC) Touch Screen ADC Mode*/
#define 	AT91C_TSADC_TSAMOD_ADC_ONLY_MODE        ((unsigned int) 0x0) /* (TSADC) ADC Mode*/
#define 	AT91C_TSADC_TSAMOD_TS_ONLY_MODE         ((unsigned int) 0x1) /* (TSADC) Touch Screen Only Mode*/
#define AT91C_TSADC_LOWRES    ((unsigned int) 0x1 <<  4) /* (TSADC) ADC Resolution*/
#define AT91C_TSADC_SLEEP     ((unsigned int) 0x1 <<  5) /* (TSADC) Sleep Mode*/
#define AT91C_TSADC_PENDET    ((unsigned int) 0x1 <<  6) /* (TSADC) Pen Detect Selection*/
#define AT91C_TSADC_PRESCAL   ((unsigned int) 0x3F <<  8) /* (TSADC) Prescaler Rate Selection*/
#define AT91C_TSADC_STARTUP   ((unsigned int) 0x7F << 16) /* (TSADC) Startup Time*/
#define AT91C_TSADC_SHTIM     ((unsigned int) 0xF << 24) /* (TSADC) Sample and Hold Time for ADC Channels*/
#define AT91C_TSADC_PENDBC    ((unsigned int) 0xF << 28) /* (TSADC) Pen Detect Debouncing Period*/
/* -------- TSADC_TRGR : (TSADC Offset: 0x8) Trigger Register -------- */
#define AT91C_TSADC_TRGMOD    ((unsigned int) 0x7 <<  0) /* (TSADC) Trigger Mode*/
#define 	AT91C_TSADC_TRGMOD_NO_TRIGGER           ((unsigned int) 0x0) /* (TSADC) No Trigger*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_RE  ((unsigned int) 0x1) /* (TSADC) External Trigger Rising Edge*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_FE  ((unsigned int) 0x2) /* (TSADC) External Trigger Falling Edge*/
#define 	AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_AE  ((unsigned int) 0x3) /* (TSADC) External Trigger Any Edge*/
#define 	AT91C_TSADC_TRGMOD_PENDET_TRIGGER       ((unsigned int) 0x4) /* (TSADC) Pen Detect Trigger (only if PENDET is set and in Touch Screen mode only)*/
#define 	AT91C_TSADC_TRGMOD_PERIODIC_TRIGGER     ((unsigned int) 0x5) /* (TSADC) Periodic Trigger (wrt TRGPER)*/
#define 	AT91C_TSADC_TRGMOD_CONT_TRIGGER         ((unsigned int) 0x6) /* (TSADC) Continuous Trigger*/
#define AT91C_TSADC_TRGPER    ((unsigned int) 0xFFFF << 16) /* (TSADC) Trigger Period*/
/* -------- TSADC_TSR : (TSADC Offset: 0xc) Touch Screen Register -------- */
#define AT91C_TSADC_TSSHTIM   ((unsigned int) 0xF << 24) /* (TSADC) Sample and Hold Time for Touch Screen Channels*/
/* -------- TSADC_CHER : (TSADC Offset: 0x10) Channel Enable Register -------- */
#define AT91C_TSADC_CHENA0    ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Enable*/
#define AT91C_TSADC_CHENA1    ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Enable*/
#define AT91C_TSADC_CHENA2    ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Enable*/
#define AT91C_TSADC_CHENA3    ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Enable*/
#define AT91C_TSADC_CHENA4    ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Enable*/
#define AT91C_TSADC_CHENA5    ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Enable*/
#define AT91C_TSADC_CHENA6    ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 Enable*/
#define AT91C_TSADC_CHENA7    ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 Enable*/
/* -------- TSADC_CHDR : (TSADC Offset: 0x14) Channel Disable Register -------- */
#define AT91C_TSADC_CHDIS0    ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Disable*/
#define AT91C_TSADC_CHDIS1    ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Disable*/
#define AT91C_TSADC_CHDIS2    ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Disable*/
#define AT91C_TSADC_CHDIS3    ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Disable*/
#define AT91C_TSADC_CHDIS4    ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Disable*/
#define AT91C_TSADC_CHDIS5    ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Disable*/
#define AT91C_TSADC_CHDIS6    ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 Disable*/
#define AT91C_TSADC_CHDIS7    ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 Disable*/
/* -------- TSADC_CHSR : (TSADC Offset: 0x18) Channel Status Register -------- */
#define AT91C_TSADC_CHS0      ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 Status*/
#define AT91C_TSADC_CHS1      ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 Status*/
#define AT91C_TSADC_CHS2      ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 Status*/
#define AT91C_TSADC_CHS3      ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 Status*/
#define AT91C_TSADC_CHS4      ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 Status*/
#define AT91C_TSADC_CHS5      ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 Status*/
#define AT91C_TSADC_CHS6      ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 Status*/
#define AT91C_TSADC_CHS7      ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 Status*/
/* -------- TSADC_SR : (TSADC Offset: 0x1c) Status Register -------- */
#define AT91C_TSADC_EOC0      ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion*/
#define AT91C_TSADC_EOC1      ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion*/
#define AT91C_TSADC_EOC2      ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion*/
#define AT91C_TSADC_EOC3      ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion*/
#define AT91C_TSADC_EOC4      ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion*/
#define AT91C_TSADC_EOC5      ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion*/
#define AT91C_TSADC_EOC6      ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 End Of Conversion*/
#define AT91C_TSADC_EOC7      ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 End Of Conversion*/
#define AT91C_TSADC_OVRE0     ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error*/
#define AT91C_TSADC_OVRE1     ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error*/
#define AT91C_TSADC_OVRE2     ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error*/
#define AT91C_TSADC_OVRE3     ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error*/
#define AT91C_TSADC_OVRE4     ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error*/
#define AT91C_TSADC_OVRE5     ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error*/
#define AT91C_TSADC_OVRE6     ((unsigned int) 0x1 << 14) /* (TSADC) Channel 6 Overrun Error*/
#define AT91C_TSADC_OVRE7     ((unsigned int) 0x1 << 15) /* (TSADC) Channel 7 Overrun Error*/
#define AT91C_TSADC_DRDY      ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready*/
#define AT91C_TSADC_GOVRE     ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error*/
#define AT91C_TSADC_ENDRX     ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer*/
#define AT91C_TSADC_RXBUFF    ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full*/
#define AT91C_TSADC_PENCNT    ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact*/
#define AT91C_TSADC_NOCNT     ((unsigned int) 0x1 << 21) /* (TSADC) No Contact*/
/* -------- TSADC_LCDR : (TSADC Offset: 0x20) Last Converted Data Register -------- */
#define AT91C_TSADC_LDATA     ((unsigned int) 0x3FF <<  0) /* (TSADC) Last Converted Data*/
/* -------- TSADC_IER : (TSADC Offset: 0x24) Interrupt Enable Register -------- */
#define AT91C_TSADC_IENAEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC6  ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAEOC7  ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 End Of Conversion Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE6 ((unsigned int) 0x1 << 14) /* (TSADC) Channel 6 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAOVRE7 ((unsigned int) 0x1 << 15) /* (TSADC) Channel 7 Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENADRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Enable*/
#define AT91C_TSADC_IENAGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Enable*/
#define AT91C_TSADC_IENAENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Enable*/
#define AT91C_TSADC_IENARXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Enable*/
#define AT91C_TSADC_IENAPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Enable*/
#define AT91C_TSADC_IENANOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Enable*/
/* -------- TSADC_IDR : (TSADC Offset: 0x28) Interrupt Disable Register -------- */
#define AT91C_TSADC_IDISEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC6  ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISEOC7  ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 End Of Conversion Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE6 ((unsigned int) 0x1 << 14) /* (TSADC) Channel 6 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISOVRE7 ((unsigned int) 0x1 << 15) /* (TSADC) Channel 7 Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISDRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Disable*/
#define AT91C_TSADC_IDISGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Disable*/
#define AT91C_TSADC_IDISENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Disable*/
#define AT91C_TSADC_IDISRXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Disable*/
#define AT91C_TSADC_IDISPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Disable*/
#define AT91C_TSADC_IDISNOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Disable*/
/* -------- TSADC_IMR : (TSADC Offset: 0x2c) Interrupt Mask Register -------- */
#define AT91C_TSADC_IMSKEOC0  ((unsigned int) 0x1 <<  0) /* (TSADC) Channel 0 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC1  ((unsigned int) 0x1 <<  1) /* (TSADC) Channel 1 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC2  ((unsigned int) 0x1 <<  2) /* (TSADC) Channel 2 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC3  ((unsigned int) 0x1 <<  3) /* (TSADC) Channel 3 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC4  ((unsigned int) 0x1 <<  4) /* (TSADC) Channel 4 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC5  ((unsigned int) 0x1 <<  5) /* (TSADC) Channel 5 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC6  ((unsigned int) 0x1 <<  6) /* (TSADC) Channel 6 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKEOC7  ((unsigned int) 0x1 <<  7) /* (TSADC) Channel 7 End Of Conversion Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE0 ((unsigned int) 0x1 <<  8) /* (TSADC) Channel 0 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE1 ((unsigned int) 0x1 <<  9) /* (TSADC) Channel 1 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE2 ((unsigned int) 0x1 << 10) /* (TSADC) Channel 2 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE3 ((unsigned int) 0x1 << 11) /* (TSADC) Channel 3 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE4 ((unsigned int) 0x1 << 12) /* (TSADC) Channel 4 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE5 ((unsigned int) 0x1 << 13) /* (TSADC) Channel 5 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE6 ((unsigned int) 0x1 << 14) /* (TSADC) Channel 6 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKOVRE7 ((unsigned int) 0x1 << 15) /* (TSADC) Channel 7 Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKDRDY  ((unsigned int) 0x1 << 16) /* (TSADC) Data Ready Interrupt Mask*/
#define AT91C_TSADC_IMSKGOVRE ((unsigned int) 0x1 << 17) /* (TSADC) General Overrun Error Interrupt Mask*/
#define AT91C_TSADC_IMSKENDRX ((unsigned int) 0x1 << 18) /* (TSADC) End of RX Buffer Interrupt Mask*/
#define AT91C_TSADC_IMSKRXBUFF ((unsigned int) 0x1 << 19) /* (TSADC) RX Buffer Full Interrupt Mask*/
#define AT91C_TSADC_IMSKPENCNT ((unsigned int) 0x1 << 20) /* (TSADC) Pen Contact Interrupt Mask*/
#define AT91C_TSADC_IMSKNOCNT ((unsigned int) 0x1 << 21) /* (TSADC) No Contact Interrupt Mask*/
/* -------- TSADC_CDR0 : (TSADC Offset: 0x30) Channel 0 Data Register -------- */
#define AT91C_TSADC_DATA0     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 0 Data*/
/* -------- TSADC_CDR1 : (TSADC Offset: 0x34) Channel 1 Data Register -------- */
#define AT91C_TSADC_DATA1     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 1 Data*/
/* -------- TSADC_CDR2 : (TSADC Offset: 0x38) Channel 2 Data Register -------- */
#define AT91C_TSADC_DATA2     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 2 Data*/
/* -------- TSADC_CDR3 : (TSADC Offset: 0x3c) Channel 3 Data Register -------- */
#define AT91C_TSADC_DATA3     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 3 Data*/
/* -------- TSADC_CDR4 : (TSADC Offset: 0x40) Channel 4 Data Register -------- */
#define AT91C_TSADC_DATA4     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 4 Data*/
/* -------- TSADC_CDR5 : (TSADC Offset: 0x44) Channel 5 Data Register -------- */
#define AT91C_TSADC_DATA5     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 5 Data*/
/* -------- TSADC_CDR6 : (TSADC Offset: 0x48) Channel 6 Data Register -------- */
#define AT91C_TSADC_DATA6     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 6 Data*/
/* -------- TSADC_CDR7 : (TSADC Offset: 0x4c) Channel 7 Data Register -------- */
#define AT91C_TSADC_DATA7     ((unsigned int) 0x3FF <<  0) /* (TSADC) Channel 7 Data*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS Enpoint FIFO data register*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_EPTFIFO {
	AT91_REG	 UDPHS_READEPT0[16384]; 	/* FIFO Endpoint Data Register 0*/
	AT91_REG	 UDPHS_READEPT1[16384]; 	/* FIFO Endpoint Data Register 1*/
	AT91_REG	 UDPHS_READEPT2[16384]; 	/* FIFO Endpoint Data Register 2*/
	AT91_REG	 UDPHS_READEPT3[16384]; 	/* FIFO Endpoint Data Register 3*/
	AT91_REG	 UDPHS_READEPT4[16384]; 	/* FIFO Endpoint Data Register 4*/
	AT91_REG	 UDPHS_READEPT5[16384]; 	/* FIFO Endpoint Data Register 5*/
	AT91_REG	 UDPHS_READEPT6[16384]; 	/* FIFO Endpoint Data Register 6*/
} AT91S_UDPHS_EPTFIFO, *AT91PS_UDPHS_EPTFIFO;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS Endpoint struct*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_EPT {
	AT91_REG	 UDPHS_EPTCFG; 	/* UDPHS Endpoint Config Register*/
	AT91_REG	 UDPHS_EPTCTLENB; 	/* UDPHS Endpoint Control Enable Register*/
	AT91_REG	 UDPHS_EPTCTLDIS; 	/* UDPHS Endpoint Control Disable Register*/
	AT91_REG	 UDPHS_EPTCTL; 	/* UDPHS Endpoint Control Register*/
	AT91_REG	 Reserved0[1]; 	/* */
	AT91_REG	 UDPHS_EPTSETSTA; 	/* UDPHS Endpoint Set Status Register*/
	AT91_REG	 UDPHS_EPTCLRSTA; 	/* UDPHS Endpoint Clear Status Register*/
	AT91_REG	 UDPHS_EPTSTA; 	/* UDPHS Endpoint Status Register*/
} AT91S_UDPHS_EPT, *AT91PS_UDPHS_EPT;

