una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- */
#define AT91C_SADDR           ((unsigned int) 0x0 <<  0) /* (HDMA_CH) */
/* -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- */
#define AT91C_DADDR           ((unsigned int) 0x0 <<  0) /* (HDMA_CH) */
/* -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- */
#define AT91C_HDMA_DSCR_IF    ((unsigned int) 0x3 <<  0) /* (HDMA_CH) Select AHB-Lite Interface for current channel*/
#define 	AT91C_HDMA_DSCR_IF_0                    ((unsigned int) 0x0) /* (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 0.*/
#define 	AT91C_HDMA_DSCR_IF_1                    ((unsigned int) 0x1) /* (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 1.*/
#define 	AT91C_HDMA_DSCR_IF_2                    ((unsigned int) 0x2) /* (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 2.*/
#define 	AT91C_HDMA_DSCR_IF_3                    ((unsigned int) 0x3) /* (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 3.*/
#define AT91C_HDMA_DSCR       ((unsigned int) 0x3FFFFFFF <<  2) /* (HDMA_CH) Buffer Transfer descriptor address. This address is word aligned.*/
/* -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- */
#define AT91C_HDMA_BTSIZE     ((unsigned int) 0xFFFF <<  0) /* (HDMA_CH) Buffer Transfer Size.*/
#define AT91C_HDMA_SCSIZE     ((unsigned int) 0x7 << 16) /* (HDMA_CH) Source Chunk Transfer Size.*/
#define 	AT91C_HDMA_SCSIZE_1                    ((unsigned int) 0x0 << 16) /* (HDMA_CH) 1.*/
#define 	AT91C_HDMA_SCSIZE_4                    ((unsigned int) 0x1 << 16) /* (HDMA_CH) 4.*/
#define 	AT91C_HDMA_SCSIZE_8                    ((unsigned int) 0x2 << 16) /* (HDMA_CH) 8.*/
#define 	AT91C_HDMA_SCSIZE_16                   ((unsigned int) 0x3 << 16) /* (HDMA_CH) 16.*/
#define 	AT91C_HDMA_SCSIZE_32                   ((unsigned int) 0x4 << 16) /* (HDMA_CH) 32.*/
#define 	AT91C_HDMA_SCSIZE_64                   ((unsigned int) 0x5 << 16) /* (HDMA_CH) 64.*/
#define 	AT91C_HDMA_SCSIZE_128                  ((unsigned int) 0x6 << 16) /* (HDMA_CH) 128.*/
#define 	AT91C_HDMA_SCSIZE_256                  ((unsigned int) 0x7 << 16) /* (HDMA_CH) 256.*/
#define AT91C_HDMA_DCSIZE     ((unsigned int) 0x7 << 20) /* (HDMA_CH) Destination Chunk Transfer Size*/
#define 	AT91C_HDMA_DCSIZE_1                    ((unsigned int) 0x0 << 20) /* (HDMA_CH) 1.*/
#define 	AT91C_HDMA_DCSIZE_4                    ((unsigned int) 0x1 << 20) /* (HDMA_CH) 4.*/
#define 	AT91C_HDMA_DCSIZE_8                    ((unsigned int) 0x2 << 20) /* (HDMA_CH) 8.*/
#define 	AT91C_HDMA_DCSIZE_16                   ((unsigned int) 0x3 << 20) /* (HDMA_CH) 16.*/
#define 	AT91C_HDMA_DCSIZE_32                   ((unsigned int) 0x4 << 20) /* (HDMA_CH) 32.*/
#define 	AT91C_HDMA_DCSIZE_64                   ((unsigned int) 0x5 << 20) /* (HDMA_CH) 64.*/
#define 	AT91C_HDMA_DCSIZE_128                  ((unsigned int) 0x6 << 20) /* (HDMA_CH) 128.*/
#define 	AT91C_HDMA_DCSIZE_256                  ((unsigned int) 0x7 << 20) /* (HDMA_CH) 256.*/
#define AT91C_HDMA_SRC_WIDTH  ((unsigned int) 0x3 << 24) /* (HDMA_CH) Source Single Transfer Size*/
#define 	AT91C_HDMA_SRC_WIDTH_BYTE                 ((unsigned int) 0x0 << 24) /* (HDMA_CH) BYTE.*/
#define 	AT91C_HDMA_SRC_WIDTH_HALFWORD             ((unsigned int) 0x1 << 24) /* (HDMA_CH) HALF-WORD.*/
#define 	AT91C_HDMA_SRC_WIDTH_WORD                 ((unsigned int) 0x2 << 24) /* (HDMA_CH) WORD.*/
#define AT91C_HDMA_DST_WIDTH  ((unsigned int) 0x3 << 28) /* (HDMA_CH) Destination Single Transfer Size*/
#define 	AT91C_HDMA_DST_WIDTH_BYTE                 ((unsigned int) 0x0 << 28) /* (HDMA_CH) BYTE.*/
#define 	AT91C_HDMA_DST_WIDTH_HALFWORD             ((unsigned int) 0x1 << 28) /* (HDMA_CH) HALF-WORD.*/
#define 	AT91C_HDMA_DST_WIDTH_WORD                 ((unsigned int) 0x2 << 28) /* (HDMA_CH) WORD.*/
#define AT91C_HDMA_DONE       ((unsigned int) 0x1 << 31) /* (HDMA_CH) */
/* -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- */
#define AT91C_HDMA_SIF        ((unsigned int) 0x3 <<  0) /* (HDMA_CH) Source Interface Selection Field.*/
#define 	AT91C_HDMA_SIF_0                    ((unsigned int) 0x0) /* (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 0.*/
#define 	AT91C_HDMA_SIF_1                    ((unsigned int) 0x1) /* (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 1.*/
#define 	AT91C_HDMA_SIF_2                    ((unsigned int) 0x2) /* (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 2.*/
#define 	AT91C_HDMA_SIF_3                    ((unsigned int) 0x3) /* (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 3.*/
#define AT91C_HDMA_DIF        ((unsigned int) 0x3 <<  4) /* (HDMA_CH) Destination Interface Selection Field.*/
#define 	AT91C_HDMA_DIF_0                    ((unsigned int) 0x0 <<  4) /* (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 0.*/
#define 	AT91C_HDMA_DIF_1                    ((unsigned int) 0x1 <<  4) /* (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 1.*/
#define 	AT91C_HDMA_DIF_2                    ((unsigned int) 0x2 <<  4) /* (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 2.*/
#define 	AT91C_HDMA_DIF_3                    ((unsigned int) 0x3 <<  4) /* (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 3.*/
#define AT91C_HDMA_SRC_PIP    ((unsigned int) 0x1 <<  8) /* (HDMA_CH) Source Picture-in-Picture Mode*/
#define 	AT91C_HDMA_SRC_PIP_DISABLE              ((unsigned int) 0x0 <<  8) /* (HDMA_CH) Source Picture-in-Picture mode is disabled.*/
#define 	AT91C_HDMA_SRC_PIP_ENABLE               ((unsigned int) 0x1 <<  8) /* (HDMA_CH) Source Picture-in-Picture mode is enabled.*/
#define AT91C_HDMA_DST_PIP    ((unsigned int) 0x1 << 12) /* (HDMA_CH) Destination Picture-in-Picture Mode*/
#define 	AT91C_HDMA_DST_PIP_DISABLE              ((unsigned int) 0x0 << 12) /* (HDMA_CH) Destination Picture-in-Picture mode is disabled.*/
#define 	AT91C_HDMA_DST_PIP_ENABLE               ((unsigned int) 0x1 << 12) /* (HDMA_CH) Destination Picture-in-Picture mode is enabled.*/
#define AT91C_HDMA_SRC_DSCR   ((unsigned int) 0x1 << 16) /* (HDMA_CH) Source Buffer Descriptor Fetch operation*/
#define 	AT91C_HDMA_SRC_DSCR_FETCH_FROM_MEM       ((unsigned int) 0x0 << 16) /* (HDMA_CH) Source address is updated when the descriptor is fetched from the memory.*/
#define 	AT91C_HDMA_SRC_DSCR_FETCH_DISABLE        ((unsigned int) 0x1 << 16) /* (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the Source.*/
#define AT91C_HDMA_DST_DSCR   ((unsigned int) 0x1 << 20) /* (HDMA_CH) Destination Buffer Descriptor operation*/
#define 	AT91C_HDMA_DST_DSCR_FETCH_FROM_MEM       ((unsigned int) 0x0 << 20) /* (HDMA_CH) Destination address is updated when the descriptor is fetched from the memory.*/
#define 	AT91C_HDMA_DST_DSCR_FETCH_DISABLE        ((unsigned int) 0x1 << 20) /* (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the destination.*/
#define AT91C_HDMA_FC         ((unsigned int) 0x7 << 21) /* (HDMA_CH) This field defines which devices controls the size of the buffer transfer, also referred as to the Flow Controller.*/
#define 	AT91C_HDMA_FC_MEM2MEM              ((unsigned int) 0x0 << 21) /* (HDMA_CH) Memory-to-Memory (DMA Controller).*/
#define 	AT91C_HDMA_FC_MEM2PER              ((unsigned int) 0x1 << 21) /* (HDMA_CH) Memory-to-Peripheral (DMA Controller).*/
#define 	AT91C_HDMA_FC_PER2MEM              ((unsigned int) 0x2 << 21) /* (HDMA_CH) Peripheral-to-Memory (DMA Controller).*/
#define 	AT91C_HDMA_FC_PER2PER              ((unsigned int) 0x3 << 21) /* (HDMA_CH) Peripheral-to-Peripheral (DMA Controller).*/
#define 	AT91C_HDMA_FC_PER2MEM_PER          ((unsigned int) 0x4 << 21) /* (HDMA_CH) Peripheral-to-Memory (Peripheral).*/
#define 	AT91C_HDMA_FC_MEM2PER_PER          ((unsigned int) 0x5 << 21) /* (HDMA_CH) Memory-to-Peripheral (Peripheral).*/
#define 	AT91C_HDMA_FC_PER2PER_PER          ((unsigned int) 0x6 << 21) /* (HDMA_CH) Peripheral-to-Peripheral (Source Peripheral).*/
#define AT91C_HDMA_SRC_ADDRESS_MODE ((unsigned int) 0x3 << 24) /* (HDMA_CH) Type of addressing mode*/
#define 	AT91C_HDMA_SRC_ADDRESS_MODE_INCR                 ((unsigned int) 0x0 << 24) /* (HDMA_CH) Incrementing Mode.*/
#define 	AT91C_HDMA_SRC_ADDRESS_MODE_DECR                 ((unsigned int) 0x1 << 24) /* (HDMA_CH) Decrementing Mode.*/
#define 	AT91C_HDMA_SRC_ADDRESS_MODE_FIXED                ((unsigned int) 0x2 << 24) /* (HDMA_CH) Fixed Mode.*/
#define AT91C_HDMA_DST_ADDRESS_MODE ((unsigned int) 0x3 << 28) /* (HDMA_CH) Type of addressing mode*/
#define 	AT91C_HDMA_DST_ADDRESS_MODE_INCR                 ((unsigned int) 0x0 << 28) /* (HDMA_CH) Incrementing Mode.*/
#define 	AT91C_HDMA_DST_ADDRESS_MODE_DECR                 ((unsigned int) 0x1 << 28) /* (HDMA_CH) Decrementing Mode.*/
#define 	AT91C_HDMA_DST_ADDRESS_MODE_FIXED                ((unsigned int) 0x2 << 28) /* (HDMA_CH) Fixed Mode.*/
#define AT91C_HDMA_AUTO       ((unsigned int) 0x1 << 31) /* (HDMA_CH) Automatic multiple buffer transfer enable*/
#define 	AT91C_HDMA_AUTO_DISABLE              ((unsigned int) 0x0 << 31) /* (HDMA_CH) Automatic multiple buffer transfer is disabled.*/
#define 	AT91C_HDMA_AUTO_ENABLE               ((unsigned int) 0x1 << 31) /* (HDMA_CH) Automatic multiple buffer transfer is enabled. This enables replay mode or contiguous mode when several buffers are transferred.*/
/* -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- */
#define AT91C_HDMA_SRC_PER    ((unsigned int) 0xF <<  0) /* (HDMA_CH) Channel Source Request is associated with peripheral identifier coded SRC_PER handshaking interface.*/
#define 	AT91C_HDMA_SRC_PER_0                    ((unsigned int) 0x0) /* (HDMA_CH) HW Handshaking Interface number 0.*/
#define 	AT91C_HDMA_SRC_PER_1                    ((unsigned int) 0x1) /* (HDMA_CH) HW Handshaking Interface number 1.*/
#define 	AT91C_HDMA_SRC_PER_2                    ((unsigned int) 0x2) /* (HDMA_CH) HW Handshaking Interface number 2.*/
#define 	AT91C_HDMA_SRC_PER_3                    ((unsigned int) 0x3) /* (HDMA_CH) HW Handshaking Interface number 3.*/
#define 	AT91C_HDMA_SRC_PER_4                    ((unsigned int) 0x4) /* (HDMA_CH) HW Handshaking Interface number 4.*/
#define 	AT91C_HDMA_SRC_PER_5                    ((unsigned int) 0x5) /* (HDMA_CH) HW Handshaking Interface number 5.*/
#define 	AT91C_HDMA_SRC_PER_6                    ((unsigned int) 0x6) /* (HDMA_CH) HW Handshaking Interface number 6.*/
#define 	AT91C_HDMA_SRC_PER_7                    ((unsigned int) 0x7) /* (HDMA_CH) HW Handshaking Interface number 7.*/
#define 	AT91C_HDMA_SRC_PER_8                    ((unsigned int) 0x8) /* (HDMA_CH) HW Handshaking Interface number 8.*/
#define 	AT91C_HDMA_SRC_PER_9                    ((unsigned int) 0x9) /* (HDMA_CH) HW Handshaking Interface number 9.*/
#define 	AT91C_HDMA_SRC_PER_10                   ((unsigned int) 0xA) /* (HDMA_CH) HW Handshaking Interface number 10.*/
#define 	AT91C_HDMA_SRC_PER_11                   ((unsigned int) 0xB) /* (HDMA_CH) HW Handshaking Interface number 11.*/
#define 	AT91C_HDMA_SRC_PER_12                   ((unsigned int) 0xC) /* (HDMA_CH) HW Handshaking Interface number 12.*/
#define 	AT91C_HDMA_SRC_PER_13                   ((unsigned int) 0xD) /* (HDMA_CH) HW Handshaking Interface number 13.*/
#define 	AT91C_HDMA_SRC_PER_14                   ((unsigned int) 0xE) /* (HDMA_CH) HW Handshaking Interface number 14.*/
#define 	AT91C_HDMA_SRC_PER_15                   ((unsigned int) 0xF) /* (HDMA_CH) HW Handshaking Interface number 15.*/
#define AT91C_HDMA_DST_PER    ((unsigned int) 0xF <<  4) /* (HDMA_CH) Channel Destination Request is associated with peripheral identifier coded DST_PER handshaking interface.*/
#define 	AT91C_HDMA_DST_PER_0                    ((unsigned int) 0x0 <<  4) /* (HDMA_CH) HW Handshaking Interface number 0.*/
#define 	AT91C_HDMA_DST_PER_1                    ((unsigned int) 0x1 <<  4) /* (HDMA_CH) HW Handshaking Interface number 1.*/
#define 	AT91C_HDMA_DST_PER_2                    ((unsigned int) 0x2 <<  4) /* (HDMA_CH) HW Handshaking Interface number 2.*/
#define 	AT91C_HDMA_DST_PER_3                    ((unsigned int) 0x3 <<  4) /* (HDMA_CH) HW Handshaking Interface number 3.*/
#define 	AT91C_HDMA_DST_PER_4                    ((unsigned int) 0x4 <<  4) /* (HDMA_CH) HW Handshaking Interface number 4.*/
#define 	AT91C_HDMA_DST_PER_5                    ((unsigned int) 0x5 <<  4) /* (HDMA_CH) HW Handshaking Interface number 5.*/
#define 	AT91C_HDMA_DST_PER_6                    ((unsigned int) 0x6 <<  4) /* (HDMA_CH) HW Handshaking Interface number 6.*/
#define 	AT91C_HDMA_DST_PER_7                    ((unsigned int) 0x7 <<  4) /* (HDMA_CH) HW Handshaking Interface number 7.*/
#define 	AT91C_HDMA_DST_PER_8                    ((unsigned int) 0x8 <<  4) /* (HDMA_CH) HW Handshaking Interface number 8.*/
#define 	AT91C_HDMA_DST_PER_9                    ((unsigned int) 0x9 <<  4) /* (HDMA_CH) HW Handshaking Interface number 9.*/
#define 	AT91C_HDMA_DST_PER_10                   ((unsigned int) 0xA <<  4) /* (HDMA_CH) HW Handshaking Interface number 10.*/
#define 	AT91C_HDMA_DST_PER_11                   ((unsigned int) 0xB <<  4) /* (HDMA_CH) HW Handshaking Interface number 11.*/
#define 	AT91C_HDMA_DST_PER_12                   ((unsigned int) 0xC <<  4) /* (HDMA_CH) HW Handshaking Interface number 12.*/
#define 	AT91C_HDMA_DST_PER_13                   ((unsigned int) 0xD <<  4) /* (HDMA_CH) HW Handshaking Interface number 13.*/
#define 	AT91C_HDMA_DST_PER_14                   ((unsigned int) 0xE <<  4) /* (HDMA_CH) HW Handshaking Interface number 14.*/
#define 	AT91C_HDMA_DST_PER_15                   ((unsigned int) 0xF <<  4) /* (HDMA_CH) HW Handshaking Interface number 15.*/
#define AT91C_HDMA_SRC_REP    ((unsigned int) 0x1 <<  8) /* (HDMA_CH) Source Replay Mode*/
#define 	AT91C_HDMA_SRC_REP_CONTIGUOUS_ADDR      ((unsigned int) 0x0 <<  8) /* (HDMA_CH) When automatic mode is activated, source address is contiguous between two buffers.*/
#define 	AT91C_HDMA_SRC_REP_RELOAD_ADDR          ((unsigned int) 0x1 <<  8) /* (HDMA_CH) When automatic mode is activated, the source address and the control register are reloaded from previous transfer..*/
#define AT91C_HDMA_SRC_H2SEL  ((unsigned int) 0x1 <<  9) /* (HDMA_CH) Source Handshaking Mode*/
#define 	AT91C_HDMA_SRC_H2SEL_SW                   ((unsigned int) 0x0 <<  9) /* (HDMA_CH) Software handshaking interface is used to trigger a transfer request.*/
#define 	AT91C_HDMA_SRC_H2SEL_HW                   ((unsigned int) 0x1 <<  9) /* (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.*/
#define AT91C_HDMA_DST_REP    ((unsigned int) 0x1 << 12) /* (HDMA_CH) Destination Replay Mode*/
#define 	AT91C_HDMA_DST_REP_CONTIGUOUS_ADDR      ((unsigned int) 0x0 << 12) /* (HDMA_CH) When automatic mode is activated, destination address is contiguous between two buffers.*/
#define 	AT91C_HDMA_DST_REP_RELOAD_ADDR          ((unsigned int) 0x1 << 12) /* (HDMA_CH) When automatic mode is activated, the destination address and the control register are reloaded from previous transfer..*/
#define AT91C_HDMA_DST_H2SEL  ((unsigned int) 0x1 << 13) /* (HDMA_CH) Destination Handshaking Mode*/
#define 	AT91C_HDMA_DST_H2SEL_SW                   ((unsigned int) 0x0 << 13) /* (HDMA_CH) Software handshaking interface is used to trigger a transfer request.*/
#define 	AT91C_HDMA_DST_H2SEL_HW                   ((unsigned int) 0x1 << 13) /* (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.*/
#define AT91C_HDMA_SOD        ((unsigned int) 0x1 << 16) /* (HDMA_CH) STOP ON DONE*/
#define 	AT91C_HDMA_SOD_DISABLE              ((unsigned int) 0x0 << 16) /* (HDMA_CH) STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register.*/
#define 	AT91C_HDMA_SOD_ENABLE               ((unsigned int) 0x1 << 16) /* (HDMA_CH) STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1.*/
#define AT91C_HDMA_LOCK_IF    ((unsigned int) 0x1 << 20) /* (HDMA_CH) Interface Lock*/
#define 	AT91C_HDMA_LOCK_IF_DISABLE              ((unsigned int) 0x0 << 20) /* (HDMA_CH) Interface Lock capability is disabled.*/
#define 	AT91C_HDMA_LOCK_IF_ENABLE               ((unsigned int) 0x1 << 20) /* (HDMA_CH) Interface Lock capability is enabled.*/
#define AT91C_HDMA_LOCK_B     ((unsigned int) 0x1 << 21) /* (HDMA_CH) AHB Bus Lock*/
#define 	AT91C_HDMA_LOCK_B_DISABLE              ((unsigned int) 0x0 << 21) /* (HDMA_CH) AHB Bus Locking capability is disabled.*/
#define 	AT91C_HDMA_LOCK_B_ENABLE               ((unsigned int) 0x1 << 21) /* (HDMA_CH) AHB Bus Locking capability is enabled.*/
#define AT91C_HDMA_LOCK_IF_L  ((unsigned int) 0x1 << 22) /* (HDMA_CH) Master Interface Arbiter Lock*/
#define 	AT91C_HDMA_LOCK_IF_L_CHUNK                ((unsigned int) 0x0 << 22) /* (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a chunk transfer.*/
#define 	AT91C_HDMA_LOCK_IF_L_BUFFER               ((unsigned int) 0x1 << 22) /* (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a buffer transfer.*/
#define AT91C_HDMA_AHB_PROT   ((unsigned int) 0x7 << 24) /* (HDMA_CH) AHB Prot*/
#define AT91C_HDMA_FIFOCFG    ((unsigned int) 0x3 << 28) /* (HDMA_CH) FIFO Request Configuration*/
#define 	AT91C_HDMA_FIFOCFG_LARGESTBURST         ((unsigned int) 0x0 << 28) /* (HDMA_CH) The largest defined length AHB burst is performed on the destination AHB interface.*/
#define 	AT91C_HDMA_FIFOCFG_HALFFIFO             ((unsigned int) 0x1 << 28) /* (HDMA_CH) When half fifo size is available/filled a source/destination request is serviced.*/
#define 	AT91C_HDMA_FIFOCFG_ENOUGHSPACE          ((unsigned int) 0x2 << 28) /* (HDMA_CH) When there is enough space/data available to perfom a single AHB access then the request is serviced.*/
/* -------- HDMA_SPIP : (HDMA_CH Offset: 0x18)  -------- */
#define AT91C_SPIP_HOLE       ((unsigned int) 0xFFFF <<  0) /* (HDMA_CH) This field indicates the value to add to the address when the programmable boundary has been reached.*/
#define AT91C_SPIP_BOUNDARY   ((unsigned int) 0x3FF << 16) /* (HDMA_CH) This field indicates the number of source transfers to perform before the automatic address increment operation.*/
/* -------- HDMA_DPIP : (HDMA_CH Offset: 0x1c)  -------- */
#define AT91C_DPIP_HOLE       ((unsigned int) 0xFFFF <<  0) /* (HDMA_CH) This field indicates the value to add to the address when the programmable boundary has been reached.*/
#define AT91C_DPIP_BOUNDARY   ((unsigned int) 0x3FF << 16) /* (HDMA_CH) This field indicates the number of source transfers to perform before the automatic address increment operation.*/
/* -------- HDMA_BDSCR : (HDMA_CH Offset: 0x20)  -------- */
/* -------- HDMA_CADDR : (HDMA_CH Offset: 0x24)  -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR HDMA controller*/
/* ******************************************************************************/
typedef struct _AT91S_HDMA {
	AT91_REG	 HDMA_GCFG; 	/* HDMA Global Configuration Register*/
	AT91_REG	 HDMA_EN; 	/* HDMA Controller Enable Register*/
	AT91_REG	 HDMA_SREQ; 	/* HDMA Software Single Request Register*/
	AT91_REG	 HDMA_CREQ; 	/* HDMA Software Chunk Transfer Request Register*/
	AT91_REG	 HDMA_LAST; 	/* HDMA Software Last Transfer Flag Register*/
	AT91_REG	 HDMA_SYNC; 	/* HDMA Request Synchronization Register*/
	AT91_REG	 HDMA_EBCIER; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
	AT91_REG	 HDMA_EBCIDR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
	AT91_REG	 HDMA_EBCIMR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
	AT91_REG	 HDMA_EBCISR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
	AT91_REG	 HDMA_CHER; 	/* HDMA Channel Handler Enable Register*/
	AT91_REG	 HDMA_CHDR; 	/* HDMA Channel Handler Disable Register*/
	AT91_REG	 HDMA_CHSR; 	/* HDMA Channel Handler Status Register*/
	AT91_REG	 HDMA_RSVD0; 	/* HDMA Reserved*/
	AT91_REG	 HDMA_RSVD1; 	/* HDMA Reserved*/
	AT91S_HDMA_CH	 HDMA_CH[8]; 	/* HDMA Channel structure*/
} AT91S_HDMA, *AT91PS_HDMA;

