una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- */
#define AT91C_HDMA_IF0_BIGEND ((unsigned int) 0x1 <<  0) /* (HDMA) AHB-Lite Interface 0 endian mode.*/
#define 	AT91C_HDMA_IF0_BIGEND_IS_LITTLE_ENDIAN     ((unsigned int) 0x0) /* (HDMA) AHB-Lite Interface 0 is little endian.*/
#define 	AT91C_HDMA_IF0_BIGEND_IS_BIG_ENDIAN        ((unsigned int) 0x1) /* (HDMA) AHB-Lite Interface 0 is big endian.*/
#define AT91C_HDMA_IF1_BIGEND ((unsigned int) 0x1 <<  1) /* (HDMA) AHB-Lite Interface 1 endian mode.*/
#define 	AT91C_HDMA_IF1_BIGEND_IS_LITTLE_ENDIAN     ((unsigned int) 0x0 <<  1) /* (HDMA) AHB-Lite Interface 1 is little endian.*/
#define 	AT91C_HDMA_IF1_BIGEND_IS_BIG_ENDIAN        ((unsigned int) 0x1 <<  1) /* (HDMA) AHB-Lite Interface 1 is big endian.*/
#define AT91C_HDMA_IF2_BIGEND ((unsigned int) 0x1 <<  2) /* (HDMA) AHB-Lite Interface 2 endian mode.*/
#define 	AT91C_HDMA_IF2_BIGEND_IS_LITTLE_ENDIAN     ((unsigned int) 0x0 <<  2) /* (HDMA) AHB-Lite Interface 2 is little endian.*/
#define 	AT91C_HDMA_IF2_BIGEND_IS_BIG_ENDIAN        ((unsigned int) 0x1 <<  2) /* (HDMA) AHB-Lite Interface 2 is big endian.*/
#define AT91C_HDMA_IF3_BIGEND ((unsigned int) 0x1 <<  3) /* (HDMA) AHB-Lite Interface 3 endian mode.*/
#define 	AT91C_HDMA_IF3_BIGEND_IS_LITTLE_ENDIAN     ((unsigned int) 0x0 <<  3) /* (HDMA) AHB-Lite Interface 3 is little endian.*/
#define 	AT91C_HDMA_IF3_BIGEND_IS_BIG_ENDIAN        ((unsigned int) 0x1 <<  3) /* (HDMA) AHB-Lite Interface 3 is big endian.*/
#define AT91C_HDMA_ARB_CFG    ((unsigned int) 0x1 <<  4) /* (HDMA) Arbiter mode.*/
#define 	AT91C_HDMA_ARB_CFG_FIXED                ((unsigned int) 0x0 <<  4) /* (HDMA) Fixed priority arbiter.*/
#define 	AT91C_HDMA_ARB_CFG_ROUND_ROBIN          ((unsigned int) 0x1 <<  4) /* (HDMA) Modified round robin arbiter.*/
/* -------- HDMA_EN : (HDMA Offset: 0x4)  -------- */
#define AT91C_HDMA_ENABLE     ((unsigned int) 0x1 <<  0) /* (HDMA) */
#define 	AT91C_HDMA_ENABLE_DISABLE              ((unsigned int) 0x0) /* (HDMA) Disables HDMA.*/
#define 	AT91C_HDMA_ENABLE_ENABLE               ((unsigned int) 0x1) /* (HDMA) Enables HDMA.*/
/* -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- */
#define AT91C_HDMA_SSREQ0     ((unsigned int) 0x1 <<  0) /* (HDMA) Request a source single transfer on channel 0*/
#define 	AT91C_HDMA_SSREQ0_0                    ((unsigned int) 0x0) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ0_1                    ((unsigned int) 0x1) /* (HDMA) Request a source single transfer on channel 0.*/
#define AT91C_HDMA_DSREQ0     ((unsigned int) 0x1 <<  1) /* (HDMA) Request a destination single transfer on channel 0*/
#define 	AT91C_HDMA_DSREQ0_0                    ((unsigned int) 0x0 <<  1) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ0_1                    ((unsigned int) 0x1 <<  1) /* (HDMA) Request a destination single transfer on channel 0.*/
#define AT91C_HDMA_SSREQ1     ((unsigned int) 0x1 <<  2) /* (HDMA) Request a source single transfer on channel 1*/
#define 	AT91C_HDMA_SSREQ1_0                    ((unsigned int) 0x0 <<  2) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ1_1                    ((unsigned int) 0x1 <<  2) /* (HDMA) Request a source single transfer on channel 1.*/
#define AT91C_HDMA_DSREQ1     ((unsigned int) 0x1 <<  3) /* (HDMA) Request a destination single transfer on channel 1*/
#define 	AT91C_HDMA_DSREQ1_0                    ((unsigned int) 0x0 <<  3) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ1_1                    ((unsigned int) 0x1 <<  3) /* (HDMA) Request a destination single transfer on channel 1.*/
#define AT91C_HDMA_SSREQ2     ((unsigned int) 0x1 <<  4) /* (HDMA) Request a source single transfer on channel 2*/
#define 	AT91C_HDMA_SSREQ2_0                    ((unsigned int) 0x0 <<  4) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ2_1                    ((unsigned int) 0x1 <<  4) /* (HDMA) Request a source single transfer on channel 2.*/
#define AT91C_HDMA_DSREQ2     ((unsigned int) 0x1 <<  5) /* (HDMA) Request a destination single transfer on channel 2*/
#define 	AT91C_HDMA_DSREQ2_0                    ((unsigned int) 0x0 <<  5) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ2_1                    ((unsigned int) 0x1 <<  5) /* (HDMA) Request a destination single transfer on channel 2.*/
#define AT91C_HDMA_SSREQ3     ((unsigned int) 0x1 <<  6) /* (HDMA) Request a source single transfer on channel 3*/
#define 	AT91C_HDMA_SSREQ3_0                    ((unsigned int) 0x0 <<  6) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ3_1                    ((unsigned int) 0x1 <<  6) /* (HDMA) Request a source single transfer on channel 3.*/
#define AT91C_HDMA_DSREQ3     ((unsigned int) 0x1 <<  7) /* (HDMA) Request a destination single transfer on channel 3*/
#define 	AT91C_HDMA_DSREQ3_0                    ((unsigned int) 0x0 <<  7) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ3_1                    ((unsigned int) 0x1 <<  7) /* (HDMA) Request a destination single transfer on channel 3.*/
#define AT91C_HDMA_SSREQ4     ((unsigned int) 0x1 <<  8) /* (HDMA) Request a source single transfer on channel 4*/
#define 	AT91C_HDMA_SSREQ4_0                    ((unsigned int) 0x0 <<  8) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ4_1                    ((unsigned int) 0x1 <<  8) /* (HDMA) Request a source single transfer on channel 4.*/
#define AT91C_HDMA_DSREQ4     ((unsigned int) 0x1 <<  9) /* (HDMA) Request a destination single transfer on channel 4*/
#define 	AT91C_HDMA_DSREQ4_0                    ((unsigned int) 0x0 <<  9) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ4_1                    ((unsigned int) 0x1 <<  9) /* (HDMA) Request a destination single transfer on channel 4.*/
#define AT91C_HDMA_SSREQ5     ((unsigned int) 0x1 << 10) /* (HDMA) Request a source single transfer on channel 5*/
#define 	AT91C_HDMA_SSREQ5_0                    ((unsigned int) 0x0 << 10) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ5_1                    ((unsigned int) 0x1 << 10) /* (HDMA) Request a source single transfer on channel 5.*/
#define AT91C_HDMA_DSREQ6     ((unsigned int) 0x1 << 11) /* (HDMA) Request a destination single transfer on channel 5*/
#define 	AT91C_HDMA_DSREQ6_0                    ((unsigned int) 0x0 << 11) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ6_1                    ((unsigned int) 0x1 << 11) /* (HDMA) Request a destination single transfer on channel 5.*/
#define AT91C_HDMA_SSREQ6     ((unsigned int) 0x1 << 12) /* (HDMA) Request a source single transfer on channel 6*/
#define 	AT91C_HDMA_SSREQ6_0                    ((unsigned int) 0x0 << 12) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ6_1                    ((unsigned int) 0x1 << 12) /* (HDMA) Request a source single transfer on channel 6.*/
#define AT91C_HDMA_SSREQ7     ((unsigned int) 0x1 << 14) /* (HDMA) Request a source single transfer on channel 7*/
#define 	AT91C_HDMA_SSREQ7_0                    ((unsigned int) 0x0 << 14) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SSREQ7_1                    ((unsigned int) 0x1 << 14) /* (HDMA) Request a source single transfer on channel 7.*/
#define AT91C_HDMA_DSREQ7     ((unsigned int) 0x1 << 15) /* (HDMA) Request a destination single transfer on channel 7*/
#define 	AT91C_HDMA_DSREQ7_0                    ((unsigned int) 0x0 << 15) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DSREQ7_1                    ((unsigned int) 0x1 << 15) /* (HDMA) Request a destination single transfer on channel 7.*/
/* -------- HDMA_CREQ : (HDMA Offset: 0xc)  -------- */
#define AT91C_HDMA_SCREQ0     ((unsigned int) 0x1 <<  0) /* (HDMA) Request a source chunk transfer on channel 0*/
#define 	AT91C_HDMA_SCREQ0_0                    ((unsigned int) 0x0) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ0_1                    ((unsigned int) 0x1) /* (HDMA) Request a source chunk transfer on channel 0.*/
#define AT91C_HDMA_DCREQ0     ((unsigned int) 0x1 <<  1) /* (HDMA) Request a destination chunk transfer on channel 0*/
#define 	AT91C_HDMA_DCREQ0_0                    ((unsigned int) 0x0 <<  1) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ0_1                    ((unsigned int) 0x1 <<  1) /* (HDMA) Request a destination chunk transfer on channel 0.*/
#define AT91C_HDMA_SCREQ1     ((unsigned int) 0x1 <<  2) /* (HDMA) Request a source chunk transfer on channel 1*/
#define 	AT91C_HDMA_SCREQ1_0                    ((unsigned int) 0x0 <<  2) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ1_1                    ((unsigned int) 0x1 <<  2) /* (HDMA) Request a source chunk transfer on channel 1.*/
#define AT91C_HDMA_DCREQ1     ((unsigned int) 0x1 <<  3) /* (HDMA) Request a destination chunk transfer on channel 1*/
#define 	AT91C_HDMA_DCREQ1_0                    ((unsigned int) 0x0 <<  3) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ1_1                    ((unsigned int) 0x1 <<  3) /* (HDMA) Request a destination chunk transfer on channel 1.*/
#define AT91C_HDMA_SCREQ2     ((unsigned int) 0x1 <<  4) /* (HDMA) Request a source chunk transfer on channel 2*/
#define 	AT91C_HDMA_SCREQ2_0                    ((unsigned int) 0x0 <<  4) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ2_1                    ((unsigned int) 0x1 <<  4) /* (HDMA) Request a source chunk transfer on channel 2.*/
#define AT91C_HDMA_DCREQ2     ((unsigned int) 0x1 <<  5) /* (HDMA) Request a destination chunk transfer on channel 2*/
#define 	AT91C_HDMA_DCREQ2_0                    ((unsigned int) 0x0 <<  5) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ2_1                    ((unsigned int) 0x1 <<  5) /* (HDMA) Request a destination chunk transfer on channel 2.*/
#define AT91C_HDMA_SCREQ3     ((unsigned int) 0x1 <<  6) /* (HDMA) Request a source chunk transfer on channel 3*/
#define 	AT91C_HDMA_SCREQ3_0                    ((unsigned int) 0x0 <<  6) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ3_1                    ((unsigned int) 0x1 <<  6) /* (HDMA) Request a source chunk transfer on channel 3.*/
#define AT91C_HDMA_DCREQ3     ((unsigned int) 0x1 <<  7) /* (HDMA) Request a destination chunk transfer on channel 3*/
#define 	AT91C_HDMA_DCREQ3_0                    ((unsigned int) 0x0 <<  7) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ3_1                    ((unsigned int) 0x1 <<  7) /* (HDMA) Request a destination chunk transfer on channel 3.*/
#define AT91C_HDMA_SCREQ4     ((unsigned int) 0x1 <<  8) /* (HDMA) Request a source chunk transfer on channel 4*/
#define 	AT91C_HDMA_SCREQ4_0                    ((unsigned int) 0x0 <<  8) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ4_1                    ((unsigned int) 0x1 <<  8) /* (HDMA) Request a source chunk transfer on channel 4.*/
#define AT91C_HDMA_DCREQ4     ((unsigned int) 0x1 <<  9) /* (HDMA) Request a destination chunk transfer on channel 4*/
#define 	AT91C_HDMA_DCREQ4_0                    ((unsigned int) 0x0 <<  9) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ4_1                    ((unsigned int) 0x1 <<  9) /* (HDMA) Request a destination chunk transfer on channel 4.*/
#define AT91C_HDMA_SCREQ5     ((unsigned int) 0x1 << 10) /* (HDMA) Request a source chunk transfer on channel 5*/
#define 	AT91C_HDMA_SCREQ5_0                    ((unsigned int) 0x0 << 10) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ5_1                    ((unsigned int) 0x1 << 10) /* (HDMA) Request a source chunk transfer on channel 5.*/
#define AT91C_HDMA_DCREQ6     ((unsigned int) 0x1 << 11) /* (HDMA) Request a destination chunk transfer on channel 5*/
#define 	AT91C_HDMA_DCREQ6_0                    ((unsigned int) 0x0 << 11) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ6_1                    ((unsigned int) 0x1 << 11) /* (HDMA) Request a destination chunk transfer on channel 5.*/
#define AT91C_HDMA_SCREQ6     ((unsigned int) 0x1 << 12) /* (HDMA) Request a source chunk transfer on channel 6*/
#define 	AT91C_HDMA_SCREQ6_0                    ((unsigned int) 0x0 << 12) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ6_1                    ((unsigned int) 0x1 << 12) /* (HDMA) Request a source chunk transfer on channel 6.*/
#define AT91C_HDMA_SCREQ7     ((unsigned int) 0x1 << 14) /* (HDMA) Request a source chunk transfer on channel 7*/
#define 	AT91C_HDMA_SCREQ7_0                    ((unsigned int) 0x0 << 14) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SCREQ7_1                    ((unsigned int) 0x1 << 14) /* (HDMA) Request a source chunk transfer on channel 7.*/
#define AT91C_HDMA_DCREQ7     ((unsigned int) 0x1 << 15) /* (HDMA) Request a destination chunk transfer on channel 7*/
#define 	AT91C_HDMA_DCREQ7_0                    ((unsigned int) 0x0 << 15) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DCREQ7_1                    ((unsigned int) 0x1 << 15) /* (HDMA) Request a destination chunk transfer on channel 7.*/
/* -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- */
#define AT91C_HDMA_SLAST0     ((unsigned int) 0x1 <<  0) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 0*/
#define 	AT91C_HDMA_SLAST0_0                    ((unsigned int) 0x0) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST0_1                    ((unsigned int) 0x1) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 0.*/
#define AT91C_HDMA_DLAST0     ((unsigned int) 0x1 <<  1) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 0*/
#define 	AT91C_HDMA_DLAST0_0                    ((unsigned int) 0x0 <<  1) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST0_1                    ((unsigned int) 0x1 <<  1) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 0.*/
#define AT91C_HDMA_SLAST1     ((unsigned int) 0x1 <<  2) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 1*/
#define 	AT91C_HDMA_SLAST1_0                    ((unsigned int) 0x0 <<  2) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST1_1                    ((unsigned int) 0x1 <<  2) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 1.*/
#define AT91C_HDMA_DLAST1     ((unsigned int) 0x1 <<  3) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 1*/
#define 	AT91C_HDMA_DLAST1_0                    ((unsigned int) 0x0 <<  3) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST1_1                    ((unsigned int) 0x1 <<  3) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 1.*/
#define AT91C_HDMA_SLAST2     ((unsigned int) 0x1 <<  4) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 2*/
#define 	AT91C_HDMA_SLAST2_0                    ((unsigned int) 0x0 <<  4) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST2_1                    ((unsigned int) 0x1 <<  4) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 2.*/
#define AT91C_HDMA_DLAST2     ((unsigned int) 0x1 <<  5) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 2*/
#define 	AT91C_HDMA_DLAST2_0                    ((unsigned int) 0x0 <<  5) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST2_1                    ((unsigned int) 0x1 <<  5) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 2.*/
#define AT91C_HDMA_SLAST3     ((unsigned int) 0x1 <<  6) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 3*/
#define 	AT91C_HDMA_SLAST3_0                    ((unsigned int) 0x0 <<  6) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST3_1                    ((unsigned int) 0x1 <<  6) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 3.*/
#define AT91C_HDMA_DLAST3     ((unsigned int) 0x1 <<  7) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 3*/
#define 	AT91C_HDMA_DLAST3_0                    ((unsigned int) 0x0 <<  7) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST3_1                    ((unsigned int) 0x1 <<  7) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 3.*/
#define AT91C_HDMA_SLAST4     ((unsigned int) 0x1 <<  8) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 4*/
#define 	AT91C_HDMA_SLAST4_0                    ((unsigned int) 0x0 <<  8) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST4_1                    ((unsigned int) 0x1 <<  8) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 4.*/
#define AT91C_HDMA_DLAST4     ((unsigned int) 0x1 <<  9) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 4*/
#define 	AT91C_HDMA_DLAST4_0                    ((unsigned int) 0x0 <<  9) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST4_1                    ((unsigned int) 0x1 <<  9) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 4.*/
#define AT91C_HDMA_SLAST5     ((unsigned int) 0x1 << 10) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 5*/
#define 	AT91C_HDMA_SLAST5_0                    ((unsigned int) 0x0 << 10) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST5_1                    ((unsigned int) 0x1 << 10) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 5.*/
#define AT91C_HDMA_DLAST6     ((unsigned int) 0x1 << 11) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 5*/
#define 	AT91C_HDMA_DLAST6_0                    ((unsigned int) 0x0 << 11) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST6_1                    ((unsigned int) 0x1 << 11) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 5.*/
#define AT91C_HDMA_SLAST6     ((unsigned int) 0x1 << 12) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 6*/
#define 	AT91C_HDMA_SLAST6_0                    ((unsigned int) 0x0 << 12) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST6_1                    ((unsigned int) 0x1 << 12) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 6.*/
#define AT91C_HDMA_SLAST7     ((unsigned int) 0x1 << 14) /* (HDMA) Indicates that this source request is the last transfer of the buffer on channel 7*/
#define 	AT91C_HDMA_SLAST7_0                    ((unsigned int) 0x0 << 14) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SLAST7_1                    ((unsigned int) 0x1 << 14) /* (HDMA) Writing one to SLASTx prior to writing one to SSREQx or SCREQx indicates that this source request is the last transfer of the buffer on channel 7.*/
#define AT91C_HDMA_DLAST7     ((unsigned int) 0x1 << 15) /* (HDMA) Indicates that this destination request is the last transfer of the buffer on channel 7*/
#define 	AT91C_HDMA_DLAST7_0                    ((unsigned int) 0x0 << 15) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DLAST7_1                    ((unsigned int) 0x1 << 15) /* (HDMA) Writing one to DLASTx prior to writing one to DSREQx or DCREQx indicates that this destination request is the last transfer of the buffer on channel 7.*/
/* -------- HDMA_SYNC : (HDMA Offset: 0x14)  -------- */
#define AT91C_SYNC_REQ        ((unsigned int) 0xFFFF <<  0) /* (HDMA) */
/* -------- HDMA_EBCIER : (HDMA Offset: 0x18) Buffer Transfer Completed/Chained Buffer Transfer Completed/Access Error Interrupt Enable Register -------- */
#define AT91C_HDMA_BTC0       ((unsigned int) 0x1 <<  0) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC1       ((unsigned int) 0x1 <<  1) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC2       ((unsigned int) 0x1 <<  2) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC3       ((unsigned int) 0x1 <<  3) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC4       ((unsigned int) 0x1 <<  4) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC5       ((unsigned int) 0x1 <<  5) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC6       ((unsigned int) 0x1 <<  6) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_BTC7       ((unsigned int) 0x1 <<  7) /* (HDMA) Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC0      ((unsigned int) 0x1 <<  8) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC1      ((unsigned int) 0x1 <<  9) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC2      ((unsigned int) 0x1 << 10) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC3      ((unsigned int) 0x1 << 11) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC4      ((unsigned int) 0x1 << 12) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC5      ((unsigned int) 0x1 << 13) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC6      ((unsigned int) 0x1 << 14) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_CBTC7      ((unsigned int) 0x1 << 15) /* (HDMA) Chained Buffer Transfer Completed Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR0       ((unsigned int) 0x1 << 16) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR1       ((unsigned int) 0x1 << 17) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR2       ((unsigned int) 0x1 << 18) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR3       ((unsigned int) 0x1 << 19) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR4       ((unsigned int) 0x1 << 20) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR5       ((unsigned int) 0x1 << 21) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR6       ((unsigned int) 0x1 << 22) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
#define AT91C_HDMA_ERR7       ((unsigned int) 0x1 << 23) /* (HDMA) Access HDMA_Error Interrupt Enable/Disable/Status Register*/
/* -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- */
/* -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- */
