una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- */
/* -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- */
#define AT91C_HDMA_ENA0       ((unsigned int) 0x1 <<  0) /* (HDMA) When set, channel 0 enabled.*/
#define 	AT91C_HDMA_ENA0_0                    ((unsigned int) 0x0) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA0_1                    ((unsigned int) 0x1) /* (HDMA) Channel 0 enabled.*/
#define AT91C_HDMA_ENA1       ((unsigned int) 0x1 <<  1) /* (HDMA) When set, channel 1 enabled.*/
#define 	AT91C_HDMA_ENA1_0                    ((unsigned int) 0x0 <<  1) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA1_1                    ((unsigned int) 0x1 <<  1) /* (HDMA) Channel 1 enabled.*/
#define AT91C_HDMA_ENA2       ((unsigned int) 0x1 <<  2) /* (HDMA) When set, channel 2 enabled.*/
#define 	AT91C_HDMA_ENA2_0                    ((unsigned int) 0x0 <<  2) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA2_1                    ((unsigned int) 0x1 <<  2) /* (HDMA) Channel 2 enabled.*/
#define AT91C_HDMA_ENA3       ((unsigned int) 0x1 <<  3) /* (HDMA) When set, channel 3 enabled.*/
#define 	AT91C_HDMA_ENA3_0                    ((unsigned int) 0x0 <<  3) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA3_1                    ((unsigned int) 0x1 <<  3) /* (HDMA) Channel 3 enabled.*/
#define AT91C_HDMA_ENA4       ((unsigned int) 0x1 <<  4) /* (HDMA) When set, channel 4 enabled.*/
#define 	AT91C_HDMA_ENA4_0                    ((unsigned int) 0x0 <<  4) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA4_1                    ((unsigned int) 0x1 <<  4) /* (HDMA) Channel 4 enabled.*/
#define AT91C_HDMA_ENA5       ((unsigned int) 0x1 <<  5) /* (HDMA) When set, channel 5 enabled.*/
#define 	AT91C_HDMA_ENA5_0                    ((unsigned int) 0x0 <<  5) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA5_1                    ((unsigned int) 0x1 <<  5) /* (HDMA) Channel 5 enabled.*/
#define AT91C_HDMA_ENA6       ((unsigned int) 0x1 <<  6) /* (HDMA) When set, channel 6 enabled.*/
#define 	AT91C_HDMA_ENA6_0                    ((unsigned int) 0x0 <<  6) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA6_1                    ((unsigned int) 0x1 <<  6) /* (HDMA) Channel 6 enabled.*/
#define AT91C_HDMA_ENA7       ((unsigned int) 0x1 <<  7) /* (HDMA) When set, channel 7 enabled.*/
#define 	AT91C_HDMA_ENA7_0                    ((unsigned int) 0x0 <<  7) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_ENA7_1                    ((unsigned int) 0x1 <<  7) /* (HDMA) Channel 7 enabled.*/
#define AT91C_HDMA_SUSP0      ((unsigned int) 0x1 <<  8) /* (HDMA) When set, channel 0 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP0_0                    ((unsigned int) 0x0 <<  8) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP0_1                    ((unsigned int) 0x1 <<  8) /* (HDMA) Channel 0 freezed.*/
#define AT91C_HDMA_SUSP1      ((unsigned int) 0x1 <<  9) /* (HDMA) When set, channel 1 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP1_0                    ((unsigned int) 0x0 <<  9) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP1_1                    ((unsigned int) 0x1 <<  9) /* (HDMA) Channel 1 freezed.*/
#define AT91C_HDMA_SUSP2      ((unsigned int) 0x1 << 10) /* (HDMA) When set, channel 2 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP2_0                    ((unsigned int) 0x0 << 10) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP2_1                    ((unsigned int) 0x1 << 10) /* (HDMA) Channel 2 freezed.*/
#define AT91C_HDMA_SUSP3      ((unsigned int) 0x1 << 11) /* (HDMA) When set, channel 3 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP3_0                    ((unsigned int) 0x0 << 11) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP3_1                    ((unsigned int) 0x1 << 11) /* (HDMA) Channel 3 freezed.*/
#define AT91C_HDMA_SUSP4      ((unsigned int) 0x1 << 12) /* (HDMA) When set, channel 4 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP4_0                    ((unsigned int) 0x0 << 12) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP4_1                    ((unsigned int) 0x1 << 12) /* (HDMA) Channel 4 freezed.*/
#define AT91C_HDMA_SUSP5      ((unsigned int) 0x1 << 13) /* (HDMA) When set, channel 5 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP5_0                    ((unsigned int) 0x0 << 13) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP5_1                    ((unsigned int) 0x1 << 13) /* (HDMA) Channel 5 freezed.*/
#define AT91C_HDMA_SUSP6      ((unsigned int) 0x1 << 14) /* (HDMA) When set, channel 6 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP6_0                    ((unsigned int) 0x0 << 14) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP6_1                    ((unsigned int) 0x1 << 14) /* (HDMA) Channel 6 freezed.*/
#define AT91C_HDMA_SUSP7      ((unsigned int) 0x1 << 15) /* (HDMA) When set, channel 7 freezed and its current context.*/
#define 	AT91C_HDMA_SUSP7_0                    ((unsigned int) 0x0 << 15) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_SUSP7_1                    ((unsigned int) 0x1 << 15) /* (HDMA) Channel 7 freezed.*/
#define AT91C_HDMA_KEEP0      ((unsigned int) 0x1 << 24) /* (HDMA) When set, it resumes the channel 0 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP0_0                    ((unsigned int) 0x0 << 24) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP0_1                    ((unsigned int) 0x1 << 24) /* (HDMA) Resumes the channel 0.*/
#define AT91C_HDMA_KEEP1      ((unsigned int) 0x1 << 25) /* (HDMA) When set, it resumes the channel 1 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP1_0                    ((unsigned int) 0x0 << 25) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP1_1                    ((unsigned int) 0x1 << 25) /* (HDMA) Resumes the channel 1.*/
#define AT91C_HDMA_KEEP2      ((unsigned int) 0x1 << 26) /* (HDMA) When set, it resumes the channel 2 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP2_0                    ((unsigned int) 0x0 << 26) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP2_1                    ((unsigned int) 0x1 << 26) /* (HDMA) Resumes the channel 2.*/
#define AT91C_HDMA_KEEP3      ((unsigned int) 0x1 << 27) /* (HDMA) When set, it resumes the channel 3 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP3_0                    ((unsigned int) 0x0 << 27) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP3_1                    ((unsigned int) 0x1 << 27) /* (HDMA) Resumes the channel 3.*/
#define AT91C_HDMA_KEEP4      ((unsigned int) 0x1 << 28) /* (HDMA) When set, it resumes the channel 4 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP4_0                    ((unsigned int) 0x0 << 28) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP4_1                    ((unsigned int) 0x1 << 28) /* (HDMA) Resumes the channel 4.*/
#define AT91C_HDMA_KEEP5      ((unsigned int) 0x1 << 29) /* (HDMA) When set, it resumes the channel 5 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP5_0                    ((unsigned int) 0x0 << 29) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP5_1                    ((unsigned int) 0x1 << 29) /* (HDMA) Resumes the channel 5.*/
#define AT91C_HDMA_KEEP6      ((unsigned int) 0x1 << 30) /* (HDMA) When set, it resumes the channel 6 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP6_0                    ((unsigned int) 0x0 << 30) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP6_1                    ((unsigned int) 0x1 << 30) /* (HDMA) Resumes the channel 6.*/
#define AT91C_HDMA_KEEP7      ((unsigned int) 0x1 << 31) /* (HDMA) When set, it resumes the channel 7 from an automatic stall state.*/
#define 	AT91C_HDMA_KEEP7_0                    ((unsigned int) 0x0 << 31) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_KEEP7_1                    ((unsigned int) 0x1 << 31) /* (HDMA) Resumes the channel 7.*/
/* -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- */
#define AT91C_HDMA_DIS0       ((unsigned int) 0x1 <<  0) /* (HDMA) Write one to this field to disable the channel 0.*/
#define 	AT91C_HDMA_DIS0_0                    ((unsigned int) 0x0) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS0_1                    ((unsigned int) 0x1) /* (HDMA) Disables the channel 0.*/
#define AT91C_HDMA_DIS1       ((unsigned int) 0x1 <<  1) /* (HDMA) Write one to this field to disable the channel 1.*/
#define 	AT91C_HDMA_DIS1_0                    ((unsigned int) 0x0 <<  1) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS1_1                    ((unsigned int) 0x1 <<  1) /* (HDMA) Disables the channel 1.*/
#define AT91C_HDMA_DIS2       ((unsigned int) 0x1 <<  2) /* (HDMA) Write one to this field to disable the channel 2.*/
#define 	AT91C_HDMA_DIS2_0                    ((unsigned int) 0x0 <<  2) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS2_1                    ((unsigned int) 0x1 <<  2) /* (HDMA) Disables the channel 2.*/
#define AT91C_HDMA_DIS3       ((unsigned int) 0x1 <<  3) /* (HDMA) Write one to this field to disable the channel 3.*/
#define 	AT91C_HDMA_DIS3_0                    ((unsigned int) 0x0 <<  3) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS3_1                    ((unsigned int) 0x1 <<  3) /* (HDMA) Disables the channel 3.*/
#define AT91C_HDMA_DIS4       ((unsigned int) 0x1 <<  4) /* (HDMA) Write one to this field to disable the channel 4.*/
#define 	AT91C_HDMA_DIS4_0                    ((unsigned int) 0x0 <<  4) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS4_1                    ((unsigned int) 0x1 <<  4) /* (HDMA) Disables the channel 4.*/
#define AT91C_HDMA_DIS5       ((unsigned int) 0x1 <<  5) /* (HDMA) Write one to this field to disable the channel 5.*/
#define 	AT91C_HDMA_DIS5_0                    ((unsigned int) 0x0 <<  5) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS5_1                    ((unsigned int) 0x1 <<  5) /* (HDMA) Disables the channel 5.*/
#define AT91C_HDMA_DIS6       ((unsigned int) 0x1 <<  6) /* (HDMA) Write one to this field to disable the channel 6.*/
#define 	AT91C_HDMA_DIS6_0                    ((unsigned int) 0x0 <<  6) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS6_1                    ((unsigned int) 0x1 <<  6) /* (HDMA) Disables the channel 6.*/
#define AT91C_HDMA_DIS7       ((unsigned int) 0x1 <<  7) /* (HDMA) Write one to this field to disable the channel 7.*/
#define 	AT91C_HDMA_DIS7_0                    ((unsigned int) 0x0 <<  7) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_DIS7_1                    ((unsigned int) 0x1 <<  7) /* (HDMA) Disables the channel 7.*/
#define AT91C_HDMA_RES0       ((unsigned int) 0x1 <<  8) /* (HDMA) Write one to this field to resume the channel 0 transfer restoring its context.*/
#define 	AT91C_HDMA_RES0_0                    ((unsigned int) 0x0 <<  8) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES0_1                    ((unsigned int) 0x1 <<  8) /* (HDMA) Resumes the channel 0.*/
#define AT91C_HDMA_RES1       ((unsigned int) 0x1 <<  9) /* (HDMA) Write one to this field to resume the channel 1 transfer restoring its context.*/
#define 	AT91C_HDMA_RES1_0                    ((unsigned int) 0x0 <<  9) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES1_1                    ((unsigned int) 0x1 <<  9) /* (HDMA) Resumes the channel 1.*/
#define AT91C_HDMA_RES2       ((unsigned int) 0x1 << 10) /* (HDMA) Write one to this field to resume the channel 2 transfer restoring its context.*/
#define 	AT91C_HDMA_RES2_0                    ((unsigned int) 0x0 << 10) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES2_1                    ((unsigned int) 0x1 << 10) /* (HDMA) Resumes the channel 2.*/
#define AT91C_HDMA_RES3       ((unsigned int) 0x1 << 11) /* (HDMA) Write one to this field to resume the channel 3 transfer restoring its context.*/
#define 	AT91C_HDMA_RES3_0                    ((unsigned int) 0x0 << 11) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES3_1                    ((unsigned int) 0x1 << 11) /* (HDMA) Resumes the channel 3.*/
#define AT91C_HDMA_RES4       ((unsigned int) 0x1 << 12) /* (HDMA) Write one to this field to resume the channel 4 transfer restoring its context.*/
#define 	AT91C_HDMA_RES4_0                    ((unsigned int) 0x0 << 12) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES4_1                    ((unsigned int) 0x1 << 12) /* (HDMA) Resumes the channel 4.*/
#define AT91C_HDMA_RES5       ((unsigned int) 0x1 << 13) /* (HDMA) Write one to this field to resume the channel 5 transfer restoring its context.*/
#define 	AT91C_HDMA_RES5_0                    ((unsigned int) 0x0 << 13) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES5_1                    ((unsigned int) 0x1 << 13) /* (HDMA) Resumes the channel 5.*/
#define AT91C_HDMA_RES6       ((unsigned int) 0x1 << 14) /* (HDMA) Write one to this field to resume the channel 6 transfer restoring its context.*/
#define 	AT91C_HDMA_RES6_0                    ((unsigned int) 0x0 << 14) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES6_1                    ((unsigned int) 0x1 << 14) /* (HDMA) Resumes the channel 6.*/
#define AT91C_HDMA_RES7       ((unsigned int) 0x1 << 15) /* (HDMA) Write one to this field to resume the channel 7 transfer restoring its context.*/
#define 	AT91C_HDMA_RES7_0                    ((unsigned int) 0x0 << 15) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_RES7_1                    ((unsigned int) 0x1 << 15) /* (HDMA) Resumes the channel 7.*/
/* -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- */
#define AT91C_HDMA_EMPT0      ((unsigned int) 0x1 << 16) /* (HDMA) When set, channel 0 is empty.*/
#define 	AT91C_HDMA_EMPT0_0                    ((unsigned int) 0x0 << 16) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT0_1                    ((unsigned int) 0x1 << 16) /* (HDMA) Channel 0 empty.*/
#define AT91C_HDMA_EMPT1      ((unsigned int) 0x1 << 17) /* (HDMA) When set, channel 1 is empty.*/
#define 	AT91C_HDMA_EMPT1_0                    ((unsigned int) 0x0 << 17) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT1_1                    ((unsigned int) 0x1 << 17) /* (HDMA) Channel 1 empty.*/
#define AT91C_HDMA_EMPT2      ((unsigned int) 0x1 << 18) /* (HDMA) When set, channel 2 is empty.*/
#define 	AT91C_HDMA_EMPT2_0                    ((unsigned int) 0x0 << 18) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT2_1                    ((unsigned int) 0x1 << 18) /* (HDMA) Channel 2 empty.*/
#define AT91C_HDMA_EMPT3      ((unsigned int) 0x1 << 19) /* (HDMA) When set, channel 3 is empty.*/
#define 	AT91C_HDMA_EMPT3_0                    ((unsigned int) 0x0 << 19) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT3_1                    ((unsigned int) 0x1 << 19) /* (HDMA) Channel 3 empty.*/
#define AT91C_HDMA_EMPT4      ((unsigned int) 0x1 << 20) /* (HDMA) When set, channel 4 is empty.*/
#define 	AT91C_HDMA_EMPT4_0                    ((unsigned int) 0x0 << 20) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT4_1                    ((unsigned int) 0x1 << 20) /* (HDMA) Channel 4 empty.*/
#define AT91C_HDMA_EMPT5      ((unsigned int) 0x1 << 21) /* (HDMA) When set, channel 5 is empty.*/
#define 	AT91C_HDMA_EMPT5_0                    ((unsigned int) 0x0 << 21) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT5_1                    ((unsigned int) 0x1 << 21) /* (HDMA) Channel 5 empty.*/
#define AT91C_HDMA_EMPT6      ((unsigned int) 0x1 << 22) /* (HDMA) When set, channel 6 is empty.*/
#define 	AT91C_HDMA_EMPT6_0                    ((unsigned int) 0x0 << 22) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT6_1                    ((unsigned int) 0x1 << 22) /* (HDMA) Channel 6 empty.*/
#define AT91C_HDMA_EMPT7      ((unsigned int) 0x1 << 23) /* (HDMA) When set, channel 7 is empty.*/
#define 	AT91C_HDMA_EMPT7_0                    ((unsigned int) 0x0 << 23) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_EMPT7_1                    ((unsigned int) 0x1 << 23) /* (HDMA) Channel 7 empty.*/
#define AT91C_HDMA_STAL0      ((unsigned int) 0x1 << 24) /* (HDMA) When set, channel 0 is stalled.*/
#define 	AT91C_HDMA_STAL0_0                    ((unsigned int) 0x0 << 24) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL0_1                    ((unsigned int) 0x1 << 24) /* (HDMA) Channel 0 stalled.*/
#define AT91C_HDMA_STAL1      ((unsigned int) 0x1 << 25) /* (HDMA) When set, channel 1 is stalled.*/
#define 	AT91C_HDMA_STAL1_0                    ((unsigned int) 0x0 << 25) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL1_1                    ((unsigned int) 0x1 << 25) /* (HDMA) Channel 1 stalled.*/
#define AT91C_HDMA_STAL2      ((unsigned int) 0x1 << 26) /* (HDMA) When set, channel 2 is stalled.*/
#define 	AT91C_HDMA_STAL2_0                    ((unsigned int) 0x0 << 26) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL2_1                    ((unsigned int) 0x1 << 26) /* (HDMA) Channel 2 stalled.*/
#define AT91C_HDMA_STAL3      ((unsigned int) 0x1 << 27) /* (HDMA) When set, channel 3 is stalled.*/
#define 	AT91C_HDMA_STAL3_0                    ((unsigned int) 0x0 << 27) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL3_1                    ((unsigned int) 0x1 << 27) /* (HDMA) Channel 3 stalled.*/
#define AT91C_HDMA_STAL4      ((unsigned int) 0x1 << 28) /* (HDMA) When set, channel 4 is stalled.*/
#define 	AT91C_HDMA_STAL4_0                    ((unsigned int) 0x0 << 28) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL4_1                    ((unsigned int) 0x1 << 28) /* (HDMA) Channel 4 stalled.*/
#define AT91C_HDMA_STAL5      ((unsigned int) 0x1 << 29) /* (HDMA) When set, channel 5 is stalled.*/
#define 	AT91C_HDMA_STAL5_0                    ((unsigned int) 0x0 << 29) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL5_1                    ((unsigned int) 0x1 << 29) /* (HDMA) Channel 5 stalled.*/
#define AT91C_HDMA_STAL6      ((unsigned int) 0x1 << 30) /* (HDMA) When set, channel 6 is stalled.*/
#define 	AT91C_HDMA_STAL6_0                    ((unsigned int) 0x0 << 30) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL6_1                    ((unsigned int) 0x1 << 30) /* (HDMA) Channel 6 stalled.*/
#define AT91C_HDMA_STAL7      ((unsigned int) 0x1 << 31) /* (HDMA) When set, channel 7 is stalled.*/
#define 	AT91C_HDMA_STAL7_0                    ((unsigned int) 0x0 << 31) /* (HDMA) No effect.*/
#define 	AT91C_HDMA_STAL7_1                    ((unsigned int) 0x1 << 31) /* (HDMA) Channel 7 stalled.*/
/* -------- HDMA_RSVD : (HDMA Offset: 0x34)  -------- */
/* -------- HDMA_RSVD : (HDMA Offset: 0x38)  -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* ******************************************************************************/
typedef struct _AT91S_ECC {
	AT91_REG	 ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 Reserved0[58]; 	/* */
	AT91_REG	 ECC_VR; 	/*  ECC Version register*/
} AT91S_ECC, *AT91PS_ECC;

/* -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
#define AT91C_ECC_RST         ((unsigned int) 0x1 <<  0) /* (ECC) ECC reset parity*/
/* -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
#define AT91C_ECC_PAGE_SIZE   ((unsigned int) 0x3 <<  0) /* (ECC) Nand Flash page size*/
/* -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
#define AT91C_ECC_RECERR      ((unsigned int) 0x1 <<  0) /* (ECC) ECC error*/
#define AT91C_ECC_ECCERR      ((unsigned int) 0x1 <<  1) /* (ECC) ECC single error*/
#define AT91C_ECC_MULERR      ((unsigned int) 0x1 <<  2) /* (ECC) ECC_MULERR*/
/* -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
#define AT91C_ECC_BITADDR     ((unsigned int) 0xF <<  0) /* (ECC) Bit address error*/
#define AT91C_ECC_WORDADDR    ((unsigned int) 0xFFF <<  4) /* (ECC) address of the failing bit*/
/* -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
#define AT91C_ECC_NPARITY     ((unsigned int) 0xFFFF <<  0) /* (ECC) ECC parity N */
/* -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
#define AT91C_ECC_VR          ((unsigned int) 0xF <<  0) /* (ECC) ECC version register*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100*/
/* ******************************************************************************/
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_NCR; 	/* Network Control Register*/
	AT91_REG	 EMAC_NCFGR; 	/* Network Configuration Register*/
	AT91_REG	 EMAC_NSR; 	/* Network Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 EMAC_TSR; 	/* Transmit Status Register*/
	AT91_REG	 EMAC_RBQP; 	/* Receive Buffer Queue Pointer*/
	AT91_REG	 EMAC_TBQP; 	/* Transmit Buffer Queue Pointer*/
	AT91_REG	 EMAC_RSR; 	/* Receive Status Register*/
	AT91_REG	 EMAC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 EMAC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 EMAC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 EMAC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 EMAC_MAN; 	/* PHY Maintenance Register*/
	AT91_REG	 EMAC_PTR; 	/* Pause Time Register*/
	AT91_REG	 EMAC_PFR; 	/* Pause Frames received Register*/
	AT91_REG	 EMAC_FTO; 	/* Frames Transmitted OK Register*/
	AT91_REG	 EMAC_SCF; 	/* Single Collision Frame Register*/
	AT91_REG	 EMAC_MCF; 	/* Multiple Collision Frame Register*/
	AT91_REG	 EMAC_FRO; 	/* Frames Received OK Register*/
	AT91_REG	 EMAC_FCSE; 	/* Frame Check Sequence Error Register*/
	AT91_REG	 EMAC_ALE; 	/* Alignment Error Register*/
	AT91_REG	 EMAC_DTF; 	/* Deferred Transmission Frame Register*/
	AT91_REG	 EMAC_LCOL; 	/* Late Collision Register*/
	AT91_REG	 EMAC_ECOL; 	/* Excessive Collision Register*/
	AT91_REG	 EMAC_TUND; 	/* Transmit Underrun Error Register*/
	AT91_REG	 EMAC_CSE; 	/* Carrier Sense Error Register*/
	AT91_REG	 EMAC_RRE; 	/* Receive Ressource Error Register*/
	AT91_REG	 EMAC_ROV; 	/* Receive Overrun Errors Register*/
	AT91_REG	 EMAC_RSE; 	/* Receive Symbol Errors Register*/
	AT91_REG	 EMAC_ELE; 	/* Excessive Length Errors Register*/
	AT91_REG	 EMAC_RJA; 	/* Receive Jabbers Register*/
	AT91_REG	 EMAC_USF; 	/* Undersize Frames Register*/
	AT91_REG	 EMAC_STE; 	/* SQE Test Error Register*/
	AT91_REG	 EMAC_RLE; 	/* Receive Length Field Mismatch Register*/
	AT91_REG	 EMAC_TPF; 	/* Transmitted Pause Frames Register*/
	AT91_REG	 EMAC_HRB; 	/* Hash Address Bottom[31:0]*/
	AT91_REG	 EMAC_HRT; 	/* Hash Address Top[63:32]*/
	AT91_REG	 EMAC_SA1L; 	/* Specific Address 1 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA1H; 	/* Specific Address 1 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA2L; 	/* Specific Address 2 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA2H; 	/* Specific Address 2 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA3L; 	/* Specific Address 3 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA3H; 	/* Specific Address 3 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA4L; 	/* Specific Address 4 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA4H; 	/* Specific Address 4 Top, Last 2 bytes*/
	AT91_REG	 EMAC_TID; 	/* Type ID Checking Register*/
	AT91_REG	 EMAC_TPQ; 	/* Transmit Pause Quantum Register*/
	AT91_REG	 EMAC_USRIO; 	/* USER Input/Output Register*/
	AT91_REG	 EMAC_WOL; 	/* Wake On LAN Register*/
	AT91_REG	 Reserved1[13]; 	/* */
	AT91_REG	 EMAC_REV; 	/* Revision Register*/
} AT91S_EMAC, *AT91PS_EMAC;

