una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* -------- VDEC_IDR : (VDEC Offset: 0x0) VDEC ID Register -------- */
#define AT91C_VDEC_ID         ((unsigned int) 0x0 <<  0) /* (VDEC) VDEC identification number*/
/* -------- VDEC_ISR : (VDEC Offset: 0x4) VDEC Interrupt Status Register -------- */
#define AT91C_VDEC_DEC_E      ((unsigned int) 0x1 <<  0) /* (VDEC) VDEC Decoder Enable*/
#define AT91C_VDEC_DEC_IRQ_DIS ((unsigned int) 0x1 <<  4) /* (VDEC) VDEC IRQ disable*/
#define AT91C_VDEC_DEC_IRQ    ((unsigned int) 0x1 <<  8) /* (VDEC) VDEC Interrupt Request*/
#define AT91C_VDEC_DEC_RDY_INT ((unsigned int) 0x1 << 12) /* (VDEC) VDEC Decoder Ready*/
#define AT91C_VDEC_DEC_BUS_INT ((unsigned int) 0x1 << 13) /* (VDEC) VDEC Error response from bus*/
#define AT91C_VDEC_DEC_BUFFER_INT ((unsigned int) 0x1 << 14) /* (VDEC) VDEC Buffer empty*/
#define AT91C_VDEC_DEC_ASO_INT ((unsigned int) 0x1 << 15) /* (VDEC) VDEC ASO detected*/
#define AT91C_VDEC_DEC_ERROR_INT ((unsigned int) 0x1 << 16) /* (VDEC) VDEC Input Data Stream Error*/
#define AT91C_VDEC_DEC_SLICE_INT ((unsigned int) 0x1 << 17) /* (VDEC) VDEC JPEG Slice Decoded Interrupt*/
#define AT91C_VDEC_DEC_TIMEOUT ((unsigned int) 0x1 << 18) /* (VDEC) VDEC Decoder Timeout*/
/* -------- VDEC_DCR : (VDEC Offset: 0x8) VDEC Device Configuration Register -------- */
#define AT91C_VDEC_DEC_MAX_BURST ((unsigned int) 0x1F <<  0) /* (VDEC) VDEC maximum burst length*/
#define 	AT91C_VDEC_DEC_MAX_BURST_4                    ((unsigned int) 0x4) /* (VDEC) INCR4*/
#define 	AT91C_VDEC_DEC_MAX_BURST_8                    ((unsigned int) 0x8) /* (VDEC) INCR8*/
#define 	AT91C_VDEC_DEC_MAX_BURST_16                   ((unsigned int) 0x10) /* (VDEC) INCR16*/
#define AT91C_VDEC_PRIORITY_MODE ((unsigned int) 0x7 <<  5) /* (VDEC) VDEC priority mode*/
#define 	AT91C_VDEC_PRIORITY_MODE_HW                   ((unsigned int) 0x0 <<  5) /* (VDEC) */
#define 	AT91C_VDEC_PRIORITY_MODE_WRITE_FT             ((unsigned int) 0x1 <<  5) /* (VDEC) */
#define 	AT91C_VDEC_PRIORITY_MODE_WRITE_PP             ((unsigned int) 0x2 <<  5) /* (VDEC) */
#define 	AT91C_VDEC_PRIORITY_MODE_READ_FT              ((unsigned int) 0x3 <<  5) /* (VDEC) */
#define 	AT91C_VDEC_PRIORITY_MODE_READ_PP              ((unsigned int) 0x4 <<  5) /* (VDEC) */
#define AT91C_VDEC_DEC_OUT_ENDIAN ((unsigned int) 0x1 <<  8) /* (VDEC) VDEC decoder output endian mode*/
#define 	AT91C_VDEC_DEC_OUT_ENDIAN_BIG                  ((unsigned int) 0x0 <<  8) /* (VDEC) BIG ENDIAN*/
#define 	AT91C_VDEC_DEC_OUT_ENDIAN_LIT                  ((unsigned int) 0x1 <<  8) /* (VDEC) LITTLE ENDIAN*/
#define AT91C_VDEC_DEC_IN_ENDIAN ((unsigned int) 0x1 <<  9) /* (VDEC) VDEC decoder input endian mode*/
#define 	AT91C_VDEC_DEC_IN_ENDIAN_BIG                  ((unsigned int) 0x0 <<  9) /* (VDEC) BIG ENDIAN*/
#define 	AT91C_VDEC_DEC_IN_ENDIAN_LIT                  ((unsigned int) 0x1 <<  9) /* (VDEC) LITTLE ENDIAN*/
#define AT91C_VDEC_DEC_CLK_GATE_E ((unsigned int) 0x1 << 10) /* (VDEC) VDEC dynamic clock gating enable*/
#define AT91C_VDEC_DEC_LATENCY ((unsigned int) 0x3F << 11) /* (VDEC) VDEC decoder latency compensation*/
#define AT91C_VDEC_DEC_OUT_TILED_E ((unsigned int) 0x1 << 17) /* (VDEC) VDEC identification number*/
#define AT91C_VDEC_DEC_DATA_DISC_E ((unsigned int) 0x1 << 18) /* (VDEC) VDEC data discard enable*/
#define AT91C_VDEC_DEC_OUTSWAP32_E ((unsigned int) 0x1 << 19) /* (VDEC) VDEC output 32bit data swap*/
#define AT91C_VDEC_DEC_INSWAP32_E ((unsigned int) 0x1 << 20) /* (VDEC) VDEC input 32bit data swap*/
#define AT91C_VDEC_DEC_STRENDIAN_E ((unsigned int) 0x1 << 21) /* (VDEC) VDEC data stream endian mode*/
#define 	AT91C_VDEC_DEC_STRENDIAN_E_BIG                  ((unsigned int) 0x0 << 21) /* (VDEC) BIG ENDIAN*/
#define 	AT91C_VDEC_DEC_STRENDIAN_E_LIT                  ((unsigned int) 0x1 << 21) /* (VDEC) LITTLE ENDIAN*/
#define AT91C_VDEC_DEC_STRSWAP32_E ((unsigned int) 0x1 << 22) /* (VDEC) VDEC input 32bit data swap for stream data*/
#define AT91C_VDEC_DEC_TIMEOUT_E ((unsigned int) 0x1 << 23) /* (VDEC) VDEC timeout interrupt enable*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UHPHS_OHCI {
	AT91_REG	 UHPHS_OHCI_HcRevision; 	/* Revision*/
	AT91_REG	 UHPHS_OHCI_HcControl; 	/* Operating modes for the Host Controller*/
	AT91_REG	 UHPHS_OHCI_HcCommandStatus; 	/* Command & status Register*/
	AT91_REG	 UHPHS_OHCI_HcInterruptStatus; 	/* Interrupt Status Register*/
	AT91_REG	 UHPHS_OHCI_HcInterruptEnable; 	/* Interrupt Enable Register*/
	AT91_REG	 UHPHS_OHCI_HcInterruptDisable; 	/* Interrupt Disable Register*/
	AT91_REG	 UHPHS_OHCI_HcHCCA; 	/* Pointer to the Host Controller Communication Area*/
	AT91_REG	 UHPHS_OHCI_HcPeriodCurrentED; 	/* Current Isochronous or Interrupt Endpoint Descriptor*/
	AT91_REG	 UHPHS_OHCI_HcControlHeadED; 	/* First Endpoint Descriptor of the Control list*/
	AT91_REG	 UHPHS_OHCI_HcControlCurrentED; 	/* Endpoint Control and Status Register*/
	AT91_REG	 UHPHS_OHCI_HcBulkHeadED; 	/* First endpoint register of the Bulk list*/
	AT91_REG	 UHPHS_OHCI_HcBulkCurrentED; 	/* Current endpoint of the Bulk list*/
	AT91_REG	 UHPHS_OHCI_HcBulkDoneHead; 	/* Last completed transfer descriptor*/
	AT91_REG	 UHPHS_OHCI_HcFmInterval; 	/* Bit time between 2 consecutive SOFs*/
	AT91_REG	 UHPHS_OHCI_HcFmRemaining; 	/* Bit time remaining in the current Frame*/
	AT91_REG	 UHPHS_OHCI_HcFmNumber; 	/* Frame number*/
	AT91_REG	 UHPHS_OHCI_HcPeriodicStart; 	/* Periodic Start*/
	AT91_REG	 UHPHS_OHCI_HcLSThreshold; 	/* LS Threshold*/
	AT91_REG	 UHPHS_OHCI_HcRhDescriptorA; 	/* Root Hub characteristics A*/
	AT91_REG	 UHPHS_OHCI_HcRhDescriptorB; 	/* Root Hub characteristics B*/
	AT91_REG	 UHPHS_OHCI_HcRhStatus; 	/* Root Hub Status register*/
	AT91_REG	 UHPHS_OHCI_HcRhPortStatus[2]; 	/* Root Hub Port Status Register*/
} AT91S_UHPHS_OHCI, *AT91PS_UHPHS_OHCI;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UHPHS_EHCI {
	AT91_REG	 UHPHS_EHCI_VERSION; 	/* */
	AT91_REG	 UHPHS_EHCI_HCSPARAMS; 	/* */
	AT91_REG	 UHPHS_EHCI_HCCPARAMS; 	/* */
	AT91_REG	 UHPHS_EHCI_HCSPPORTROUTE; 	/* */
	AT91_REG	 UHPHS_EHCI_USBCMD; 	/* */
	AT91_REG	 UHPHS_EHCI_USBSTS; 	/* */
	AT91_REG	 UHPHS_EHCI_USBINTR; 	/* */
	AT91_REG	 UHPHS_EHCI_FRINDEX; 	/* */
	AT91_REG	 UHPHS_EHCI_CTRLDSSEGMENT; 	/* */
	AT91_REG	 UHPHS_EHCI_PERIODICLISTBASE; 	/* */
	AT91_REG	 UHPHS_EHCI_ASYNCLISTADDR; 	/* */
	AT91_REG	 Reserved0[9]; 	/* */
	AT91_REG	 UHPHS_EHCI_CONFIGFLAG; 	/* */
	AT91_REG	 UHPHS_EHCI_PORTSC[2]; 	/* */
	AT91_REG	 Reserved1[13]; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG00; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG01; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG02; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG03; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG04; 	/* */
	AT91_REG	 UHPHS_EHCI_INSNREG05; 	/* */
} AT91S_UHPHS_EHCI, *AT91PS_UHPHS_EHCI;

/* -------- VERSION : (UHPHS_EHCI Offset: 0x0)  -------- */
#define AT91C_UHPHS_CAPLENGTH ((unsigned int) 0xFF <<  0) /* (UHPHS_EHCI) CapLength : Offset for control registers*/
#define AT91C_UHPHS_HCIVERSION ((unsigned int) 0xFF << 16) /* (UHPHS_EHCI) Hci Version*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Advanced  Encryption Standard*/
/* ******************************************************************************/
typedef struct _AT91S_AES {
	AT91_REG	 AES_CR; 	/* Control Register*/
	AT91_REG	 AES_MR; 	/* Mode Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AES_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 AES_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 AES_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AES_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AES_KEYWxR[8]; 	/* Key Word x Register*/
	AT91_REG	 AES_IDATAxR[4]; 	/* Input Data x Register*/
	AT91_REG	 AES_ODATAxR[4]; 	/* Output Data x Register*/
	AT91_REG	 AES_IVxR[4]; 	/* Initialization Vector x Register*/
	AT91_REG	 Reserved1[35]; 	/* */
	AT91_REG	 AES_VR; 	/* AES Version Register*/
	AT91_REG	 AES_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 AES_RCR; 	/* Receive Counter Register*/
	AT91_REG	 AES_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 AES_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 AES_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 AES_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 AES_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 AES_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 AES_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 AES_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_AES, *AT91PS_AES;

