una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91SAM9264*/
/* ******************************************************************************/
/* ========== Register definition for SFR peripheral ========== */
#define AT91C_SFR_INT   ((AT91_REG *) 	0xFFF74014) /* (SFR) OHCI suspend Interrupt status*/
#define AT91C_SFR_DDRCFG ((AT91_REG *) 	0xFFF74004) /* (SFR) DDR2 SSTL18 control*/
#define AT91C_SFR_UTMICFG ((AT91_REG *) 	0xFFF74010) /* (SFR) UTMI Software Reset, and OHCI suspend interrupt control*/
#define AT91C_SFR_EBIDELAY ((AT91_REG *) 	0xFFF7400C) /* (SFR) EBI DDR controller clock delay*/
#define AT91C_SFR_DDRDELAY ((AT91_REG *) 	0xFFF74008) /* (SFR) DDR2 controller clock delay*/
#define AT91C_SFR_EMA   ((AT91_REG *) 	0xFFF74000) /* (SFR) memory Extra Margin Adjustment control*/
/* ========== Register definition for SYS peripheral ========== */
#define AT91C_SYS_SLCKSEL ((AT91_REG *) 	0xFFFFFD50) /* (SYS) Slow Clock Selection Register*/
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0xFFFFFD60) /* (SYS) General Purpose Register*/
/* ========== Register definition for EBI peripheral ========== */
#define AT91C_EBI_DUMMY ((AT91_REG *) 	0xFFFFE200) /* (EBI) Dummy register - Do not use*/
/* ========== Register definition for DDR2CP1 peripheral ========== */
#define AT91C_DDR2CP1_DELAY2 ((AT91_REG *) 	0xFFFFE434) /* (DDR2CP1) Pad delay2 Register*/
#define AT91C_DDR2CP1_T3PR ((AT91_REG *) 	0xFFFFE418) /* (DDR2CP1) Timing3 Register*/
#define AT91C_DDR2CP1_RTR ((AT91_REG *) 	0xFFFFE404) /* (DDR2CP1) Refresh Timer Register*/
#define AT91C_DDR2CP1_T0PR ((AT91_REG *) 	0xFFFFE40C) /* (DDR2CP1) Timing0 Register*/
#define AT91C_DDR2CP1_WPSR ((AT91_REG *) 	0xFFFFE4E8) /* (DDR2CP1) High Speed Register*/
#define AT91C_DDR2CP1_DELAY8 ((AT91_REG *) 	0xFFFFE44C) /* (DDR2CP1) Pad delay8 Register*/
#define AT91C_DDR2CP1_LPR ((AT91_REG *) 	0xFFFFE41C) /* (DDR2CP1) Low-power Register*/
#define AT91C_DDR2CP1_VER ((AT91_REG *) 	0xFFFFE428) /* (DDR2CP1) DLL Version Register*/
#define AT91C_DDR2CP1_DELAY7 ((AT91_REG *) 	0xFFFFE448) /* (DDR2CP1) Pad delay7 Register*/
#define AT91C_DDR2CP1_CR ((AT91_REG *) 	0xFFFFE408) /* (DDR2CP1) Configuration Register*/
#define AT91C_DDR2CP1_WPCR ((AT91_REG *) 	0xFFFFE4E4) /* (DDR2CP1) High Speed Register*/
#define AT91C_DDR2CP1_MR ((AT91_REG *) 	0xFFFFE400) /* (DDR2CP1) Mode Register*/
#define AT91C_DDR2CP1_DELAY5 ((AT91_REG *) 	0xFFFFE440) /* (DDR2CP1) Pad delay5 Register*/
#define AT91C_DDR2CP1_T2PR ((AT91_REG *) 	0xFFFFE414) /* (DDR2CP1) Timing2 Register*/
#define AT91C_DDR2CP1_HS ((AT91_REG *) 	0xFFFFE42C) /* (DDR2CP1) High Speed Register*/
#define AT91C_DDR2CP1_MDR ((AT91_REG *) 	0xFFFFE420) /* (DDR2CP1) Memory Device Register*/
#define AT91C_DDR2CP1_DELAY4 ((AT91_REG *) 	0xFFFFE43C) /* (DDR2CP1) Pad delay4 Register*/
#define AT91C_DDR2CP1_DELAY1 ((AT91_REG *) 	0xFFFFE430) /* (DDR2CP1) Pad delay1 Register*/
#define AT91C_DDR2CP1_DELAY6 ((AT91_REG *) 	0xFFFFE444) /* (DDR2CP1) Pad delay6 Register*/
#define AT91C_DDR2CP1_DLL ((AT91_REG *) 	0xFFFFE424) /* (DDR2CP1) DLL Information Register*/
#define AT91C_DDR2CP1_DELAY3 ((AT91_REG *) 	0xFFFFE438) /* (DDR2CP1) Pad delay3 Register*/
#define AT91C_DDR2CP1_VERSION ((AT91_REG *) 	0xFFFFE4FC) /* (DDR2CP1) Version Register*/
#define AT91C_DDR2CP1_T1PR ((AT91_REG *) 	0xFFFFE410) /* (DDR2CP1) Timing1 Register*/
/* ========== Register definition for DDR2C peripheral ========== */
#define AT91C_DDR2C_DELAY8 ((AT91_REG *) 	0xFFFFE64C) /* (DDR2C) Pad delay8 Register*/
#define AT91C_DDR2C_VER ((AT91_REG *) 	0xFFFFE628) /* (DDR2C) DLL Version Register*/
#define AT91C_DDR2C_RTR ((AT91_REG *) 	0xFFFFE604) /* (DDR2C) Refresh Timer Register*/
#define AT91C_DDR2C_T0PR ((AT91_REG *) 	0xFFFFE60C) /* (DDR2C) Timing0 Register*/
#define AT91C_DDR2C_DELAY5 ((AT91_REG *) 	0xFFFFE640) /* (DDR2C) Pad delay5 Register*/
#define AT91C_DDR2C_LPR ((AT91_REG *) 	0xFFFFE61C) /* (DDR2C) Low-power Register*/
#define AT91C_DDR2C_HS  ((AT91_REG *) 	0xFFFFE62C) /* (DDR2C) High Speed Register*/
#define AT91C_DDR2C_DELAY2 ((AT91_REG *) 	0xFFFFE634) /* (DDR2C) Pad delay2 Register*/
#define AT91C_DDR2C_T2PR ((AT91_REG *) 	0xFFFFE614) /* (DDR2C) Timing2 Register*/
#define AT91C_DDR2C_DELAY1 ((AT91_REG *) 	0xFFFFE630) /* (DDR2C) Pad delay1 Register*/
#define AT91C_DDR2C_T1PR ((AT91_REG *) 	0xFFFFE610) /* (DDR2C) Timing1 Register*/
#define AT91C_DDR2C_MDR ((AT91_REG *) 	0xFFFFE620) /* (DDR2C) Memory Device Register*/
#define AT91C_DDR2C_DELAY6 ((AT91_REG *) 	0xFFFFE644) /* (DDR2C) Pad delay6 Register*/
#define AT91C_DDR2C_VERSION ((AT91_REG *) 	0xFFFFE6FC) /* (DDR2C) Version Register*/
#define AT91C_DDR2C_MR  ((AT91_REG *) 	0xFFFFE600) /* (DDR2C) Mode Register*/
#define AT91C_DDR2C_DLL ((AT91_REG *) 	0xFFFFE624) /* (DDR2C) DLL Information Register*/
#define AT91C_DDR2C_DELAY4 ((AT91_REG *) 	0xFFFFE63C) /* (DDR2C) Pad delay4 Register*/
#define AT91C_DDR2C_WPCR ((AT91_REG *) 	0xFFFFE6E4) /* (DDR2C) High Speed Register*/
#define AT91C_DDR2C_CR  ((AT91_REG *) 	0xFFFFE608) /* (DDR2C) Configuration Register*/
#define AT91C_DDR2C_DELAY3 ((AT91_REG *) 	0xFFFFE638) /* (DDR2C) Pad delay3 Register*/
#define AT91C_DDR2C_WPSR ((AT91_REG *) 	0xFFFFE6E8) /* (DDR2C) High Speed Register*/
#define AT91C_DDR2C_DELAY7 ((AT91_REG *) 	0xFFFFE648) /* (DDR2C) Pad delay7 Register*/
#define AT91C_DDR2C_T3PR ((AT91_REG *) 	0xFFFFE618) /* (DDR2C) Timing3 Register*/
/* ========== Register definition for SMC peripheral ========== */
#define AT91C_SMC_PULSE7 ((AT91_REG *) 	0xFFFFE874) /* (SMC)  Pulse Register for CS 7*/
#define AT91C_SMC_DELAY1 ((AT91_REG *) 	0xFFFFE8C0) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE2 ((AT91_REG *) 	0xFFFFE828) /* (SMC)  Cycle Register for CS 2*/
#define AT91C_SMC_DELAY5 ((AT91_REG *) 	0xFFFFE8D0) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_DELAY6 ((AT91_REG *) 	0xFFFFE8D4) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_PULSE2 ((AT91_REG *) 	0xFFFFE824) /* (SMC)  Pulse Register for CS 2*/
#define AT91C_SMC_SETUP6 ((AT91_REG *) 	0xFFFFE860) /* (SMC)  Setup Register for CS 6*/
#define AT91C_SMC_SETUP5 ((AT91_REG *) 	0xFFFFE850) /* (SMC)  Setup Register for CS 5*/
#define AT91C_SMC_CYCLE6 ((AT91_REG *) 	0xFFFFE868) /* (SMC)  Cycle Register for CS 6*/
#define AT91C_SMC_PULSE6 ((AT91_REG *) 	0xFFFFE864) /* (SMC)  Pulse Register for CS 6*/
#define AT91C_SMC_CTRL5 ((AT91_REG *) 	0xFFFFE85C) /* (SMC)  Control Register for CS 5*/
#define AT91C_SMC_CTRL3 ((AT91_REG *) 	0xFFFFE83C) /* (SMC)  Control Register for CS 3*/
#define AT91C_SMC_DELAY7 ((AT91_REG *) 	0xFFFFE8D8) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_DELAY3 ((AT91_REG *) 	0xFFFFE8C8) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE0 ((AT91_REG *) 	0xFFFFE808) /* (SMC)  Cycle Register for CS 0*/
#define AT91C_SMC_SETUP1 ((AT91_REG *) 	0xFFFFE810) /* (SMC)  Setup Register for CS 1*/
#define AT91C_SMC_PULSE5 ((AT91_REG *) 	0xFFFFE854) /* (SMC)  Pulse Register for CS 5*/
#define AT91C_SMC_SETUP7 ((AT91_REG *) 	0xFFFFE870) /* (SMC)  Setup Register for CS 7*/
#define AT91C_SMC_CTRL4 ((AT91_REG *) 	0xFFFFE84C) /* (SMC)  Control Register for CS 4*/
#define AT91C_SMC_DELAY2 ((AT91_REG *) 	0xFFFFE8C4) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_PULSE3 ((AT91_REG *) 	0xFFFFE834) /* (SMC)  Pulse Register for CS 3*/
#define AT91C_SMC_CYCLE4 ((AT91_REG *) 	0xFFFFE848) /* (SMC)  Cycle Register for CS 4*/
#define AT91C_SMC_CTRL1 ((AT91_REG *) 	0xFFFFE81C) /* (SMC)  Control Register for CS 1*/
#define AT91C_SMC_SETUP3 ((AT91_REG *) 	0xFFFFE830) /* (SMC)  Setup Register for CS 3*/
#define AT91C_SMC_CTRL0 ((AT91_REG *) 	0xFFFFE80C) /* (SMC)  Control Register for CS 0*/
#define AT91C_SMC_CYCLE7 ((AT91_REG *) 	0xFFFFE878) /* (SMC)  Cycle Register for CS 7*/
#define AT91C_SMC_DELAY4 ((AT91_REG *) 	0xFFFFE8CC) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE1 ((AT91_REG *) 	0xFFFFE818) /* (SMC)  Cycle Register for CS 1*/
#define AT91C_SMC_SETUP2 ((AT91_REG *) 	0xFFFFE820) /* (SMC)  Setup Register for CS 2*/
#define AT91C_SMC_PULSE1 ((AT91_REG *) 	0xFFFFE814) /* (SMC)  Pulse Register for CS 1*/
#define AT91C_SMC_DELAY8 ((AT91_REG *) 	0xFFFFE8DC) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CTRL2 ((AT91_REG *) 	0xFFFFE82C) /* (SMC)  Control Register for CS 2*/
#define AT91C_SMC_PULSE4 ((AT91_REG *) 	0xFFFFE844) /* (SMC)  Pulse Register for CS 4*/
#define AT91C_SMC_SETUP4 ((AT91_REG *) 	0xFFFFE840) /* (SMC)  Setup Register for CS 4*/
#define AT91C_SMC_CYCLE3 ((AT91_REG *) 	0xFFFFE838) /* (SMC)  Cycle Register for CS 3*/
#define AT91C_SMC_SETUP0 ((AT91_REG *) 	0xFFFFE800) /* (SMC)  Setup Register for CS 0*/
#define AT91C_SMC_CYCLE5 ((AT91_REG *) 	0xFFFFE858) /* (SMC)  Cycle Register for CS 5*/
#define AT91C_SMC_PULSE0 ((AT91_REG *) 	0xFFFFE804) /* (SMC)  Pulse Register for CS 0*/
#define AT91C_SMC_CTRL6 ((AT91_REG *) 	0xFFFFE86C) /* (SMC)  Control Register for CS 6*/
#define AT91C_SMC_CTRL7 ((AT91_REG *) 	0xFFFFE87C) /* (SMC)  Control Register for CS 7*/
/* ========== Register definition for MATRIX peripheral ========== */
#define AT91C_MATRIX_SCFG1 ((AT91_REG *) 	0xFFFFEA44) /* (MATRIX)  Slave Configuration Register 1 : SRAM S1*/
#define AT91C_MATRIX_MRCR ((AT91_REG *) 	0xFFFFEB00) /* (MATRIX)  Master Remap Control Register */
#define AT91C_MATRIX_PRAS2 ((AT91_REG *) 	0xFFFFEA90) /* (MATRIX)  PRAS2 : SRAM S2*/
#define AT91C_MATRIX_PRAS1 ((AT91_REG *) 	0xFFFFEA88) /* (MATRIX)  PRAS1 : SRAM S1*/
#define AT91C_MATRIX_PRAS0 ((AT91_REG *) 	0xFFFFEA80) /* (MATRIX)  PRAS0 : SRAM S0*/
#define AT91C_MATRIX_MCFG8 ((AT91_REG *) 	0xFFFFEA20) /* (MATRIX)  Master Configuration Register 8 : eMAC*/
#define AT91C_MATRIX_MCFG2 ((AT91_REG *) 	0xFFFFEA08) /* (MATRIX)  Master Configuration Register 2 : pdc*/
#define AT91C_MATRIX_PRAS4 ((AT91_REG *) 	0xFFFFEAA0) /* (MATRIX)  PRAS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
#define AT91C_MATRIX_MCFG3 ((AT91_REG *) 	0xFFFFEA0C) /* (MATRIX)  Master Configuration Register 3 : USB Host OHCI*/
#define AT91C_MATRIX_SCFG0 ((AT91_REG *) 	0xFFFFEA40) /* (MATRIX)  Slave Configuration Register 0 : SRAM S0*/
#define AT91C_MATRIX_MCFG7 ((AT91_REG *) 	0xFFFFEA1C) /* (MATRIX)  Master Configuration Register 7 : lcdc*/
#define AT91C_MATRIX_PRAS6 ((AT91_REG *) 	0xFFFFEAB0) /* (MATRIX)  PRAS6 : DDR2 S1*/
#define AT91C_MATRIX_SCFG7 ((AT91_REG *) 	0xFFFFEA5C) /* (MATRIX)  Slave Configuration Register 7 : DDR2 S2*/
#define AT91C_MATRIX_PRAS7 ((AT91_REG *) 	0xFFFFEAB8) /* (MATRIX)  PRAS7 : DDR2 S2*/
#define AT91C_MATRIX_SCFG2 ((AT91_REG *) 	0xFFFFEA48) /* (MATRIX)  Slave Configuration Register 2 : SRAM S2*/
#define AT91C_MATRIX_WRPROTST ((AT91_REG *) 	0xFFFFEBE8) /* (MATRIX)  Write Protection Status Register */
#define AT91C_MATRIX_PRBS0 ((AT91_REG *) 	0xFFFFEA84) /* (MATRIX)  PRBS0 : SRAM S0*/
#define AT91C_MATRIX_PRBS2 ((AT91_REG *) 	0xFFFFEA94) /* (MATRIX)  PRBS2 : SRAM S2*/
#define AT91C_MATRIX_MCFG4 ((AT91_REG *) 	0xFFFFEA10) /* (MATRIX)  Master Configuration Register 4 : DMA0*/
#define AT91C_MATRIX_SCFG5 ((AT91_REG *) 	0xFFFFEA54) /* (MATRIX)  Slave Configuration Register 5 : DDR2 S0*/
#define AT91C_MATRIX_PRBS6 ((AT91_REG *) 	0xFFFFEAB4) /* (MATRIX)  PRBS6 : DDR2 S1*/
#define AT91C_MATRIX_MCFG1 ((AT91_REG *) 	0xFFFFEA04) /* (MATRIX)  Master Configuration Register 1 ; ARM-D*/
#define AT91C_MATRIX_SCFG6 ((AT91_REG *) 	0xFFFFEA58) /* (MATRIX)  Slave Configuration Register 6 : DDR2 S1*/
#define AT91C_MATRIX_SCFG4 ((AT91_REG *) 	0xFFFFEA50) /* (MATRIX)  Slave Configuration Register 4 ; ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
#define AT91C_MATRIX_PRBS1 ((AT91_REG *) 	0xFFFFEA8C) /* (MATRIX)  PRBS1 : SRAM S1*/
#define AT91C_MATRIX_PRBS3 ((AT91_REG *) 	0xFFFFEA9C) /* (MATRIX)  PRBS3 : SRAM S3*/
#define AT91C_MATRIX_WRPROTEN ((AT91_REG *) 	0xFFFFEBE4) /* (MATRIX)  Write Protection Control Register */
#define AT91C_MATRIX_MCFG11 ((AT91_REG *) 	0xFFFFEA2C) /* (MATRIX)  Master Configuration Register 11 : Video Decoder*/
#define AT91C_MATRIX_MCFG0 ((AT91_REG *) 	0xFFFFEA00) /* (MATRIX)  Master Configuration Register 0 : ARM-I*/
#define AT91C_MATRIX_PRAS5 ((AT91_REG *) 	0xFFFFEAA8) /* (MATRIX)  PRAS5 : DDR2 S0*/
#define AT91C_MATRIX_PRBS4 ((AT91_REG *) 	0xFFFFEAA4) /* (MATRIX)  PRBS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder*/
#define AT91C_MATRIX_MCFG6 ((AT91_REG *) 	0xFFFFEA18) /* (MATRIX)  Master Configuration Register 6 : hisi*/
#define AT91C_MATRIX_PRBS5 ((AT91_REG *) 	0xFFFFEAAC) /* (MATRIX)  PRBS5 : DDR2 S0*/
#define AT91C_MATRIX_MCFG9 ((AT91_REG *) 	0xFFFFEA24) /* (MATRIX)  Master Configuration Register 9 : USB Device*/
#define AT91C_MATRIX_MCFG5 ((AT91_REG *) 	0xFFFFEA14) /* (MATRIX)  Master Configuration Register 5 : DMA1*/
#define AT91C_MATRIX_PRBS7 ((AT91_REG *) 	0xFFFFEABC) /* (MATRIX)  PRBS7 : DDR2 S2*/
#define AT91C_MATRIX_MCFG10 ((AT91_REG *) 	0xFFFFEA28) /* (MATRIX)  Master Configuration Register 10 : USB Host EHCI*/
#define AT91C_MATRIX_PRAS3 ((AT91_REG *) 	0xFFFFEA98) /* (MATRIX)  PRAS3 : SRAM S3*/
#define AT91C_MATRIX_SCFG3 ((AT91_REG *) 	0xFFFFEA4C) /* (MATRIX)  Slave Configuration Register 3 : SRAM S3*/
/* ========== Register definition for CCFG peripheral ========== */
#define AT91C_CCFG_TCMR ((AT91_REG *) 	0xFFFFEB10) /* (CCFG)  TCM configuration*/
#define AT91C_CCFG_VIDEO ((AT91_REG *) 	0xFFFFEB18) /* (CCFG)  Video Mode configuration*/
#define AT91C_CCFG_MATRIXVERSION ((AT91_REG *) 	0xFFFFEBFC) /* (CCFG)  Version Register*/
#define AT91C_CCFG_UDPHS ((AT91_REG *) 	0xFFFFEB14) /* (CCFG)  USB HS configuration*/
#define AT91C_CCFG_EBICSA ((AT91_REG *) 	0xFFFFEB28) /* (CCFG)  EBI Chip Select Assignement Register*/
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFEF20) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFEF04) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFEF0C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFEF14) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFEF18) /* (PDC_DBGU) Transmit Next Pointer Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFEF10) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFEF24) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFEF00) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFEF08) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFEF1C) /* (PDC_DBGU) Transmit Next Counter Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFEE20) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFEE00) /* (DBGU) Control Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFEE1C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFEE0C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFEE44) /* (DBGU) Chip ID Extension Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFEE10) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFEE48) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFEE08) /* (DBGU) Interrupt Enable Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFEE14) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFEE04) /* (DBGU) Mode Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFEE18) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFEE40) /* (DBGU) Chip ID Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF2A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_DELAY3 ((AT91_REG *) 	0xFFFFF2C8) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF24C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF204) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF218) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF278) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_DELAY2 ((AT91_REG *) 	0xFFFFF2C4) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF23C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF274) /* (PIOA) Select B Register*/
#define AT91C_PIOA_DELAY1 ((AT91_REG *) 	0xFFFFF2C0) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF264) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF210) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF200) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_VERSION ((AT91_REG *) 	0xFFFFF2FC) /* (PIOA) PIO Version Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF260) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF238) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_SLEWRATE1 ((AT91_REG *) 	0xFFFFF2B0) /* (PIOA) PIO Slewrate Control Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF254) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF228) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF234) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF270) /* (PIOA) Select A Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF2A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF248) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF268) /* (PIOA) Pull-up Status Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF250) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF224) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF230) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF2A0) /* (PIOA) Output Write Enable Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF244) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF220) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF240) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF214) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF258) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_DELAY4 ((AT91_REG *) 	0xFFFFF2CC) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF208) /* (PIOA) PIO Status Register*/
/* ========== Register definition for PIOB peripheral ========== */
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOB) Output Disable Registerr*/
#define AT91C_PIOB_DELAY4 ((AT91_REG *) 	0xFFFFF4CC) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOB) Set Output Data Register*/
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOB) Interrupt Status Register*/
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOB) AB Select Status Register*/
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOB) Interrupt Mask Register*/
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOB) Multi-driver Status Register*/
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOB) Pull-up Status Register*/
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOB) Pin Data Status Register*/
#define AT91C_PIOB_DELAY3 ((AT91_REG *) 	0xFFFFF4C8) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOB) Multi-driver Disable Register*/
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOB) Clear Output Data Register*/
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOB) Multi-driver Enable Register*/
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOB) PIO Disable Register*/
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOB) Input Filter Status Register*/
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOB) PIO Status Register*/
#define AT91C_PIOB_SLEWRATE1 ((AT91_REG *) 	0xFFFFF4B0) /* (PIOB) PIO Slewrate Control Register*/
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOB) Interrupt Enable Register*/
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOB) Pull-up Disable Register*/
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOB) PIO Enable Register*/
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOB) Input Filter Disable Register*/
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOB) Interrupt Disable Register*/
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOB) Output Write Disable Register*/
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOB) Output Data Status Register*/
#define AT91C_PIOB_DELAY2 ((AT91_REG *) 	0xFFFFF4C4) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOB) Output Write Status Register*/
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOB) Select B Register*/
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOB) Input Filter Enable Register*/
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOB) Output Write Enable Register*/
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOB) Pull-up Enable Register*/
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOB) Output Status Register*/
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOB) Select A Register*/
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOB) Output Enable Register*/
