una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_PIOB_VERSION ((AT91_REG *) 	0xFFFFF4FC) /* (PIOB) PIO Version Register*/
#define AT91C_PIOB_DELAY1 ((AT91_REG *) 	0xFFFFF4C0) /* (PIOB) PIO Delay Control Register*/
/* ========== Register definition for PIOC peripheral ========== */
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0xFFFFF6A4) /* (PIOC) Output Write Disable Register*/
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0xFFFFF648) /* (PIOC) Interrupt Mask Register*/
#define AT91C_PIOC_ASR  ((AT91_REG *) 	0xFFFFF670) /* (PIOC) Select A Register*/
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0xFFFFF660) /* (PIOC) Pull-up Disable Register*/
#define AT91C_PIOC_CODR ((AT91_REG *) 	0xFFFFF634) /* (PIOC) Clear Output Data Register*/
#define AT91C_PIOC_OWER ((AT91_REG *) 	0xFFFFF6A0) /* (PIOC) Output Write Enable Register*/
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0xFFFFF678) /* (PIOC) AB Select Status Register*/
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0xFFFFF624) /* (PIOC) Input Filter Disable Register*/
#define AT91C_PIOC_VERSION ((AT91_REG *) 	0xFFFFF6FC) /* (PIOC) PIO Version Register*/
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0xFFFFF614) /* (PIOC) Output Disable Registerr*/
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0xFFFFF664) /* (PIOC) Pull-up Enable Register*/
#define AT91C_PIOC_SODR ((AT91_REG *) 	0xFFFFF630) /* (PIOC) Set Output Data Register*/
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0xFFFFF64C) /* (PIOC) Interrupt Status Register*/
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0xFFFFF618) /* (PIOC) Output Status Register*/
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0xFFFFF658) /* (PIOC) Multi-driver Status Register*/
#define AT91C_PIOC_IFER ((AT91_REG *) 	0xFFFFF620) /* (PIOC) Input Filter Enable Register*/
#define AT91C_PIOC_DELAY2 ((AT91_REG *) 	0xFFFFF6C4) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_MDER ((AT91_REG *) 	0xFFFFF650) /* (PIOC) Multi-driver Enable Register*/
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0xFFFFF668) /* (PIOC) Pull-up Status Register*/
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0xFFFFF608) /* (PIOC) PIO Status Register*/
#define AT91C_PIOC_DELAY4 ((AT91_REG *) 	0xFFFFF6CC) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_DELAY3 ((AT91_REG *) 	0xFFFFF6C8) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_IER  ((AT91_REG *) 	0xFFFFF640) /* (PIOC) Interrupt Enable Register*/
#define AT91C_PIOC_SLEWRATE1 ((AT91_REG *) 	0xFFFFF6B0) /* (PIOC) PIO Slewrate Control Register*/
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0xFFFFF644) /* (PIOC) Interrupt Disable Register*/
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0xFFFFF63C) /* (PIOC) Pin Data Status Register*/
#define AT91C_PIOC_DELAY1 ((AT91_REG *) 	0xFFFFF6C0) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0xFFFFF604) /* (PIOC) PIO Disable Register*/
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0xFFFFF6A8) /* (PIOC) Output Write Status Register*/
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0xFFFFF628) /* (PIOC) Input Filter Status Register*/
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0xFFFFF638) /* (PIOC) Output Data Status Register*/
#define AT91C_PIOC_OER  ((AT91_REG *) 	0xFFFFF610) /* (PIOC) Output Enable Register*/
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0xFFFFF654) /* (PIOC) Multi-driver Disable Register*/
#define AT91C_PIOC_BSR  ((AT91_REG *) 	0xFFFFF674) /* (PIOC) Select B Register*/
#define AT91C_PIOC_PER  ((AT91_REG *) 	0xFFFFF600) /* (PIOC) PIO Enable Register*/
/* ========== Register definition for PIOD peripheral ========== */
#define AT91C_PIOD_DELAY1 ((AT91_REG *) 	0xFFFFF8C0) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_OWDR ((AT91_REG *) 	0xFFFFF8A4) /* (PIOD) Output Write Disable Register*/
#define AT91C_PIOD_SODR ((AT91_REG *) 	0xFFFFF830) /* (PIOD) Set Output Data Register*/
#define AT91C_PIOD_PPUER ((AT91_REG *) 	0xFFFFF864) /* (PIOD) Pull-up Enable Register*/
#define AT91C_PIOD_CODR ((AT91_REG *) 	0xFFFFF834) /* (PIOD) Clear Output Data Register*/
#define AT91C_PIOD_DELAY4 ((AT91_REG *) 	0xFFFFF8CC) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_PSR  ((AT91_REG *) 	0xFFFFF808) /* (PIOD) PIO Status Register*/
#define AT91C_PIOD_PDR  ((AT91_REG *) 	0xFFFFF804) /* (PIOD) PIO Disable Register*/
#define AT91C_PIOD_ODR  ((AT91_REG *) 	0xFFFFF814) /* (PIOD) Output Disable Registerr*/
#define AT91C_PIOD_PPUSR ((AT91_REG *) 	0xFFFFF868) /* (PIOD) Pull-up Status Register*/
#define AT91C_PIOD_IFSR ((AT91_REG *) 	0xFFFFF828) /* (PIOD) Input Filter Status Register*/
#define AT91C_PIOD_IMR  ((AT91_REG *) 	0xFFFFF848) /* (PIOD) Interrupt Mask Register*/
#define AT91C_PIOD_ASR  ((AT91_REG *) 	0xFFFFF870) /* (PIOD) Select A Register*/
#define AT91C_PIOD_DELAY2 ((AT91_REG *) 	0xFFFFF8C4) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_OWSR ((AT91_REG *) 	0xFFFFF8A8) /* (PIOD) Output Write Status Register*/
#define AT91C_PIOD_PER  ((AT91_REG *) 	0xFFFFF800) /* (PIOD) PIO Enable Register*/
#define AT91C_PIOD_MDER ((AT91_REG *) 	0xFFFFF850) /* (PIOD) Multi-driver Enable Register*/
#define AT91C_PIOD_PDSR ((AT91_REG *) 	0xFFFFF83C) /* (PIOD) Pin Data Status Register*/
#define AT91C_PIOD_MDSR ((AT91_REG *) 	0xFFFFF858) /* (PIOD) Multi-driver Status Register*/
#define AT91C_PIOD_OWER ((AT91_REG *) 	0xFFFFF8A0) /* (PIOD) Output Write Enable Register*/
#define AT91C_PIOD_BSR  ((AT91_REG *) 	0xFFFFF874) /* (PIOD) Select B Register*/
#define AT91C_PIOD_IFDR ((AT91_REG *) 	0xFFFFF824) /* (PIOD) Input Filter Disable Register*/
#define AT91C_PIOD_DELAY3 ((AT91_REG *) 	0xFFFFF8C8) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_ABSR ((AT91_REG *) 	0xFFFFF878) /* (PIOD) AB Select Status Register*/
#define AT91C_PIOD_OER  ((AT91_REG *) 	0xFFFFF810) /* (PIOD) Output Enable Register*/
#define AT91C_PIOD_MDDR ((AT91_REG *) 	0xFFFFF854) /* (PIOD) Multi-driver Disable Register*/
#define AT91C_PIOD_IDR  ((AT91_REG *) 	0xFFFFF844) /* (PIOD) Interrupt Disable Register*/
#define AT91C_PIOD_IER  ((AT91_REG *) 	0xFFFFF840) /* (PIOD) Interrupt Enable Register*/
#define AT91C_PIOD_PPUDR ((AT91_REG *) 	0xFFFFF860) /* (PIOD) Pull-up Disable Register*/
#define AT91C_PIOD_VERSION ((AT91_REG *) 	0xFFFFF8FC) /* (PIOD) PIO Version Register*/
#define AT91C_PIOD_ISR  ((AT91_REG *) 	0xFFFFF84C) /* (PIOD) Interrupt Status Register*/
#define AT91C_PIOD_ODSR ((AT91_REG *) 	0xFFFFF838) /* (PIOD) Output Data Status Register*/
#define AT91C_PIOD_OSR  ((AT91_REG *) 	0xFFFFF818) /* (PIOD) Output Status Register*/
#define AT91C_PIOD_IFER ((AT91_REG *) 	0xFFFFF820) /* (PIOD) Input Filter Enable Register*/
#define AT91C_PIOD_SLEWRATE1 ((AT91_REG *) 	0xFFFFF8B0) /* (PIOD) PIO Slewrate Control Register*/
/* ========== Register definition for PIOE peripheral ========== */
#define AT91C_PIOE_ODSR ((AT91_REG *) 	0xFFFFFA38) /* (PIOE) Output Data Status Register*/
#define AT91C_PIOE_ABSR ((AT91_REG *) 	0xFFFFFA78) /* (PIOE) AB Select Status Register*/
#define AT91C_PIOE_PSR  ((AT91_REG *) 	0xFFFFFA08) /* (PIOE) PIO Status Register*/
#define AT91C_PIOE_PPUDR ((AT91_REG *) 	0xFFFFFA60) /* (PIOE) Pull-up Disable Register*/
#define AT91C_PIOE_OER  ((AT91_REG *) 	0xFFFFFA10) /* (PIOE) Output Enable Register*/
#define AT91C_PIOE_IFSR ((AT91_REG *) 	0xFFFFFA28) /* (PIOE) Input Filter Status Register*/
#define AT91C_PIOE_IFER ((AT91_REG *) 	0xFFFFFA20) /* (PIOE) Input Filter Enable Register*/
#define AT91C_PIOE_DELAY3 ((AT91_REG *) 	0xFFFFFAC8) /* (PIOE) PIO Delay Control Register*/
#define AT91C_PIOE_ODR  ((AT91_REG *) 	0xFFFFFA14) /* (PIOE) Output Disable Registerr*/
#define AT91C_PIOE_IDR  ((AT91_REG *) 	0xFFFFFA44) /* (PIOE) Interrupt Disable Register*/
#define AT91C_PIOE_DELAY1 ((AT91_REG *) 	0xFFFFFAC0) /* (PIOE) PIO Delay Control Register*/
#define AT91C_PIOE_OSR  ((AT91_REG *) 	0xFFFFFA18) /* (PIOE) Output Status Register*/
#define AT91C_PIOE_CODR ((AT91_REG *) 	0xFFFFFA34) /* (PIOE) Clear Output Data Register*/
#define AT91C_PIOE_VERSION ((AT91_REG *) 	0xFFFFFAFC) /* (PIOE) PIO Version Register*/
#define AT91C_PIOE_MDSR ((AT91_REG *) 	0xFFFFFA58) /* (PIOE) Multi-driver Status Register*/
#define AT91C_PIOE_PDR  ((AT91_REG *) 	0xFFFFFA04) /* (PIOE) PIO Disable Register*/
#define AT91C_PIOE_IER  ((AT91_REG *) 	0xFFFFFA40) /* (PIOE) Interrupt Enable Register*/
#define AT91C_PIOE_OWSR ((AT91_REG *) 	0xFFFFFAA8) /* (PIOE) Output Write Status Register*/
#define AT91C_PIOE_BSR  ((AT91_REG *) 	0xFFFFFA74) /* (PIOE) Select B Register*/
#define AT91C_PIOE_SLEWRATE1 ((AT91_REG *) 	0xFFFFFAB0) /* (PIOE) PIO Slewrate Control Register*/
#define AT91C_PIOE_DELAY4 ((AT91_REG *) 	0xFFFFFACC) /* (PIOE) PIO Delay Control Register*/
#define AT91C_PIOE_PER  ((AT91_REG *) 	0xFFFFFA00) /* (PIOE) PIO Enable Register*/
#define AT91C_PIOE_OWDR ((AT91_REG *) 	0xFFFFFAA4) /* (PIOE) Output Write Disable Register*/
#define AT91C_PIOE_IFDR ((AT91_REG *) 	0xFFFFFA24) /* (PIOE) Input Filter Disable Register*/
#define AT91C_PIOE_PPUSR ((AT91_REG *) 	0xFFFFFA68) /* (PIOE) Pull-up Status Register*/
#define AT91C_PIOE_PDSR ((AT91_REG *) 	0xFFFFFA3C) /* (PIOE) Pin Data Status Register*/
#define AT91C_PIOE_PPUER ((AT91_REG *) 	0xFFFFFA64) /* (PIOE) Pull-up Enable Register*/
#define AT91C_PIOE_MDDR ((AT91_REG *) 	0xFFFFFA54) /* (PIOE) Multi-driver Disable Register*/
#define AT91C_PIOE_ISR  ((AT91_REG *) 	0xFFFFFA4C) /* (PIOE) Interrupt Status Register*/
#define AT91C_PIOE_DELAY2 ((AT91_REG *) 	0xFFFFFAC4) /* (PIOE) PIO Delay Control Register*/
#define AT91C_PIOE_SODR ((AT91_REG *) 	0xFFFFFA30) /* (PIOE) Set Output Data Register*/
#define AT91C_PIOE_ASR  ((AT91_REG *) 	0xFFFFFA70) /* (PIOE) Select A Register*/
#define AT91C_PIOE_IMR  ((AT91_REG *) 	0xFFFFFA48) /* (PIOE) Interrupt Mask Register*/
#define AT91C_PIOE_OWER ((AT91_REG *) 	0xFFFFFAA0) /* (PIOE) Output Write Enable Register*/
#define AT91C_PIOE_MDER ((AT91_REG *) 	0xFFFFFA50) /* (PIOE) Multi-driver Enable Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_ADDRSIZE ((AT91_REG *) 	0xFFFFFCEC) /* (PMC) */
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock 0 Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (PMC) PLL A Register*/
#define AT91C_PMC_NAME2 ((AT91_REG *) 	0xFFFFFCF4) /* (PMC) */
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) /* (PMC) Main Clock  Frequency Register*/
#define AT91C_PMC_FEATURES ((AT91_REG *) 	0xFFFFFCF8) /* (PMC) */
#define AT91C_PMC_PLLICPR ((AT91_REG *) 	0xFFFFFC80) /* (PMC) PLL Charge Pump Current Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_UCKR  ((AT91_REG *) 	0xFFFFFC1C) /* (PMC) UTMI Clock Configuration Register*/
#define AT91C_PMC_USB   ((AT91_REG *) 	0xFFFFFC38) /* (PMC) USB clock register*/
#define AT91C_PMC_MOR   ((AT91_REG *) 	0xFFFFFC20) /* (PMC) Main Oscillator Register*/
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) /* (PMC) Interrupt Disable Register*/
#define AT91C_PMC_NAME1 ((AT91_REG *) 	0xFFFFFCF0) /* (PMC) */
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) /* (PMC) System Clock Disable Register*/
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) /* (PMC) Peripheral Clock Status Register*/
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) /* (PMC) System Clock Enable Register*/
#define AT91C_PMC_VERSION ((AT91_REG *) 	0xFFFFFCFC) /* (PMC) */
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) /* (PMC) Status Register*/
/* ========== Register definition for CKGR peripheral ========== */
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) /* (CKGR) Main Oscillator Register*/
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) /* (CKGR) Main Clock  Frequency Register*/
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (CKGR) PLL A Register*/
#define AT91C_CKGR_UCKR ((AT91_REG *) 	0xFFFFFC1C) /* (CKGR) UTMI Clock Configuration Register*/
/* ========== Register definition for RSTC peripheral ========== */
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0xFFFFFD00) /* (RSTC) Reset Control Register*/
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0xFFFFFD08) /* (RSTC) Reset Mode Register*/
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0xFFFFFD04) /* (RSTC) Reset Status Register*/
/* ========== Register definition for SHDWC peripheral ========== */
#define AT91C_SHDWC_SHSR ((AT91_REG *) 	0xFFFFFD18) /* (SHDWC) Shut Down Status Register*/
#define AT91C_SHDWC_SHMR ((AT91_REG *) 	0xFFFFFD14) /* (SHDWC) Shut Down Mode Register*/
#define AT91C_SHDWC_SHCR ((AT91_REG *) 	0xFFFFFD10) /* (SHDWC) Shut Down Control Register*/
/* ========== Register definition for RTTC peripheral ========== */
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0xFFFFFD2C) /* (RTTC) Real-time Status Register*/
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0xFFFFFD20) /* (RTTC) Real-time Mode Register*/
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0xFFFFFD28) /* (RTTC) Real-time Value Register*/
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0xFFFFFD24) /* (RTTC) Real-time Alarm Register*/
/* ========== Register definition for PITC peripheral ========== */
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) /* (PITC) Period Interval Value Register*/
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) /* (PITC) Period Interval Status Register*/
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) /* (PITC) Period Interval Image Register*/
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) /* (PITC) Period Interval Mode Register*/
/* ========== Register definition for WDTC peripheral ========== */
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) /* (WDTC) Watchdog Control Register*/
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) /* (WDTC) Watchdog Status Register*/
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) /* (WDTC) Watchdog Mode Register*/
/* ========== Register definition for RTC peripheral ========== */
#define AT91C_RTC_IDR   ((AT91_REG *) 	0xFFFFFDD4) /* (RTC) Interrupt Disable Register*/
#define AT91C_RTC_SR    ((AT91_REG *) 	0xFFFFFDC8) /* (RTC) Status Register*/
#define AT91C_RTC_MR    ((AT91_REG *) 	0xFFFFFDB4) /* (RTC) Mode Register*/
#define AT91C_RTC_IER   ((AT91_REG *) 	0xFFFFFDD0) /* (RTC) Interrupt Enable Register*/
#define AT91C_RTC_TIMALR ((AT91_REG *) 	0xFFFFFDC0) /* (RTC) Time Alarm Register*/
#define AT91C_RTC_CALALR ((AT91_REG *) 	0xFFFFFDC4) /* (RTC) Calendar Alarm Register*/
#define AT91C_RTC_CR    ((AT91_REG *) 	0xFFFFFDB0) /* (RTC) Control Register*/
#define AT91C_RTC_TIMR  ((AT91_REG *) 	0xFFFFFDB8) /* (RTC) Time Register*/
#define AT91C_RTC_CALR  ((AT91_REG *) 	0xFFFFFDBC) /* (RTC) Calendar Register*/
#define AT91C_RTC_VER   ((AT91_REG *) 	0xFFFFFDDC) /* (RTC) Valid Entry Register*/
#define AT91C_RTC_SCCR  ((AT91_REG *) 	0xFFFFFDCC) /* (RTC) Status Clear Command Register*/
#define AT91C_RTC_IMR   ((AT91_REG *) 	0xFFFFFDD8) /* (RTC) Interrupt Mask Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFF7C024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFF7C02C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFF7C000) /* (TC0) Channel Control Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFF7C018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFF7C010) /* (TC0) Counter Value*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFF7C020) /* (TC0) Status Register*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFF7C004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFF7C014) /* (TC0) Register A*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFF7C01C) /* (TC0) Register C*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFF7C028) /* (TC0) Interrupt Disable Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFF7C064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFF7C060) /* (TC1) Status Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFF7C05C) /* (TC1) Register C*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFF7C050) /* (TC1) Counter Value*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFF7C054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFF7C044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFF7C068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFF7C058) /* (TC1) Register B*/
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFF7C06C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFF7C040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFF7C0A0) /* (TC2) Status Register*/
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFF7C0AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFF7C0A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFF7C090) /* (TC2) Counter Value*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFF7C098) /* (TC2) Register B*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFF7C080) /* (TC2) Channel Control Register*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFF7C084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFF7C094) /* (TC2) Register A*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFF7C0A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFF7C09C) /* (TC2) Register C*/
/* ========== Register definition for TC3 peripheral ========== */
#define AT91C_TC3_SR    ((AT91_REG *) 	0xFFFD4020) /* (TC3) Status Register*/
#define AT91C_TC3_RC    ((AT91_REG *) 	0xFFFD401C) /* (TC3) Register C*/
#define AT91C_TC3_IER   ((AT91_REG *) 	0xFFFD4024) /* (TC3) Interrupt Enable Register*/
#define AT91C_TC3_CV    ((AT91_REG *) 	0xFFFD4010) /* (TC3) Counter Value*/
#define AT91C_TC3_IDR   ((AT91_REG *) 	0xFFFD4028) /* (TC3) Interrupt Disable Register*/
#define AT91C_TC3_IMR   ((AT91_REG *) 	0xFFFD402C) /* (TC3) Interrupt Mask Register*/
#define AT91C_TC3_CMR   ((AT91_REG *) 	0xFFFD4004) /* (TC3) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC3_RB    ((AT91_REG *) 	0xFFFD4018) /* (TC3) Register B*/
#define AT91C_TC3_CCR   ((AT91_REG *) 	0xFFFD4000) /* (TC3) Channel Control Register*/
#define AT91C_TC3_RA    ((AT91_REG *) 	0xFFFD4014) /* (TC3) Register A*/
/* ========== Register definition for TC4 peripheral ========== */
#define AT91C_TC4_CV    ((AT91_REG *) 	0xFFFD4050) /* (TC4) Counter Value*/
#define AT91C_TC4_RA    ((AT91_REG *) 	0xFFFD4054) /* (TC4) Register A*/
#define AT91C_TC4_IDR   ((AT91_REG *) 	0xFFFD4068) /* (TC4) Interrupt Disable Register*/
#define AT91C_TC4_SR    ((AT91_REG *) 	0xFFFD4060) /* (TC4) Status Register*/
#define AT91C_TC4_CMR   ((AT91_REG *) 	0xFFFD4044) /* (TC4) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC4_CCR   ((AT91_REG *) 	0xFFFD4040) /* (TC4) Channel Control Register*/
#define AT91C_TC4_RB    ((AT91_REG *) 	0xFFFD4058) /* (TC4) Register B*/
#define AT91C_TC4_RC    ((AT91_REG *) 	0xFFFD405C) /* (TC4) Register C*/
#define AT91C_TC4_IER   ((AT91_REG *) 	0xFFFD4064) /* (TC4) Interrupt Enable Register*/
#define AT91C_TC4_IMR   ((AT91_REG *) 	0xFFFD406C) /* (TC4) Interrupt Mask Register*/
/* ========== Register definition for TC5 peripheral ========== */
#define AT91C_TC5_IER   ((AT91_REG *) 	0xFFFD40A4) /* (TC5) Interrupt Enable Register*/
#define AT91C_TC5_IDR   ((AT91_REG *) 	0xFFFD40A8) /* (TC5) Interrupt Disable Register*/
#define AT91C_TC5_RA    ((AT91_REG *) 	0xFFFD4094) /* (TC5) Register A*/
#define AT91C_TC5_RB    ((AT91_REG *) 	0xFFFD4098) /* (TC5) Register B*/
#define AT91C_TC5_CCR   ((AT91_REG *) 	0xFFFD4080) /* (TC5) Channel Control Register*/
#define AT91C_TC5_SR    ((AT91_REG *) 	0xFFFD40A0) /* (TC5) Status Register*/
#define AT91C_TC5_CV    ((AT91_REG *) 	0xFFFD4090) /* (TC5) Counter Value*/
#define AT91C_TC5_RC    ((AT91_REG *) 	0xFFFD409C) /* (TC5) Register C*/
#define AT91C_TC5_IMR   ((AT91_REG *) 	0xFFFD40AC) /* (TC5) Interrupt Mask Register*/
#define AT91C_TC5_CMR   ((AT91_REG *) 	0xFFFD4084) /* (TC5) Channel Mode Register (Capture Mode / Waveform Mode)*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFF7C0C0) /* (TCB0) TC Block Control Register*/
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFF7C0C4) /* (TCB0) TC Block Mode Register*/
/* ========== Register definition for TCB1 peripheral ========== */
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0xFFFD40C4) /* (TCB1) TC Block Mode Register*/
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0xFFFD40C0) /* (TCB1) TC Block Control Register*/
/* ========== Register definition for MCI0 peripheral ========== */
#define AT91C_MCI0_IMR  ((AT91_REG *) 	0xFFF8004C) /* (MCI0) MCI Interrupt Mask Register*/
#define AT91C_MCI0_MR   ((AT91_REG *) 	0xFFF80004) /* (MCI0) MCI Mode Register*/
#define AT91C_MCI0_CR   ((AT91_REG *) 	0xFFF80000) /* (MCI0) MCI Control Register*/
#define AT91C_MCI0_IER  ((AT91_REG *) 	0xFFF80044) /* (MCI0) MCI Interrupt Enable Register*/
#define AT91C_MCI0_FIFO ((AT91_REG *) 	0xFFF80200) /* (MCI0) MCI FIFO Aperture Register*/
#define AT91C_MCI0_DTOR ((AT91_REG *) 	0xFFF80008) /* (MCI0) MCI Data Timeout Register*/
#define AT91C_MCI0_SDCR ((AT91_REG *) 	0xFFF8000C) /* (MCI0) MCI SD/SDIO Card Register*/
#define AT91C_MCI0_BLKR ((AT91_REG *) 	0xFFF80018) /* (MCI0) MCI Block Register*/
#define AT91C_MCI0_VR   ((AT91_REG *) 	0xFFF800FC) /* (MCI0) MCI Version Register*/
#define AT91C_MCI0_WPSR ((AT91_REG *) 	0xFFF800E8) /* (MCI0) MCI Write Protection Status Register*/
#define AT91C_MCI0_CMDR ((AT91_REG *) 	0xFFF80014) /* (MCI0) MCI Command Register*/
#define AT91C_MCI0_CSTOR ((AT91_REG *) 	0xFFF8001C) /* (MCI0) MCI Completion Signal Timeout Register*/
#define AT91C_MCI0_DMA  ((AT91_REG *) 	0xFFF80050) /* (MCI0) MCI DMA Configuration Register*/
#define AT91C_MCI0_RDR  ((AT91_REG *) 	0xFFF80030) /* (MCI0) MCI Receive Data Register*/
#define AT91C_MCI0_SR   ((AT91_REG *) 	0xFFF80040) /* (MCI0) MCI Status Register*/
#define AT91C_MCI0_TDR  ((AT91_REG *) 	0xFFF80034) /* (MCI0) MCI Transmit Data Register*/
#define AT91C_MCI0_CFG  ((AT91_REG *) 	0xFFF80054) /* (MCI0) MCI Configuration Register*/
#define AT91C_MCI0_ARGR ((AT91_REG *) 	0xFFF80010) /* (MCI0) MCI Argument Register*/
#define AT91C_MCI0_RSPR ((AT91_REG *) 	0xFFF80020) /* (MCI0) MCI Response Register*/
#define AT91C_MCI0_WPCR ((AT91_REG *) 	0xFFF800E4) /* (MCI0) MCI Write Protection Control Register*/
#define AT91C_MCI0_IDR  ((AT91_REG *) 	0xFFF80048) /* (MCI0) MCI Interrupt Disable Register*/
/* ========== Register definition for MCI1 peripheral ========== */
#define AT91C_MCI1_IDR  ((AT91_REG *) 	0xFFFD0048) /* (MCI1) MCI Interrupt Disable Register*/
#define AT91C_MCI1_MR   ((AT91_REG *) 	0xFFFD0004) /* (MCI1) MCI Mode Register*/
#define AT91C_MCI1_SR   ((AT91_REG *) 	0xFFFD0040) /* (MCI1) MCI Status Register*/
#define AT91C_MCI1_DTOR ((AT91_REG *) 	0xFFFD0008) /* (MCI1) MCI Data Timeout Register*/
#define AT91C_MCI1_WPCR ((AT91_REG *) 	0xFFFD00E4) /* (MCI1) MCI Write Protection Control Register*/
#define AT91C_MCI1_ARGR ((AT91_REG *) 	0xFFFD0010) /* (MCI1) MCI Argument Register*/
#define AT91C_MCI1_FIFO ((AT91_REG *) 	0xFFFD0200) /* (MCI1) MCI FIFO Aperture Register*/
