una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_MCI1_IER  ((AT91_REG *) 	0xFFFD0044) /* (MCI1) MCI Interrupt Enable Register*/
#define AT91C_MCI1_SDCR ((AT91_REG *) 	0xFFFD000C) /* (MCI1) MCI SD/SDIO Card Register*/
#define AT91C_MCI1_CR   ((AT91_REG *) 	0xFFFD0000) /* (MCI1) MCI Control Register*/
#define AT91C_MCI1_CSTOR ((AT91_REG *) 	0xFFFD001C) /* (MCI1) MCI Completion Signal Timeout Register*/
#define AT91C_MCI1_RSPR ((AT91_REG *) 	0xFFFD0020) /* (MCI1) MCI Response Register*/
#define AT91C_MCI1_IMR  ((AT91_REG *) 	0xFFFD004C) /* (MCI1) MCI Interrupt Mask Register*/
#define AT91C_MCI1_DMA  ((AT91_REG *) 	0xFFFD0050) /* (MCI1) MCI DMA Configuration Register*/
#define AT91C_MCI1_BLKR ((AT91_REG *) 	0xFFFD0018) /* (MCI1) MCI Block Register*/
#define AT91C_MCI1_RDR  ((AT91_REG *) 	0xFFFD0030) /* (MCI1) MCI Receive Data Register*/
#define AT91C_MCI1_CFG  ((AT91_REG *) 	0xFFFD0054) /* (MCI1) MCI Configuration Register*/
#define AT91C_MCI1_WPSR ((AT91_REG *) 	0xFFFD00E8) /* (MCI1) MCI Write Protection Status Register*/
#define AT91C_MCI1_CMDR ((AT91_REG *) 	0xFFFD0014) /* (MCI1) MCI Command Register*/
#define AT91C_MCI1_TDR  ((AT91_REG *) 	0xFFFD0034) /* (MCI1) MCI Transmit Data Register*/
#define AT91C_MCI1_VR   ((AT91_REG *) 	0xFFFD00FC) /* (MCI1) MCI Version Register*/
/* ========== Register definition for TWI0 peripheral ========== */
#define AT91C_TWI0_RHR  ((AT91_REG *) 	0xFFF84030) /* (TWI0) Receive Holding Register*/
#define AT91C_TWI0_IMR  ((AT91_REG *) 	0xFFF8402C) /* (TWI0) Interrupt Mask Register*/
#define AT91C_TWI0_SR   ((AT91_REG *) 	0xFFF84020) /* (TWI0) Status Register*/
#define AT91C_TWI0_IADR ((AT91_REG *) 	0xFFF8400C) /* (TWI0) Internal Address Register*/
#define AT91C_TWI0_IDR  ((AT91_REG *) 	0xFFF84028) /* (TWI0) Interrupt Disable Register*/
#define AT91C_TWI0_CWGR ((AT91_REG *) 	0xFFF84010) /* (TWI0) Clock Waveform Generator Register*/
#define AT91C_TWI0_IER  ((AT91_REG *) 	0xFFF84024) /* (TWI0) Interrupt Enable Register*/
#define AT91C_TWI0_THR  ((AT91_REG *) 	0xFFF84034) /* (TWI0) Transmit Holding Register*/
#define AT91C_TWI0_CR   ((AT91_REG *) 	0xFFF84000) /* (TWI0) Control Register*/
#define AT91C_TWI0_MMR  ((AT91_REG *) 	0xFFF84004) /* (TWI0) Master Mode Register*/
/* ========== Register definition for TWI1 peripheral ========== */
#define AT91C_TWI1_IDR  ((AT91_REG *) 	0xFFF88028) /* (TWI1) Interrupt Disable Register*/
#define AT91C_TWI1_RHR  ((AT91_REG *) 	0xFFF88030) /* (TWI1) Receive Holding Register*/
#define AT91C_TWI1_IMR  ((AT91_REG *) 	0xFFF8802C) /* (TWI1) Interrupt Mask Register*/
#define AT91C_TWI1_THR  ((AT91_REG *) 	0xFFF88034) /* (TWI1) Transmit Holding Register*/
#define AT91C_TWI1_IER  ((AT91_REG *) 	0xFFF88024) /* (TWI1) Interrupt Enable Register*/
#define AT91C_TWI1_IADR ((AT91_REG *) 	0xFFF8800C) /* (TWI1) Internal Address Register*/
#define AT91C_TWI1_MMR  ((AT91_REG *) 	0xFFF88004) /* (TWI1) Master Mode Register*/
#define AT91C_TWI1_CR   ((AT91_REG *) 	0xFFF88000) /* (TWI1) Control Register*/
#define AT91C_TWI1_SR   ((AT91_REG *) 	0xFFF88020) /* (TWI1) Status Register*/
#define AT91C_TWI1_CWGR ((AT91_REG *) 	0xFFF88010) /* (TWI1) Clock Waveform Generator Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFF8C118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFF8C124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFF8C120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFF8C114) /* (PDC_US0) Receive Next Counter Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFF8C104) /* (PDC_US0) Receive Counter Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFF8C11C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFF8C10C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFF8C110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFF8C100) /* (PDC_US0) Receive Pointer Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFF8C108) /* (PDC_US0) Transmit Pointer Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFF8C024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_MAN   ((AT91_REG *) 	0xFFF8C050) /* (US0) Manchester Encoder Decoder Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFF8C044) /* (US0) Nb Errors Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFF8C01C) /* (US0) Transmitter Holding Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFF8C004) /* (US0) Mode Register*/
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFF8C018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFF8C014) /* (US0) Channel Status Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFF8C010) /* (US0) Interrupt Mask Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFF8C00C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFF8C040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFF8C000) /* (US0) Control Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFF8C008) /* (US0) Interrupt Enable Register*/
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFF8C028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFF8C020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFF8C04C) /* (US0) IRDA_FILTER Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFF90120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFF9011C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFF90104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFF90100) /* (PDC_US1) Receive Pointer Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFF90108) /* (PDC_US1) Transmit Pointer Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFF9010C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFF90110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFF90118) /* (PDC_US1) Transmit Next Pointer Register*/
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFF90114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFF90124) /* (PDC_US1) PDC Transfer Status Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFF90044) /* (US1) Nb Errors Register*/
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFF90018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFF90024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFF90008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFF9004C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_MAN   ((AT91_REG *) 	0xFFF90050) /* (US1) Manchester Encoder Decoder Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFF90000) /* (US1) Control Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFF90010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFF90028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFF90004) /* (US1) Mode Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFF9000C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFF90040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFF90014) /* (US1) Channel Status Register*/
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFF9001C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFF90020) /* (US1) Baud Rate Generator Register*/
/* ========== Register definition for PDC_US2 peripheral ========== */
#define AT91C_US2_RNCR  ((AT91_REG *) 	0xFFF94114) /* (PDC_US2) Receive Next Counter Register*/
#define AT91C_US2_PTCR  ((AT91_REG *) 	0xFFF94120) /* (PDC_US2) PDC Transfer Control Register*/
#define AT91C_US2_TNPR  ((AT91_REG *) 	0xFFF94118) /* (PDC_US2) Transmit Next Pointer Register*/
#define AT91C_US2_TNCR  ((AT91_REG *) 	0xFFF9411C) /* (PDC_US2) Transmit Next Counter Register*/
#define AT91C_US2_TPR   ((AT91_REG *) 	0xFFF94108) /* (PDC_US2) Transmit Pointer Register*/
#define AT91C_US2_RCR   ((AT91_REG *) 	0xFFF94104) /* (PDC_US2) Receive Counter Register*/
#define AT91C_US2_PTSR  ((AT91_REG *) 	0xFFF94124) /* (PDC_US2) PDC Transfer Status Register*/
#define AT91C_US2_TCR   ((AT91_REG *) 	0xFFF9410C) /* (PDC_US2) Transmit Counter Register*/
#define AT91C_US2_RPR   ((AT91_REG *) 	0xFFF94100) /* (PDC_US2) Receive Pointer Register*/
#define AT91C_US2_RNPR  ((AT91_REG *) 	0xFFF94110) /* (PDC_US2) Receive Next Pointer Register*/
/* ========== Register definition for US2 peripheral ========== */
#define AT91C_US2_TTGR  ((AT91_REG *) 	0xFFF94028) /* (US2) Transmitter Time-guard Register*/
#define AT91C_US2_RHR   ((AT91_REG *) 	0xFFF94018) /* (US2) Receiver Holding Register*/
#define AT91C_US2_IMR   ((AT91_REG *) 	0xFFF94010) /* (US2) Interrupt Mask Register*/
#define AT91C_US2_IER   ((AT91_REG *) 	0xFFF94008) /* (US2) Interrupt Enable Register*/
#define AT91C_US2_NER   ((AT91_REG *) 	0xFFF94044) /* (US2) Nb Errors Register*/
#define AT91C_US2_CR    ((AT91_REG *) 	0xFFF94000) /* (US2) Control Register*/
#define AT91C_US2_FIDI  ((AT91_REG *) 	0xFFF94040) /* (US2) FI_DI_Ratio Register*/
#define AT91C_US2_MR    ((AT91_REG *) 	0xFFF94004) /* (US2) Mode Register*/
#define AT91C_US2_MAN   ((AT91_REG *) 	0xFFF94050) /* (US2) Manchester Encoder Decoder Register*/
#define AT91C_US2_IDR   ((AT91_REG *) 	0xFFF9400C) /* (US2) Interrupt Disable Register*/
#define AT91C_US2_THR   ((AT91_REG *) 	0xFFF9401C) /* (US2) Transmitter Holding Register*/
#define AT91C_US2_IF    ((AT91_REG *) 	0xFFF9404C) /* (US2) IRDA_FILTER Register*/
#define AT91C_US2_BRGR  ((AT91_REG *) 	0xFFF94020) /* (US2) Baud Rate Generator Register*/
#define AT91C_US2_CSR   ((AT91_REG *) 	0xFFF94014) /* (US2) Channel Status Register*/
#define AT91C_US2_RTOR  ((AT91_REG *) 	0xFFF94024) /* (US2) Receiver Time-out Register*/
/* ========== Register definition for PDC_US3 peripheral ========== */
#define AT91C_US3_PTSR  ((AT91_REG *) 	0xFFF98124) /* (PDC_US3) PDC Transfer Status Register*/
#define AT91C_US3_TCR   ((AT91_REG *) 	0xFFF9810C) /* (PDC_US3) Transmit Counter Register*/
#define AT91C_US3_RNPR  ((AT91_REG *) 	0xFFF98110) /* (PDC_US3) Receive Next Pointer Register*/
#define AT91C_US3_RNCR  ((AT91_REG *) 	0xFFF98114) /* (PDC_US3) Receive Next Counter Register*/
#define AT91C_US3_TNPR  ((AT91_REG *) 	0xFFF98118) /* (PDC_US3) Transmit Next Pointer Register*/
#define AT91C_US3_RPR   ((AT91_REG *) 	0xFFF98100) /* (PDC_US3) Receive Pointer Register*/
#define AT91C_US3_TPR   ((AT91_REG *) 	0xFFF98108) /* (PDC_US3) Transmit Pointer Register*/
#define AT91C_US3_RCR   ((AT91_REG *) 	0xFFF98104) /* (PDC_US3) Receive Counter Register*/
#define AT91C_US3_TNCR  ((AT91_REG *) 	0xFFF9811C) /* (PDC_US3) Transmit Next Counter Register*/
#define AT91C_US3_PTCR  ((AT91_REG *) 	0xFFF98120) /* (PDC_US3) PDC Transfer Control Register*/
/* ========== Register definition for US3 peripheral ========== */
#define AT91C_US3_CSR   ((AT91_REG *) 	0xFFF98014) /* (US3) Channel Status Register*/
#define AT91C_US3_BRGR  ((AT91_REG *) 	0xFFF98020) /* (US3) Baud Rate Generator Register*/
#define AT91C_US3_TTGR  ((AT91_REG *) 	0xFFF98028) /* (US3) Transmitter Time-guard Register*/
#define AT91C_US3_IER   ((AT91_REG *) 	0xFFF98008) /* (US3) Interrupt Enable Register*/
#define AT91C_US3_RTOR  ((AT91_REG *) 	0xFFF98024) /* (US3) Receiver Time-out Register*/
#define AT91C_US3_MR    ((AT91_REG *) 	0xFFF98004) /* (US3) Mode Register*/
#define AT91C_US3_IF    ((AT91_REG *) 	0xFFF9804C) /* (US3) IRDA_FILTER Register*/
#define AT91C_US3_MAN   ((AT91_REG *) 	0xFFF98050) /* (US3) Manchester Encoder Decoder Register*/
#define AT91C_US3_NER   ((AT91_REG *) 	0xFFF98044) /* (US3) Nb Errors Register*/
#define AT91C_US3_FIDI  ((AT91_REG *) 	0xFFF98040) /* (US3) FI_DI_Ratio Register*/
#define AT91C_US3_CR    ((AT91_REG *) 	0xFFF98000) /* (US3) Control Register*/
#define AT91C_US3_IDR   ((AT91_REG *) 	0xFFF9800C) /* (US3) Interrupt Disable Register*/
#define AT91C_US3_IMR   ((AT91_REG *) 	0xFFF98010) /* (US3) Interrupt Mask Register*/
#define AT91C_US3_THR   ((AT91_REG *) 	0xFFF9801C) /* (US3) Transmitter Holding Register*/
#define AT91C_US3_RHR   ((AT91_REG *) 	0xFFF98018) /* (US3) Receiver Holding Register*/
/* ========== Register definition for PDC_SSC0 peripheral ========== */
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0xFFF9C118) /* (PDC_SSC0) Transmit Next Pointer Register*/
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0xFFF9C124) /* (PDC_SSC0) PDC Transfer Status Register*/
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0xFFF9C11C) /* (PDC_SSC0) Transmit Next Counter Register*/
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0xFFF9C114) /* (PDC_SSC0) Receive Next Counter Register*/
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0xFFF9C108) /* (PDC_SSC0) Transmit Pointer Register*/
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0xFFF9C104) /* (PDC_SSC0) Receive Counter Register*/
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0xFFF9C120) /* (PDC_SSC0) PDC Transfer Control Register*/
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0xFFF9C110) /* (PDC_SSC0) Receive Next Pointer Register*/
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0xFFF9C10C) /* (PDC_SSC0) Transmit Counter Register*/
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0xFFF9C100) /* (PDC_SSC0) Receive Pointer Register*/
/* ========== Register definition for SSC0 peripheral ========== */
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFF9C004) /* (SSC0) Clock Mode Register*/
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFF9C040) /* (SSC0) Status Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFF9C034) /* (SSC0) Transmit Sync Holding Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFF9C018) /* (SSC0) Transmit Clock Mode Register*/
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFF9C04C) /* (SSC0) Interrupt Mask Register*/
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0xFFF9C048) /* (SSC0) Interrupt Disable Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFF9C010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFF9C044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFF9C030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFF9C000) /* (SSC0) Control Register*/
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFF9C020) /* (SSC0) Receive Holding Register*/
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFF9C024) /* (SSC0) Transmit Holding Register*/
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFF9C014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFF9C01C) /* (SSC0) Transmit Frame Mode Register*/
/* ========== Register definition for PDC_SSC1 peripheral ========== */
#define AT91C_SSC1_RNPR ((AT91_REG *) 	0xFFFA0110) /* (PDC_SSC1) Receive Next Pointer Register*/
#define AT91C_SSC1_TCR  ((AT91_REG *) 	0xFFFA010C) /* (PDC_SSC1) Transmit Counter Register*/
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFFA011C) /* (PDC_SSC1) Transmit Next Counter Register*/
#define AT91C_SSC1_RCR  ((AT91_REG *) 	0xFFFA0104) /* (PDC_SSC1) Receive Counter Register*/
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFFA0114) /* (PDC_SSC1) Receive Next Counter Register*/
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFFA0120) /* (PDC_SSC1) PDC Transfer Control Register*/
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFFA0108) /* (PDC_SSC1) Transmit Pointer Register*/
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFFA0100) /* (PDC_SSC1) Receive Pointer Register*/
#define AT91C_SSC1_PTSR ((AT91_REG *) 	0xFFFA0124) /* (PDC_SSC1) PDC Transfer Status Register*/
#define AT91C_SSC1_TNPR ((AT91_REG *) 	0xFFFA0118) /* (PDC_SSC1) Transmit Next Pointer Register*/
/* ========== Register definition for SSC1 peripheral ========== */
#define AT91C_SSC1_SR   ((AT91_REG *) 	0xFFFA0040) /* (SSC1) Status Register*/
#define AT91C_SSC1_RHR  ((AT91_REG *) 	0xFFFA0020) /* (SSC1) Receive Holding Register*/
#define AT91C_SSC1_TFMR ((AT91_REG *) 	0xFFFA001C) /* (SSC1) Transmit Frame Mode Register*/
#define AT91C_SSC1_TCMR ((AT91_REG *) 	0xFFFA0018) /* (SSC1) Transmit Clock Mode Register*/
#define AT91C_SSC1_CR   ((AT91_REG *) 	0xFFFA0000) /* (SSC1) Control Register*/
#define AT91C_SSC1_RSHR ((AT91_REG *) 	0xFFFA0030) /* (SSC1) Receive Sync Holding Register*/
#define AT91C_SSC1_CMR  ((AT91_REG *) 	0xFFFA0004) /* (SSC1) Clock Mode Register*/
#define AT91C_SSC1_IER  ((AT91_REG *) 	0xFFFA0044) /* (SSC1) Interrupt Enable Register*/
#define AT91C_SSC1_THR  ((AT91_REG *) 	0xFFFA0024) /* (SSC1) Transmit Holding Register*/
#define AT91C_SSC1_IMR  ((AT91_REG *) 	0xFFFA004C) /* (SSC1) Interrupt Mask Register*/
#define AT91C_SSC1_TSHR ((AT91_REG *) 	0xFFFA0034) /* (SSC1) Transmit Sync Holding Register*/
#define AT91C_SSC1_RFMR ((AT91_REG *) 	0xFFFA0014) /* (SSC1) Receive Frame Mode Register*/
#define AT91C_SSC1_IDR  ((AT91_REG *) 	0xFFFA0048) /* (SSC1) Interrupt Disable Register*/
#define AT91C_SSC1_RCMR ((AT91_REG *) 	0xFFFA0010) /* (SSC1) Receive Clock ModeRegister*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFB820C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFB8208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFB8210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFB8204) /* (PWMC_CH0) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFB8200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFB8214) /* (PWMC_CH0) Reserved*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFB822C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFB8224) /* (PWMC_CH1) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFB8220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFB8228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFB8234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFB8230) /* (PWMC_CH1) Channel Update Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFB8250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFB8240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFB8254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFB8248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFB8244) /* (PWMC_CH2) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFB824C) /* (PWMC_CH2) Channel Counter Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFB8268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFB8274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFB8270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFB8264) /* (PWMC_CH3) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFB826C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFB8260) /* (PWMC_CH3) Channel Mode Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFB8014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFB8000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFB80FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFB8018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFB800C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFB801C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFB8004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFB8010) /* (PWMC) PWMC Interrupt Enable Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFB8008) /* (PWMC) PWMC Disable Register*/
/* ========== Register definition for PDC_SPI0 peripheral ========== */
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFA4108) /* (PDC_SPI0) Transmit Pointer Register*/
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFA4120) /* (PDC_SPI0) PDC Transfer Control Register*/
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFA4110) /* (PDC_SPI0) Receive Next Pointer Register*/
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFA411C) /* (PDC_SPI0) Transmit Next Counter Register*/
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFA410C) /* (PDC_SPI0) Transmit Counter Register*/
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFA4104) /* (PDC_SPI0) Receive Counter Register*/
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFA4114) /* (PDC_SPI0) Receive Next Counter Register*/
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFA4118) /* (PDC_SPI0) Transmit Next Pointer Register*/
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFA4100) /* (PDC_SPI0) Receive Pointer Register*/
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFA4124) /* (PDC_SPI0) PDC Transfer Status Register*/
/* ========== Register definition for PDC_SPI1 peripheral ========== */
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFA8114) /* (PDC_SPI1) Receive Next Counter Register*/
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFA810C) /* (PDC_SPI1) Transmit Counter Register*/
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFA8104) /* (PDC_SPI1) Receive Counter Register*/
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFA8118) /* (PDC_SPI1) Transmit Next Pointer Register*/
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFA8110) /* (PDC_SPI1) Receive Next Pointer Register*/
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFA8100) /* (PDC_SPI1) Receive Pointer Register*/
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFA811C) /* (PDC_SPI1) Transmit Next Counter Register*/
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFA8108) /* (PDC_SPI1) Transmit Pointer Register*/
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFA8124) /* (PDC_SPI1) PDC Transfer Status Register*/
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFA8120) /* (PDC_SPI1) PDC Transfer Control Register*/
/* ========== Register definition for SPI0 peripheral ========== */
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFA4004) /* (SPI0) Mode Register*/
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFA4008) /* (SPI0) Receive Data Register*/
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFA4000) /* (SPI0) Control Register*/
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFA4014) /* (SPI0) Interrupt Enable Register*/
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFA400C) /* (SPI0) Transmit Data Register*/
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFA4018) /* (SPI0) Interrupt Disable Register*/
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFA4030) /* (SPI0) Chip Select Register*/
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFA4010) /* (SPI0) Status Register*/
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFA401C) /* (SPI0) Interrupt Mask Register*/
/* ========== Register definition for SPI1 peripheral ========== */
