una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFA8030) /* (SPI1) Chip Select Register*/
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFA8014) /* (SPI1) Interrupt Enable Register*/
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFA8008) /* (SPI1) Receive Data Register*/
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFA8018) /* (SPI1) Interrupt Disable Register*/
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFA8004) /* (SPI1) Mode Register*/
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFA8000) /* (SPI1) Control Register*/
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFA8010) /* (SPI1) Status Register*/
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFA800C) /* (SPI1) Transmit Data Register*/
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFA801C) /* (SPI1) Interrupt Mask Register*/
/* ========== Register definition for PDC_TSADC peripheral ========== */
#define AT91C_TSADC_TCR ((AT91_REG *) 	0xFFFB010C) /* (PDC_TSADC) Transmit Counter Register*/
#define AT91C_TSADC_PTCR ((AT91_REG *) 	0xFFFB0120) /* (PDC_TSADC) PDC Transfer Control Register*/
#define AT91C_TSADC_RNCR ((AT91_REG *) 	0xFFFB0114) /* (PDC_TSADC) Receive Next Counter Register*/
#define AT91C_TSADC_PTSR ((AT91_REG *) 	0xFFFB0124) /* (PDC_TSADC) PDC Transfer Status Register*/
#define AT91C_TSADC_TNCR ((AT91_REG *) 	0xFFFB011C) /* (PDC_TSADC) Transmit Next Counter Register*/
#define AT91C_TSADC_RNPR ((AT91_REG *) 	0xFFFB0110) /* (PDC_TSADC) Receive Next Pointer Register*/
#define AT91C_TSADC_RCR ((AT91_REG *) 	0xFFFB0104) /* (PDC_TSADC) Receive Counter Register*/
#define AT91C_TSADC_TPR ((AT91_REG *) 	0xFFFB0108) /* (PDC_TSADC) Transmit Pointer Register*/
#define AT91C_TSADC_TNPR ((AT91_REG *) 	0xFFFB0118) /* (PDC_TSADC) Transmit Next Pointer Register*/
#define AT91C_TSADC_RPR ((AT91_REG *) 	0xFFFB0100) /* (PDC_TSADC) Receive Pointer Register*/
/* ========== Register definition for TSADC peripheral ========== */
#define AT91C_TSADC_CHSR ((AT91_REG *) 	0xFFFB0018) /* (TSADC) Channel Status Register*/
#define AT91C_TSADC_CDR5 ((AT91_REG *) 	0xFFFB0044) /* (TSADC) Channel Data Register 5*/
#define AT91C_TSADC_CR  ((AT91_REG *) 	0xFFFB0000) /* (TSADC) Control Register*/
#define AT91C_TSADC_IMR ((AT91_REG *) 	0xFFFB002C) /* (TSADC) Interrupt Mask Register*/
#define AT91C_TSADC_CHDR ((AT91_REG *) 	0xFFFB0014) /* (TSADC) Channel Disable Register*/
#define AT91C_TSADC_LCDR ((AT91_REG *) 	0xFFFB0020) /* (TSADC) Last Converted Register*/
#define AT91C_TSADC_IER ((AT91_REG *) 	0xFFFB0024) /* (TSADC) Interrupt Enable Register*/
#define AT91C_TSADC_TSR ((AT91_REG *) 	0xFFFB000C) /* (TSADC) Touch Screen Register*/
#define AT91C_TSADC_CDR2 ((AT91_REG *) 	0xFFFB0038) /* (TSADC) Channel Data Register 2*/
#define AT91C_TSADC_CDR4 ((AT91_REG *) 	0xFFFB0040) /* (TSADC) Channel Data Register 4*/
#define AT91C_TSADC_CHER ((AT91_REG *) 	0xFFFB0010) /* (TSADC) Channel Enable Register*/
#define AT91C_TSADC_TRGR ((AT91_REG *) 	0xFFFB0008) /* (TSADC) Trigger Register*/
#define AT91C_TSADC_CDR3 ((AT91_REG *) 	0xFFFB003C) /* (TSADC) Channel Data Register 3*/
#define AT91C_TSADC_SR  ((AT91_REG *) 	0xFFFB001C) /* (TSADC) Status Register*/
#define AT91C_TSADC_CDR0 ((AT91_REG *) 	0xFFFB0030) /* (TSADC) Channel Data Register 0*/
#define AT91C_TSADC_CDR6 ((AT91_REG *) 	0xFFFB0048) /* (TSADC) Channel Data Register 6*/
#define AT91C_TSADC_IDR ((AT91_REG *) 	0xFFFB0028) /* (TSADC) Interrupt Disable Register*/
#define AT91C_TSADC_MR  ((AT91_REG *) 	0xFFFB0004) /* (TSADC) Mode Register*/
#define AT91C_TSADC_CDR7 ((AT91_REG *) 	0xFFFB004C) /* (TSADC) Channel Data Register 7*/
#define AT91C_TSADC_CDR1 ((AT91_REG *) 	0xFFFB0034) /* (TSADC) Channel Data Register 1*/
/* ========== Register definition for UDPHS_EPTFIFO peripheral ========== */
#define AT91C_UDPHS_EPTFIFO_READEPT3 ((AT91_REG *) 	0x00630000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3*/
#define AT91C_UDPHS_EPTFIFO_READEPT5 ((AT91_REG *) 	0x00650000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5*/
#define AT91C_UDPHS_EPTFIFO_READEPT1 ((AT91_REG *) 	0x00610000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1*/
#define AT91C_UDPHS_EPTFIFO_READEPT0 ((AT91_REG *) 	0x00600000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0*/
#define AT91C_UDPHS_EPTFIFO_READEPT6 ((AT91_REG *) 	0x00660000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6*/
#define AT91C_UDPHS_EPTFIFO_READEPT2 ((AT91_REG *) 	0x00620000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2*/
#define AT91C_UDPHS_EPTFIFO_READEPT4 ((AT91_REG *) 	0x00640000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4*/
/* ========== Register definition for UDPHS_EPT_0 peripheral ========== */
#define AT91C_UDPHS_EPT_0_EPTSTA ((AT91_REG *) 	0xFFF7811C) /* (UDPHS_EPT_0) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTL ((AT91_REG *) 	0xFFF7810C) /* (UDPHS_EPT_0) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLDIS ((AT91_REG *) 	0xFFF78108) /* (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_0_EPTCFG ((AT91_REG *) 	0xFFF78100) /* (UDPHS_EPT_0) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_0_EPTCLRSTA ((AT91_REG *) 	0xFFF78118) /* (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_0_EPTSETSTA ((AT91_REG *) 	0xFFF78114) /* (UDPHS_EPT_0) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLENB ((AT91_REG *) 	0xFFF78104) /* (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_1 peripheral ========== */
#define AT91C_UDPHS_EPT_1_EPTCTLENB ((AT91_REG *) 	0xFFF78124) /* (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_1_EPTCFG ((AT91_REG *) 	0xFFF78120) /* (UDPHS_EPT_1) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_1_EPTCTL ((AT91_REG *) 	0xFFF7812C) /* (UDPHS_EPT_1) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_1_EPTSTA ((AT91_REG *) 	0xFFF7813C) /* (UDPHS_EPT_1) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCLRSTA ((AT91_REG *) 	0xFFF78138) /* (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_1_EPTSETSTA ((AT91_REG *) 	0xFFF78134) /* (UDPHS_EPT_1) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCTLDIS ((AT91_REG *) 	0xFFF78128) /* (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_2 peripheral ========== */
#define AT91C_UDPHS_EPT_2_EPTCLRSTA ((AT91_REG *) 	0xFFF78158) /* (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLDIS ((AT91_REG *) 	0xFFF78148) /* (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_2_EPTSTA ((AT91_REG *) 	0xFFF7815C) /* (UDPHS_EPT_2) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_2_EPTSETSTA ((AT91_REG *) 	0xFFF78154) /* (UDPHS_EPT_2) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTL ((AT91_REG *) 	0xFFF7814C) /* (UDPHS_EPT_2) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_2_EPTCFG ((AT91_REG *) 	0xFFF78140) /* (UDPHS_EPT_2) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLENB ((AT91_REG *) 	0xFFF78144) /* (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_3 peripheral ========== */
#define AT91C_UDPHS_EPT_3_EPTCTL ((AT91_REG *) 	0xFFF7816C) /* (UDPHS_EPT_3) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_3_EPTCLRSTA ((AT91_REG *) 	0xFFF78178) /* (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLDIS ((AT91_REG *) 	0xFFF78168) /* (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_3_EPTSTA ((AT91_REG *) 	0xFFF7817C) /* (UDPHS_EPT_3) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_3_EPTSETSTA ((AT91_REG *) 	0xFFF78174) /* (UDPHS_EPT_3) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLENB ((AT91_REG *) 	0xFFF78164) /* (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_3_EPTCFG ((AT91_REG *) 	0xFFF78160) /* (UDPHS_EPT_3) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_EPT_4 peripheral ========== */
#define AT91C_UDPHS_EPT_4_EPTCLRSTA ((AT91_REG *) 	0xFFF78198) /* (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCTL ((AT91_REG *) 	0xFFF7818C) /* (UDPHS_EPT_4) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLENB ((AT91_REG *) 	0xFFF78184) /* (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_4_EPTSTA ((AT91_REG *) 	0xFFF7819C) /* (UDPHS_EPT_4) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_4_EPTSETSTA ((AT91_REG *) 	0xFFF78194) /* (UDPHS_EPT_4) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCFG ((AT91_REG *) 	0xFFF78180) /* (UDPHS_EPT_4) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLDIS ((AT91_REG *) 	0xFFF78188) /* (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_5 peripheral ========== */
#define AT91C_UDPHS_EPT_5_EPTSTA ((AT91_REG *) 	0xFFF781BC) /* (UDPHS_EPT_5) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCLRSTA ((AT91_REG *) 	0xFFF781B8) /* (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLENB ((AT91_REG *) 	0xFFF781A4) /* (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_5_EPTSETSTA ((AT91_REG *) 	0xFFF781B4) /* (UDPHS_EPT_5) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLDIS ((AT91_REG *) 	0xFFF781A8) /* (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_5_EPTCFG ((AT91_REG *) 	0xFFF781A0) /* (UDPHS_EPT_5) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_5_EPTCTL ((AT91_REG *) 	0xFFF781AC) /* (UDPHS_EPT_5) UDPHS Endpoint Control Register*/
/* ========== Register definition for UDPHS_EPT_6 peripheral ========== */
#define AT91C_UDPHS_EPT_6_EPTCLRSTA ((AT91_REG *) 	0xFFF781D8) /* (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLENB ((AT91_REG *) 	0xFFF781C4) /* (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_6_EPTCTL ((AT91_REG *) 	0xFFF781CC) /* (UDPHS_EPT_6) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_6_EPTSETSTA ((AT91_REG *) 	0xFFF781D4) /* (UDPHS_EPT_6) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLDIS ((AT91_REG *) 	0xFFF781C8) /* (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_6_EPTSTA ((AT91_REG *) 	0xFFF781DC) /* (UDPHS_EPT_6) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCFG ((AT91_REG *) 	0xFFF781C0) /* (UDPHS_EPT_6) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_DMA_1 peripheral ========== */
#define AT91C_UDPHS_DMA_1_DMASTATUS ((AT91_REG *) 	0xFFF7831C) /* (UDPHS_DMA_1) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_1_DMANXTDSC ((AT91_REG *) 	0xFFF78310) /* (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_1_DMACONTROL ((AT91_REG *) 	0xFFF78318) /* (UDPHS_DMA_1) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_1_DMAADDRESS ((AT91_REG *) 	0xFFF78314) /* (UDPHS_DMA_1) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS_DMA_2 peripheral ========== */
#define AT91C_UDPHS_DMA_2_DMACONTROL ((AT91_REG *) 	0xFFF78328) /* (UDPHS_DMA_2) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_2_DMASTATUS ((AT91_REG *) 	0xFFF7832C) /* (UDPHS_DMA_2) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_2_DMAADDRESS ((AT91_REG *) 	0xFFF78324) /* (UDPHS_DMA_2) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_2_DMANXTDSC ((AT91_REG *) 	0xFFF78320) /* (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address*/
/* ========== Register definition for UDPHS_DMA_3 peripheral ========== */
#define AT91C_UDPHS_DMA_3_DMAADDRESS ((AT91_REG *) 	0xFFF78334) /* (UDPHS_DMA_3) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_3_DMANXTDSC ((AT91_REG *) 	0xFFF78330) /* (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_3_DMACONTROL ((AT91_REG *) 	0xFFF78338) /* (UDPHS_DMA_3) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_3_DMASTATUS ((AT91_REG *) 	0xFFF7833C) /* (UDPHS_DMA_3) UDPHS DMA Channel Status Register*/
/* ========== Register definition for UDPHS_DMA_4 peripheral ========== */
#define AT91C_UDPHS_DMA_4_DMANXTDSC ((AT91_REG *) 	0xFFF78340) /* (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_4_DMAADDRESS ((AT91_REG *) 	0xFFF78344) /* (UDPHS_DMA_4) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_4_DMACONTROL ((AT91_REG *) 	0xFFF78348) /* (UDPHS_DMA_4) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_4_DMASTATUS ((AT91_REG *) 	0xFFF7834C) /* (UDPHS_DMA_4) UDPHS DMA Channel Status Register*/
/* ========== Register definition for UDPHS_DMA_5 peripheral ========== */
#define AT91C_UDPHS_DMA_5_DMASTATUS ((AT91_REG *) 	0xFFF7835C) /* (UDPHS_DMA_5) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_5_DMACONTROL ((AT91_REG *) 	0xFFF78358) /* (UDPHS_DMA_5) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_5_DMANXTDSC ((AT91_REG *) 	0xFFF78350) /* (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_5_DMAADDRESS ((AT91_REG *) 	0xFFF78354) /* (UDPHS_DMA_5) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS_DMA_6 peripheral ========== */
#define AT91C_UDPHS_DMA_6_DMANXTDSC ((AT91_REG *) 	0xFFF78360) /* (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_6_DMACONTROL ((AT91_REG *) 	0xFFF78368) /* (UDPHS_DMA_6) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_6_DMASTATUS ((AT91_REG *) 	0xFFF7836C) /* (UDPHS_DMA_6) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_6_DMAADDRESS ((AT91_REG *) 	0xFFF78364) /* (UDPHS_DMA_6) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS peripheral ========== */
#define AT91C_UDPHS_IEN ((AT91_REG *) 	0xFFF78010) /* (UDPHS) UDPHS Interrupt Enable Register*/
#define AT91C_UDPHS_TSTSOFCNT ((AT91_REG *) 	0xFFF780D0) /* (UDPHS) UDPHS Test SOF Counter Register*/
#define AT91C_UDPHS_IPFEATURES ((AT91_REG *) 	0xFFF780F8) /* (UDPHS) UDPHS Features Register*/
#define AT91C_UDPHS_TST ((AT91_REG *) 	0xFFF780E0) /* (UDPHS) UDPHS Test Register*/
#define AT91C_UDPHS_FNUM ((AT91_REG *) 	0xFFF78004) /* (UDPHS) UDPHS Frame Number Register*/
#define AT91C_UDPHS_TSTCNTB ((AT91_REG *) 	0xFFF780D8) /* (UDPHS) UDPHS Test B Counter Register*/
#define AT91C_UDPHS_RIPPADDRSIZE ((AT91_REG *) 	0xFFF780EC) /* (UDPHS) UDPHS PADDRSIZE Register*/
#define AT91C_UDPHS_INTSTA ((AT91_REG *) 	0xFFF78014) /* (UDPHS) UDPHS Interrupt Status Register*/
#define AT91C_UDPHS_EPTRST ((AT91_REG *) 	0xFFF7801C) /* (UDPHS) UDPHS Endpoints Reset Register*/
#define AT91C_UDPHS_TSTCNTA ((AT91_REG *) 	0xFFF780D4) /* (UDPHS) UDPHS Test A Counter Register*/
#define AT91C_UDPHS_RIPNAME2 ((AT91_REG *) 	0xFFF780F4) /* (UDPHS) UDPHS Name2 Register*/
#define AT91C_UDPHS_RIPNAME1 ((AT91_REG *) 	0xFFF780F0) /* (UDPHS) UDPHS Name1 Register*/
#define AT91C_UDPHS_TSTMODREG ((AT91_REG *) 	0xFFF780DC) /* (UDPHS) UDPHS Test Mode Register*/
#define AT91C_UDPHS_CLRINT ((AT91_REG *) 	0xFFF78018) /* (UDPHS) UDPHS Clear Interrupt Register*/
#define AT91C_UDPHS_IPVERSION ((AT91_REG *) 	0xFFF780FC) /* (UDPHS) UDPHS Version Register*/
#define AT91C_UDPHS_CTRL ((AT91_REG *) 	0xFFF78000) /* (UDPHS) UDPHS Control Register*/
/* ========== Register definition for PDC_AC97C peripheral ========== */
#define AT91C_AC97C_PTSR ((AT91_REG *) 	0xFFFAC124) /* (PDC_AC97C) PDC Transfer Status Register*/
#define AT91C_AC97C_RPR ((AT91_REG *) 	0xFFFAC100) /* (PDC_AC97C) Receive Pointer Register*/
#define AT91C_AC97C_RNCR ((AT91_REG *) 	0xFFFAC114) /* (PDC_AC97C) Receive Next Counter Register*/
#define AT91C_AC97C_RCR ((AT91_REG *) 	0xFFFAC104) /* (PDC_AC97C) Receive Counter Register*/
#define AT91C_AC97C_PTCR ((AT91_REG *) 	0xFFFAC120) /* (PDC_AC97C) PDC Transfer Control Register*/
#define AT91C_AC97C_TPR ((AT91_REG *) 	0xFFFAC108) /* (PDC_AC97C) Transmit Pointer Register*/
#define AT91C_AC97C_RNPR ((AT91_REG *) 	0xFFFAC110) /* (PDC_AC97C) Receive Next Pointer Register*/
#define AT91C_AC97C_TNPR ((AT91_REG *) 	0xFFFAC118) /* (PDC_AC97C) Transmit Next Pointer Register*/
#define AT91C_AC97C_TCR ((AT91_REG *) 	0xFFFAC10C) /* (PDC_AC97C) Transmit Counter Register*/
#define AT91C_AC97C_TNCR ((AT91_REG *) 	0xFFFAC11C) /* (PDC_AC97C) Transmit Next Counter Register*/
/* ========== Register definition for AC97C peripheral ========== */
#define AT91C_AC97C_IER ((AT91_REG *) 	0xFFFAC054) /* (AC97C) Interrupt Enable Register*/
#define AT91C_AC97C_COTHR ((AT91_REG *) 	0xFFFAC044) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_IDR ((AT91_REG *) 	0xFFFAC058) /* (AC97C) Interrupt Disable Register*/
#define AT91C_AC97C_ICA ((AT91_REG *) 	0xFFFAC010) /* (AC97C) Input Channel AssignementRegister*/
#define AT91C_AC97C_CATHR ((AT91_REG *) 	0xFFFAC024) /* (AC97C) Channel A Transmit Holding Register*/
#define AT91C_AC97C_CBSR ((AT91_REG *) 	0xFFFAC038) /* (AC97C) Channel B Status Register*/
#define AT91C_AC97C_CAMR ((AT91_REG *) 	0xFFFAC02C) /* (AC97C) Channel A Mode Register*/
#define AT91C_AC97C_SR  ((AT91_REG *) 	0xFFFAC050) /* (AC97C) Status Register*/
#define AT91C_AC97C_CBTHR ((AT91_REG *) 	0xFFFAC034) /* (AC97C) Channel B Transmit Holding Register (optional)*/
#define AT91C_AC97C_CASR ((AT91_REG *) 	0xFFFAC028) /* (AC97C) Channel A Status Register*/
#define AT91C_AC97C_COSR ((AT91_REG *) 	0xFFFAC048) /* (AC97C) CODEC Status Register*/
#define AT91C_AC97C_MR  ((AT91_REG *) 	0xFFFAC008) /* (AC97C) Mode Register*/
#define AT91C_AC97C_OCA ((AT91_REG *) 	0xFFFAC014) /* (AC97C) Output Channel Assignement Register*/
#define AT91C_AC97C_CORHR ((AT91_REG *) 	0xFFFAC040) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_CBRHR ((AT91_REG *) 	0xFFFAC030) /* (AC97C) Channel B Receive Holding Register (optional)*/
#define AT91C_AC97C_IMR ((AT91_REG *) 	0xFFFAC05C) /* (AC97C) Interrupt Mask Register*/
#define AT91C_AC97C_COMR ((AT91_REG *) 	0xFFFAC04C) /* (AC97C) CODEC Mask Status Register*/
#define AT91C_AC97C_CARHR ((AT91_REG *) 	0xFFFAC020) /* (AC97C) Channel A Receive Holding Register*/
#define AT91C_AC97C_VERSION ((AT91_REG *) 	0xFFFAC0FC) /* (AC97C) Version Register*/
#define AT91C_AC97C_CBMR ((AT91_REG *) 	0xFFFAC03C) /* (AC97C) Channel B Mode Register*/
/* ========== Register definition for LCDC peripheral ========== */
#define AT91C_LCDC_MVAL ((AT91_REG *) 	0x00500818) /* (LCDC) LCD Mode Toggle Rate Value Register*/
#define AT91C_LCDC_PWRCON ((AT91_REG *) 	0x0050083C) /* (LCDC) Power Control Register*/
#define AT91C_LCDC_ISR  ((AT91_REG *) 	0x00500854) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_FRMP1 ((AT91_REG *) 	0x00500008) /* (LCDC) DMA Frame Pointer Register 1*/
#define AT91C_LCDC_CTRSTVAL ((AT91_REG *) 	0x00500844) /* (LCDC) Contrast Value Register*/
#define AT91C_LCDC_ICR  ((AT91_REG *) 	0x00500858) /* (LCDC) Interrupt Clear Register*/
#define AT91C_LCDC_TIM1 ((AT91_REG *) 	0x00500808) /* (LCDC) LCD Timing Config 1 Register*/
#define AT91C_LCDC_DMACON ((AT91_REG *) 	0x0050001C) /* (LCDC) DMA Control Register*/
#define AT91C_LCDC_ITR  ((AT91_REG *) 	0x00500860) /* (LCDC) Interrupts Test Register*/
#define AT91C_LCDC_IDR  ((AT91_REG *) 	0x0050084C) /* (LCDC) Interrupt Disable Register*/
#define AT91C_LCDC_DP4_7 ((AT91_REG *) 	0x00500820) /* (LCDC) Dithering Pattern DP4_7 Register*/
#define AT91C_LCDC_DP5_7 ((AT91_REG *) 	0x0050082C) /* (LCDC) Dithering Pattern DP5_7 Register*/
#define AT91C_LCDC_IRR  ((AT91_REG *) 	0x00500864) /* (LCDC) Interrupts Raw Status Register*/
#define AT91C_LCDC_DP3_4 ((AT91_REG *) 	0x00500830) /* (LCDC) Dithering Pattern DP3_4 Register*/
#define AT91C_LCDC_IMR  ((AT91_REG *) 	0x00500850) /* (LCDC) Interrupt Mask Register*/
#define AT91C_LCDC_LCDFRCFG ((AT91_REG *) 	0x00500810) /* (LCDC) LCD Frame Config Register*/
#define AT91C_LCDC_CTRSTCON ((AT91_REG *) 	0x00500840) /* (LCDC) Contrast Control Register*/
#define AT91C_LCDC_DP1_2 ((AT91_REG *) 	0x0050081C) /* (LCDC) Dithering Pattern DP1_2 Register*/
#define AT91C_LCDC_FRMP2 ((AT91_REG *) 	0x0050000C) /* (LCDC) DMA Frame Pointer Register 2*/
#define AT91C_LCDC_LCDCON1 ((AT91_REG *) 	0x00500800) /* (LCDC) LCD Control 1 Register*/
#define AT91C_LCDC_DP4_5 ((AT91_REG *) 	0x00500834) /* (LCDC) Dithering Pattern DP4_5 Register*/
#define AT91C_LCDC_FRMA2 ((AT91_REG *) 	0x00500014) /* (LCDC) DMA Frame Address Register 2*/
#define AT91C_LCDC_BA1  ((AT91_REG *) 	0x00500000) /* (LCDC) DMA Base Address Register 1*/
#define AT91C_LCDC_DMA2DCFG ((AT91_REG *) 	0x00500020) /* (LCDC) DMA 2D addressing configuration*/
#define AT91C_LCDC_LUT_ENTRY ((AT91_REG *) 	0x00500C00) /* (LCDC) LUT Entries Register*/
#define AT91C_LCDC_DP6_7 ((AT91_REG *) 	0x00500838) /* (LCDC) Dithering Pattern DP6_7 Register*/
#define AT91C_LCDC_FRMCFG ((AT91_REG *) 	0x00500018) /* (LCDC) DMA Frame Configuration Register*/
#define AT91C_LCDC_TIM2 ((AT91_REG *) 	0x0050080C) /* (LCDC) LCD Timing Config 2 Register*/
#define AT91C_LCDC_DP3_5 ((AT91_REG *) 	0x00500824) /* (LCDC) Dithering Pattern DP3_5 Register*/
#define AT91C_LCDC_FRMA1 ((AT91_REG *) 	0x00500010) /* (LCDC) DMA Frame Address Register 1*/
#define AT91C_LCDC_IER  ((AT91_REG *) 	0x00500848) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_DP2_3 ((AT91_REG *) 	0x00500828) /* (LCDC) Dithering Pattern DP2_3 Register*/
#define AT91C_LCDC_FIFO ((AT91_REG *) 	0x00500814) /* (LCDC) LCD FIFO Register*/
#define AT91C_LCDC_BA2  ((AT91_REG *) 	0x00500004) /* (LCDC) DMA Base Address Register 2*/
#define AT91C_LCDC_LCDCON2 ((AT91_REG *) 	0x00500804) /* (LCDC) LCD Control 2 Register*/
#define AT91C_LCDC_GPR  ((AT91_REG *) 	0x0050085C) /* (LCDC) General Purpose Register*/
/* ========== Register definition for LCDC_16B_TFT peripheral ========== */
#define AT91C_TFT_MVAL  ((AT91_REG *) 	0x00500818) /* (LCDC_16B_TFT) LCD Mode Toggle Rate Value Register*/
#define AT91C_TFT_PWRCON ((AT91_REG *) 	0x0050083C) /* (LCDC_16B_TFT) Power Control Register*/
#define AT91C_TFT_ISR   ((AT91_REG *) 	0x00500854) /* (LCDC_16B_TFT) Interrupt Enable Register*/
#define AT91C_TFT_FRMP1 ((AT91_REG *) 	0x00500008) /* (LCDC_16B_TFT) DMA Frame Pointer Register 1*/
#define AT91C_TFT_CTRSTVAL ((AT91_REG *) 	0x00500844) /* (LCDC_16B_TFT) Contrast Value Register*/
#define AT91C_TFT_ICR   ((AT91_REG *) 	0x00500858) /* (LCDC_16B_TFT) Interrupt Clear Register*/
#define AT91C_TFT_TIM1  ((AT91_REG *) 	0x00500808) /* (LCDC_16B_TFT) LCD Timing Config 1 Register*/
#define AT91C_TFT_DMACON ((AT91_REG *) 	0x0050001C) /* (LCDC_16B_TFT) DMA Control Register*/
#define AT91C_TFT_ITR   ((AT91_REG *) 	0x00500860) /* (LCDC_16B_TFT) Interrupts Test Register*/
#define AT91C_TFT_IDR   ((AT91_REG *) 	0x0050084C) /* (LCDC_16B_TFT) Interrupt Disable Register*/
#define AT91C_TFT_DP4_7 ((AT91_REG *) 	0x00500820) /* (LCDC_16B_TFT) Dithering Pattern DP4_7 Register*/
#define AT91C_TFT_DP5_7 ((AT91_REG *) 	0x0050082C) /* (LCDC_16B_TFT) Dithering Pattern DP5_7 Register*/
#define AT91C_TFT_IRR   ((AT91_REG *) 	0x00500864) /* (LCDC_16B_TFT) Interrupts Raw Status Register*/
#define AT91C_TFT_DP3_4 ((AT91_REG *) 	0x00500830) /* (LCDC_16B_TFT) Dithering Pattern DP3_4 Register*/
#define AT91C_TFT_IMR   ((AT91_REG *) 	0x00500850) /* (LCDC_16B_TFT) Interrupt Mask Register*/
#define AT91C_TFT_LCDFRCFG ((AT91_REG *) 	0x00500810) /* (LCDC_16B_TFT) LCD Frame Config Register*/
#define AT91C_TFT_CTRSTCON ((AT91_REG *) 	0x00500840) /* (LCDC_16B_TFT) Contrast Control Register*/
