una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_TFT_DP1_2 ((AT91_REG *) 	0x0050081C) /* (LCDC_16B_TFT) Dithering Pattern DP1_2 Register*/
#define AT91C_TFT_FRMP2 ((AT91_REG *) 	0x0050000C) /* (LCDC_16B_TFT) DMA Frame Pointer Register 2*/
#define AT91C_TFT_LCDCON1 ((AT91_REG *) 	0x00500800) /* (LCDC_16B_TFT) LCD Control 1 Register*/
#define AT91C_TFT_DP4_5 ((AT91_REG *) 	0x00500834) /* (LCDC_16B_TFT) Dithering Pattern DP4_5 Register*/
#define AT91C_TFT_FRMA2 ((AT91_REG *) 	0x00500014) /* (LCDC_16B_TFT) DMA Frame Address Register 2*/
#define AT91C_TFT_BA1   ((AT91_REG *) 	0x00500000) /* (LCDC_16B_TFT) DMA Base Address Register 1*/
#define AT91C_TFT_DMA2DCFG ((AT91_REG *) 	0x00500020) /* (LCDC_16B_TFT) DMA 2D addressing configuration*/
#define AT91C_TFT_LUT_ENTRY ((AT91_REG *) 	0x00500C00) /* (LCDC_16B_TFT) LUT Entries Register*/
#define AT91C_TFT_DP6_7 ((AT91_REG *) 	0x00500838) /* (LCDC_16B_TFT) Dithering Pattern DP6_7 Register*/
#define AT91C_TFT_FRMCFG ((AT91_REG *) 	0x00500018) /* (LCDC_16B_TFT) DMA Frame Configuration Register*/
#define AT91C_TFT_TIM2  ((AT91_REG *) 	0x0050080C) /* (LCDC_16B_TFT) LCD Timing Config 2 Register*/
#define AT91C_TFT_DP3_5 ((AT91_REG *) 	0x00500824) /* (LCDC_16B_TFT) Dithering Pattern DP3_5 Register*/
#define AT91C_TFT_FRMA1 ((AT91_REG *) 	0x00500010) /* (LCDC_16B_TFT) DMA Frame Address Register 1*/
#define AT91C_TFT_IER   ((AT91_REG *) 	0x00500848) /* (LCDC_16B_TFT) Interrupt Enable Register*/
#define AT91C_TFT_DP2_3 ((AT91_REG *) 	0x00500828) /* (LCDC_16B_TFT) Dithering Pattern DP2_3 Register*/
#define AT91C_TFT_FIFO  ((AT91_REG *) 	0x00500814) /* (LCDC_16B_TFT) LCD FIFO Register*/
#define AT91C_TFT_BA2   ((AT91_REG *) 	0x00500004) /* (LCDC_16B_TFT) DMA Base Address Register 2*/
#define AT91C_TFT_LCDCON2 ((AT91_REG *) 	0x00500804) /* (LCDC_16B_TFT) LCD Control 2 Register*/
#define AT91C_TFT_GPR   ((AT91_REG *) 	0x0050085C) /* (LCDC_16B_TFT) General Purpose Register*/
/* ========== Register definition for HDMA_CH_0 peripheral ========== */
#define AT91C_HDMA_CH_0_BDSCR ((AT91_REG *) 	0xFFFFEC5C) /* (HDMA_CH_0) HDMA Reserved*/
#define AT91C_HDMA_CH_0_DADDR ((AT91_REG *) 	0xFFFFEC40) /* (HDMA_CH_0) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_0_DPIP ((AT91_REG *) 	0xFFFFEC58) /* (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_DSCR ((AT91_REG *) 	0xFFFFEC44) /* (HDMA_CH_0) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_0_CFG ((AT91_REG *) 	0xFFFFEC50) /* (HDMA_CH_0) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_0_SPIP ((AT91_REG *) 	0xFFFFEC54) /* (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_CADDR ((AT91_REG *) 	0xFFFFEC60) /* (HDMA_CH_0) HDMA Reserved*/
#define AT91C_HDMA_CH_0_CTRLA ((AT91_REG *) 	0xFFFFEC48) /* (HDMA_CH_0) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_0_CTRLB ((AT91_REG *) 	0xFFFFEC4C) /* (HDMA_CH_0) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_0_SADDR ((AT91_REG *) 	0xFFFFEC3C) /* (HDMA_CH_0) HDMA Channel Source Address Register*/
/* ========== Register definition for HDMA_CH_1 peripheral ========== */
#define AT91C_HDMA_CH_1_CADDR ((AT91_REG *) 	0xFFFFEC88) /* (HDMA_CH_1) HDMA Reserved*/
#define AT91C_HDMA_CH_1_DPIP ((AT91_REG *) 	0xFFFFEC80) /* (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_1_CTRLB ((AT91_REG *) 	0xFFFFEC74) /* (HDMA_CH_1) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_1_SADDR ((AT91_REG *) 	0xFFFFEC64) /* (HDMA_CH_1) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_1_BDSCR ((AT91_REG *) 	0xFFFFEC84) /* (HDMA_CH_1) HDMA Reserved*/
#define AT91C_HDMA_CH_1_CFG ((AT91_REG *) 	0xFFFFEC78) /* (HDMA_CH_1) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_1_DSCR ((AT91_REG *) 	0xFFFFEC6C) /* (HDMA_CH_1) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_1_DADDR ((AT91_REG *) 	0xFFFFEC68) /* (HDMA_CH_1) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_1_CTRLA ((AT91_REG *) 	0xFFFFEC70) /* (HDMA_CH_1) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_1_SPIP ((AT91_REG *) 	0xFFFFEC7C) /* (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register*/
/* ========== Register definition for HDMA_CH_2 peripheral ========== */
#define AT91C_HDMA_CH_2_SADDR ((AT91_REG *) 	0xFFFFEC8C) /* (HDMA_CH_2) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_2_BDSCR ((AT91_REG *) 	0xFFFFECAC) /* (HDMA_CH_2) HDMA Reserved*/
#define AT91C_HDMA_CH_2_DPIP ((AT91_REG *) 	0xFFFFECA8) /* (HDMA_CH_2) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_2_SPIP ((AT91_REG *) 	0xFFFFECA4) /* (HDMA_CH_2) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_2_DADDR ((AT91_REG *) 	0xFFFFEC90) /* (HDMA_CH_2) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_2_DSCR ((AT91_REG *) 	0xFFFFEC94) /* (HDMA_CH_2) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_2_CTRLA ((AT91_REG *) 	0xFFFFEC98) /* (HDMA_CH_2) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_2_CADDR ((AT91_REG *) 	0xFFFFECB0) /* (HDMA_CH_2) HDMA Reserved*/
#define AT91C_HDMA_CH_2_CFG ((AT91_REG *) 	0xFFFFECA0) /* (HDMA_CH_2) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_2_CTRLB ((AT91_REG *) 	0xFFFFEC9C) /* (HDMA_CH_2) HDMA Channel Control B Register*/
/* ========== Register definition for HDMA_CH_3 peripheral ========== */
#define AT91C_HDMA_CH_3_SPIP ((AT91_REG *) 	0xFFFFECCC) /* (HDMA_CH_3) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_3_CTRLA ((AT91_REG *) 	0xFFFFECC0) /* (HDMA_CH_3) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_3_DPIP ((AT91_REG *) 	0xFFFFECD0) /* (HDMA_CH_3) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_3_CTRLB ((AT91_REG *) 	0xFFFFECC4) /* (HDMA_CH_3) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_3_BDSCR ((AT91_REG *) 	0xFFFFECD4) /* (HDMA_CH_3) HDMA Reserved*/
#define AT91C_HDMA_CH_3_DSCR ((AT91_REG *) 	0xFFFFECBC) /* (HDMA_CH_3) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_3_CADDR ((AT91_REG *) 	0xFFFFECD8) /* (HDMA_CH_3) HDMA Reserved*/
#define AT91C_HDMA_CH_3_CFG ((AT91_REG *) 	0xFFFFECC8) /* (HDMA_CH_3) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_3_DADDR ((AT91_REG *) 	0xFFFFECB8) /* (HDMA_CH_3) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_3_SADDR ((AT91_REG *) 	0xFFFFECB4) /* (HDMA_CH_3) HDMA Channel Source Address Register*/
/* ========== Register definition for HDMA_CH_4 peripheral ========== */
#define AT91C_HDMA_CH_4_CFG ((AT91_REG *) 	0xFFFFECF0) /* (HDMA_CH_4) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_4_BDSCR ((AT91_REG *) 	0xFFFFECFC) /* (HDMA_CH_4) HDMA Reserved*/
#define AT91C_HDMA_CH_4_CADDR ((AT91_REG *) 	0xFFFFED00) /* (HDMA_CH_4) HDMA Reserved*/
#define AT91C_HDMA_CH_4_DADDR ((AT91_REG *) 	0xFFFFECE0) /* (HDMA_CH_4) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_4_CTRLA ((AT91_REG *) 	0xFFFFECE8) /* (HDMA_CH_4) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_4_SADDR ((AT91_REG *) 	0xFFFFECDC) /* (HDMA_CH_4) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_4_CTRLB ((AT91_REG *) 	0xFFFFECEC) /* (HDMA_CH_4) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_4_DSCR ((AT91_REG *) 	0xFFFFECE4) /* (HDMA_CH_4) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_4_SPIP ((AT91_REG *) 	0xFFFFECF4) /* (HDMA_CH_4) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_4_DPIP ((AT91_REG *) 	0xFFFFECF8) /* (HDMA_CH_4) HDMA Channel Destination Picture in Picture Configuration Register*/
/* ========== Register definition for HDMA_CH_5 peripheral ========== */
#define AT91C_HDMA_CH_5_CTRLB ((AT91_REG *) 	0xFFFFED14) /* (HDMA_CH_5) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_5_DADDR ((AT91_REG *) 	0xFFFFED08) /* (HDMA_CH_5) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_5_SPIP ((AT91_REG *) 	0xFFFFED1C) /* (HDMA_CH_5) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_5_DSCR ((AT91_REG *) 	0xFFFFED0C) /* (HDMA_CH_5) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_5_DPIP ((AT91_REG *) 	0xFFFFED20) /* (HDMA_CH_5) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_5_CFG ((AT91_REG *) 	0xFFFFED18) /* (HDMA_CH_5) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_5_CADDR ((AT91_REG *) 	0xFFFFED28) /* (HDMA_CH_5) HDMA Reserved*/
#define AT91C_HDMA_CH_5_SADDR ((AT91_REG *) 	0xFFFFED04) /* (HDMA_CH_5) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_5_BDSCR ((AT91_REG *) 	0xFFFFED24) /* (HDMA_CH_5) HDMA Reserved*/
#define AT91C_HDMA_CH_5_CTRLA ((AT91_REG *) 	0xFFFFED10) /* (HDMA_CH_5) HDMA Channel Control A Register*/
/* ========== Register definition for HDMA_CH_6 peripheral ========== */
#define AT91C_HDMA_CH_6_SADDR ((AT91_REG *) 	0xFFFFED2C) /* (HDMA_CH_6) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_6_BDSCR ((AT91_REG *) 	0xFFFFED4C) /* (HDMA_CH_6) HDMA Reserved*/
#define AT91C_HDMA_CH_6_CADDR ((AT91_REG *) 	0xFFFFED50) /* (HDMA_CH_6) HDMA Reserved*/
#define AT91C_HDMA_CH_6_SPIP ((AT91_REG *) 	0xFFFFED44) /* (HDMA_CH_6) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_6_CTRLB ((AT91_REG *) 	0xFFFFED3C) /* (HDMA_CH_6) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_6_DSCR ((AT91_REG *) 	0xFFFFED34) /* (HDMA_CH_6) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_6_CFG ((AT91_REG *) 	0xFFFFED40) /* (HDMA_CH_6) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_6_DPIP ((AT91_REG *) 	0xFFFFED48) /* (HDMA_CH_6) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_6_DADDR ((AT91_REG *) 	0xFFFFED30) /* (HDMA_CH_6) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_6_CTRLA ((AT91_REG *) 	0xFFFFED38) /* (HDMA_CH_6) HDMA Channel Control A Register*/
/* ========== Register definition for HDMA_CH_7 peripheral ========== */
#define AT91C_HDMA_CH_7_CADDR ((AT91_REG *) 	0xFFFFED78) /* (HDMA_CH_7) HDMA Reserved*/
#define AT91C_HDMA_CH_7_CFG ((AT91_REG *) 	0xFFFFED68) /* (HDMA_CH_7) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_7_DADDR ((AT91_REG *) 	0xFFFFED58) /* (HDMA_CH_7) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_7_CTRLB ((AT91_REG *) 	0xFFFFED64) /* (HDMA_CH_7) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_7_DSCR ((AT91_REG *) 	0xFFFFED5C) /* (HDMA_CH_7) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_7_DPIP ((AT91_REG *) 	0xFFFFED70) /* (HDMA_CH_7) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_7_CTRLA ((AT91_REG *) 	0xFFFFED60) /* (HDMA_CH_7) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_7_BDSCR ((AT91_REG *) 	0xFFFFED74) /* (HDMA_CH_7) HDMA Reserved*/
#define AT91C_HDMA_CH_7_SPIP ((AT91_REG *) 	0xFFFFED6C) /* (HDMA_CH_7) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_7_SADDR ((AT91_REG *) 	0xFFFFED54) /* (HDMA_CH_7) HDMA Channel Source Address Register*/
/* ========== Register definition for HDMA peripheral ========== */
#define AT91C_HDMA_EBCIDR ((AT91_REG *) 	0xFFFFEC1C) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
#define AT91C_HDMA_LAST ((AT91_REG *) 	0xFFFFEC10) /* (HDMA) HDMA Software Last Transfer Flag Register*/
#define AT91C_HDMA_SREQ ((AT91_REG *) 	0xFFFFEC08) /* (HDMA) HDMA Software Single Request Register*/
#define AT91C_HDMA_RSVD0 ((AT91_REG *) 	0xFFFFEC34) /* (HDMA) HDMA Reserved*/
#define AT91C_HDMA_EBCIER ((AT91_REG *) 	0xFFFFEC18) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
#define AT91C_HDMA_GCFG ((AT91_REG *) 	0xFFFFEC00) /* (HDMA) HDMA Global Configuration Register*/
#define AT91C_HDMA_CHER ((AT91_REG *) 	0xFFFFEC28) /* (HDMA) HDMA Channel Handler Enable Register*/
#define AT91C_HDMA_RSVD1 ((AT91_REG *) 	0xFFFFEC38) /* (HDMA) HDMA Reserved*/
#define AT91C_HDMA_CHDR ((AT91_REG *) 	0xFFFFEC2C) /* (HDMA) HDMA Channel Handler Disable Register*/
#define AT91C_HDMA_EBCIMR ((AT91_REG *) 	0xFFFFEC20) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
#define AT91C_HDMA_CREQ ((AT91_REG *) 	0xFFFFEC0C) /* (HDMA) HDMA Software Chunk Transfer Request Register*/
#define AT91C_HDMA_SYNC ((AT91_REG *) 	0xFFFFEC14) /* (HDMA) HDMA Request Synchronization Register*/
#define AT91C_HDMA_EN   ((AT91_REG *) 	0xFFFFEC04) /* (HDMA) HDMA Controller Enable Register*/
#define AT91C_HDMA_EBCISR ((AT91_REG *) 	0xFFFFEC24) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
#define AT91C_HDMA_CHSR ((AT91_REG *) 	0xFFFFEC30) /* (HDMA) HDMA Channel Handler Status Register*/
/* ========== Register definition for HECC peripheral ========== */
#define AT91C_HECC_VR   ((AT91_REG *) 	0xFFFFE2FC) /* (HECC)  ECC Version register*/
#define AT91C_HECC_SR   ((AT91_REG *) 	0xFFFFE208) /* (HECC)  ECC Status register*/
#define AT91C_HECC_CR   ((AT91_REG *) 	0xFFFFE200) /* (HECC)  ECC reset register*/
#define AT91C_HECC_NPR  ((AT91_REG *) 	0xFFFFE210) /* (HECC)  ECC Parity N register*/
#define AT91C_HECC_PR   ((AT91_REG *) 	0xFFFFE20C) /* (HECC)  ECC Parity register*/
#define AT91C_HECC_MR   ((AT91_REG *) 	0xFFFFE204) /* (HECC)  ECC Page size register*/
/* ========== Register definition for EMACB peripheral ========== */
#define AT91C_EMACB_ALE ((AT91_REG *) 	0xFFFBC054) /* (EMACB) Alignment Error Register*/
#define AT91C_EMACB_RRE ((AT91_REG *) 	0xFFFBC06C) /* (EMACB) Receive Ressource Error Register*/
#define AT91C_EMACB_SA4H ((AT91_REG *) 	0xFFFBC0B4) /* (EMACB) Specific Address 4 Top, Last 2 bytes*/
#define AT91C_EMACB_TPQ ((AT91_REG *) 	0xFFFBC0BC) /* (EMACB) Transmit Pause Quantum Register*/
#define AT91C_EMACB_RJA ((AT91_REG *) 	0xFFFBC07C) /* (EMACB) Receive Jabbers Register*/
#define AT91C_EMACB_SA2H ((AT91_REG *) 	0xFFFBC0A4) /* (EMACB) Specific Address 2 Top, Last 2 bytes*/
#define AT91C_EMACB_TPF ((AT91_REG *) 	0xFFFBC08C) /* (EMACB) Transmitted Pause Frames Register*/
#define AT91C_EMACB_ROV ((AT91_REG *) 	0xFFFBC070) /* (EMACB) Receive Overrun Errors Register*/
#define AT91C_EMACB_SA4L ((AT91_REG *) 	0xFFFBC0B0) /* (EMACB) Specific Address 4 Bottom, First 4 bytes*/
#define AT91C_EMACB_MAN ((AT91_REG *) 	0xFFFBC034) /* (EMACB) PHY Maintenance Register*/
#define AT91C_EMACB_TID ((AT91_REG *) 	0xFFFBC0B8) /* (EMACB) Type ID Checking Register*/
#define AT91C_EMACB_TBQP ((AT91_REG *) 	0xFFFBC01C) /* (EMACB) Transmit Buffer Queue Pointer*/
#define AT91C_EMACB_SA3L ((AT91_REG *) 	0xFFFBC0A8) /* (EMACB) Specific Address 3 Bottom, First 4 bytes*/
#define AT91C_EMACB_DTF ((AT91_REG *) 	0xFFFBC058) /* (EMACB) Deferred Transmission Frame Register*/
#define AT91C_EMACB_PTR ((AT91_REG *) 	0xFFFBC038) /* (EMACB) Pause Time Register*/
#define AT91C_EMACB_CSE ((AT91_REG *) 	0xFFFBC068) /* (EMACB) Carrier Sense Error Register*/
#define AT91C_EMACB_ECOL ((AT91_REG *) 	0xFFFBC060) /* (EMACB) Excessive Collision Register*/
#define AT91C_EMACB_STE ((AT91_REG *) 	0xFFFBC084) /* (EMACB) SQE Test Error Register*/
#define AT91C_EMACB_MCF ((AT91_REG *) 	0xFFFBC048) /* (EMACB) Multiple Collision Frame Register*/
#define AT91C_EMACB_IER ((AT91_REG *) 	0xFFFBC028) /* (EMACB) Interrupt Enable Register*/
#define AT91C_EMACB_ELE ((AT91_REG *) 	0xFFFBC078) /* (EMACB) Excessive Length Errors Register*/
#define AT91C_EMACB_USRIO ((AT91_REG *) 	0xFFFBC0C0) /* (EMACB) USER Input/Output Register*/
#define AT91C_EMACB_PFR ((AT91_REG *) 	0xFFFBC03C) /* (EMACB) Pause Frames received Register*/
#define AT91C_EMACB_FCSE ((AT91_REG *) 	0xFFFBC050) /* (EMACB) Frame Check Sequence Error Register*/
#define AT91C_EMACB_SA1L ((AT91_REG *) 	0xFFFBC098) /* (EMACB) Specific Address 1 Bottom, First 4 bytes*/
#define AT91C_EMACB_NCR ((AT91_REG *) 	0xFFFBC000) /* (EMACB) Network Control Register*/
#define AT91C_EMACB_HRT ((AT91_REG *) 	0xFFFBC094) /* (EMACB) Hash Address Top[63:32]*/
#define AT91C_EMACB_NCFGR ((AT91_REG *) 	0xFFFBC004) /* (EMACB) Network Configuration Register*/
#define AT91C_EMACB_SCF ((AT91_REG *) 	0xFFFBC044) /* (EMACB) Single Collision Frame Register*/
#define AT91C_EMACB_LCOL ((AT91_REG *) 	0xFFFBC05C) /* (EMACB) Late Collision Register*/
#define AT91C_EMACB_SA3H ((AT91_REG *) 	0xFFFBC0AC) /* (EMACB) Specific Address 3 Top, Last 2 bytes*/
#define AT91C_EMACB_HRB ((AT91_REG *) 	0xFFFBC090) /* (EMACB) Hash Address Bottom[31:0]*/
#define AT91C_EMACB_ISR ((AT91_REG *) 	0xFFFBC024) /* (EMACB) Interrupt Status Register*/
#define AT91C_EMACB_IMR ((AT91_REG *) 	0xFFFBC030) /* (EMACB) Interrupt Mask Register*/
#define AT91C_EMACB_WOL ((AT91_REG *) 	0xFFFBC0C4) /* (EMACB) Wake On LAN Register*/
#define AT91C_EMACB_USF ((AT91_REG *) 	0xFFFBC080) /* (EMACB) Undersize Frames Register*/
#define AT91C_EMACB_TSR ((AT91_REG *) 	0xFFFBC014) /* (EMACB) Transmit Status Register*/
#define AT91C_EMACB_FRO ((AT91_REG *) 	0xFFFBC04C) /* (EMACB) Frames Received OK Register*/
#define AT91C_EMACB_IDR ((AT91_REG *) 	0xFFFBC02C) /* (EMACB) Interrupt Disable Register*/
#define AT91C_EMACB_SA1H ((AT91_REG *) 	0xFFFBC09C) /* (EMACB) Specific Address 1 Top, Last 2 bytes*/
#define AT91C_EMACB_RLE ((AT91_REG *) 	0xFFFBC088) /* (EMACB) Receive Length Field Mismatch Register*/
#define AT91C_EMACB_TUND ((AT91_REG *) 	0xFFFBC064) /* (EMACB) Transmit Underrun Error Register*/
#define AT91C_EMACB_RSR ((AT91_REG *) 	0xFFFBC020) /* (EMACB) Receive Status Register*/
#define AT91C_EMACB_SA2L ((AT91_REG *) 	0xFFFBC0A0) /* (EMACB) Specific Address 2 Bottom, First 4 bytes*/
#define AT91C_EMACB_FTO ((AT91_REG *) 	0xFFFBC040) /* (EMACB) Frames Transmitted OK Register*/
#define AT91C_EMACB_RSE ((AT91_REG *) 	0xFFFBC074) /* (EMACB) Receive Symbol Errors Register*/
#define AT91C_EMACB_NSR ((AT91_REG *) 	0xFFFBC008) /* (EMACB) Network Status Register*/
#define AT91C_EMACB_RBQP ((AT91_REG *) 	0xFFFBC018) /* (EMACB) Receive Buffer Queue Pointer*/
#define AT91C_EMACB_REV ((AT91_REG *) 	0xFFFBC0FC) /* (EMACB) Revision Register*/
/* ========== Register definition for ISI peripheral ========== */
#define AT91C_ISI_DMACHDR ((AT91_REG *) 	0xFFFB403C) /* (ISI) DMA Channel Disable Register*/
#define AT91C_ISI_IMR   ((AT91_REG *) 	0xFFFB4034) /* (ISI) Interrupt Mask Register*/
#define AT91C_ISI_R2YSET1 ((AT91_REG *) 	0xFFFB401C) /* (ISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_ISI_PDECF ((AT91_REG *) 	0xFFFB400C) /* (ISI) Preview Decimation Factor Register*/
#define AT91C_ISI_CFG2  ((AT91_REG *) 	0xFFFB4004) /* (ISI) Configuration Register 2*/
#define AT91C_ISI_DMACCTRL ((AT91_REG *) 	0xFFFB4054) /* (ISI) DMA Codec Control Register*/
#define AT91C_ISI_CTRL  ((AT91_REG *) 	0xFFFB4024) /* (ISI) Control Register*/
#define AT91C_ISI_Y2RSET0 ((AT91_REG *) 	0xFFFB4010) /* (ISI) Color Space Conversion YCrCb to RGB Register*/
#define AT91C_ISI_WPSR  ((AT91_REG *) 	0xFFFB40E8) /* (ISI) Write Protection Status Register*/
#define AT91C_ISI_DMACHER ((AT91_REG *) 	0xFFFB4038) /* (ISI) DMA Channel Enable Register*/
#define AT91C_ISI_DMACHSR ((AT91_REG *) 	0xFFFB4040) /* (ISI) DMA Channel Status Register*/
#define AT91C_ISI_IDR   ((AT91_REG *) 	0xFFFB4030) /* (ISI) Interrupt Disable Register*/
#define AT91C_ISI_VER   ((AT91_REG *) 	0xFFFB40FC) /* (ISI) Version Register*/
#define AT91C_ISI_Y2RSET1 ((AT91_REG *) 	0xFFFB4014) /* (ISI) Color Space Conversion YCrCb to RGB Register*/
#define AT91C_ISI_R2YSET2 ((AT91_REG *) 	0xFFFB4020) /* (ISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_ISI_SR    ((AT91_REG *) 	0xFFFB4028) /* (ISI) Status Register*/
#define AT91C_ISI_DMACDSCR ((AT91_REG *) 	0xFFFB4058) /* (ISI) DMA Codec Descriptor Address Register*/
#define AT91C_ISI_IER   ((AT91_REG *) 	0xFFFB402C) /* (ISI) Interrupt Enable Register*/
#define AT91C_ISI_WPCR  ((AT91_REG *) 	0xFFFB40E4) /* (ISI) Write Protection Control Register*/
#define AT91C_ISI_DMACADDR ((AT91_REG *) 	0xFFFB4050) /* (ISI) DMA Codec Base Address Register*/
#define AT91C_ISI_CFG1  ((AT91_REG *) 	0xFFFB4000) /* (ISI) Configuration Register 1*/
#define AT91C_ISI_R2YSET0 ((AT91_REG *) 	0xFFFB4018) /* (ISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_ISI_PSIZE ((AT91_REG *) 	0xFFFB4008) /* (ISI) Preview Size Register*/
#define AT91C_ISI_DMAPDSCR ((AT91_REG *) 	0xFFFB404C) /* (ISI) DMA Preview Descriptor Address Register*/
#define AT91C_ISI_DMAPADDR ((AT91_REG *) 	0xFFFB4044) /* (ISI) DMA Preview Base Address Register*/
#define AT91C_ISI_DMAPCTRL ((AT91_REG *) 	0xFFFB4048) /* (ISI) DMA Preview Control Register*/
/* ========== Register definition for VDEC peripheral ========== */
#define AT91C_VDEC_DCR  ((AT91_REG *) 	0x00900008) /* (VDEC) Device Configuration Register*/
#define AT91C_VDEC_IDR  ((AT91_REG *) 	0x00900000) /* (VDEC) ID Register*/
#define AT91C_VDEC_ISR  ((AT91_REG *) 	0x00900004) /* (VDEC) Interrupt Status Register*/
/* ========== Register definition for UHPHS_OHCI peripheral ========== */
#define AT91C_OHCI_HcRhPortStatus ((AT91_REG *) 	0x00700054) /* (UHPHS_OHCI) Root Hub Port Status Register*/
#define AT91C_OHCI_HcFmRemaining ((AT91_REG *) 	0x00700038) /* (UHPHS_OHCI) Bit time remaining in the current Frame*/
#define AT91C_OHCI_HcInterruptEnable ((AT91_REG *) 	0x00700010) /* (UHPHS_OHCI) Interrupt Enable Register*/
#define AT91C_OHCI_HcControl ((AT91_REG *) 	0x00700004) /* (UHPHS_OHCI) Operating modes for the Host Controller*/
#define AT91C_OHCI_HcPeriodicStart ((AT91_REG *) 	0x00700040) /* (UHPHS_OHCI) Periodic Start*/
#define AT91C_OHCI_HcInterruptStatus ((AT91_REG *) 	0x0070000C) /* (UHPHS_OHCI) Interrupt Status Register*/
#define AT91C_OHCI_HcRhDescriptorB ((AT91_REG *) 	0x0070004C) /* (UHPHS_OHCI) Root Hub characteristics B*/
#define AT91C_OHCI_HcInterruptDisable ((AT91_REG *) 	0x00700014) /* (UHPHS_OHCI) Interrupt Disable Register*/
#define AT91C_OHCI_HcPeriodCurrentED ((AT91_REG *) 	0x0070001C) /* (UHPHS_OHCI) Current Isochronous or Interrupt Endpoint Descriptor*/
#define AT91C_OHCI_HcRhDescriptorA ((AT91_REG *) 	0x00700048) /* (UHPHS_OHCI) Root Hub characteristics A*/
#define AT91C_OHCI_HcRhStatus ((AT91_REG *) 	0x00700050) /* (UHPHS_OHCI) Root Hub Status register*/
#define AT91C_OHCI_HcBulkCurrentED ((AT91_REG *) 	0x0070002C) /* (UHPHS_OHCI) Current endpoint of the Bulk list*/
#define AT91C_OHCI_HcControlHeadED ((AT91_REG *) 	0x00700020) /* (UHPHS_OHCI) First Endpoint Descriptor of the Control list*/
#define AT91C_OHCI_HcLSThreshold ((AT91_REG *) 	0x00700044) /* (UHPHS_OHCI) LS Threshold*/
#define AT91C_OHCI_HcRevision ((AT91_REG *) 	0x00700000) /* (UHPHS_OHCI) Revision*/
#define AT91C_OHCI_HcBulkDoneHead ((AT91_REG *) 	0x00700030) /* (UHPHS_OHCI) Last completed transfer descriptor*/
#define AT91C_OHCI_HcFmNumber ((AT91_REG *) 	0x0070003C) /* (UHPHS_OHCI) Frame number*/
#define AT91C_OHCI_HcFmInterval ((AT91_REG *) 	0x00700034) /* (UHPHS_OHCI) Bit time between 2 consecutive SOFs*/
#define AT91C_OHCI_HcBulkHeadED ((AT91_REG *) 	0x00700028) /* (UHPHS_OHCI) First endpoint register of the Bulk list*/
#define AT91C_OHCI_HcHCCA ((AT91_REG *) 	0x00700018) /* (UHPHS_OHCI) Pointer to the Host Controller Communication Area*/
#define AT91C_OHCI_HcCommandStatus ((AT91_REG *) 	0x00700008) /* (UHPHS_OHCI) Command & status Register*/
#define AT91C_OHCI_HcControlCurrentED ((AT91_REG *) 	0x00700024) /* (UHPHS_OHCI) Endpoint Control and Status Register*/
