una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* ========== Register definition for UHPHS_EHCI peripheral ========== */
#define AT91C_EHCI_USBSTS ((AT91_REG *) 	0x00800014) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG03 ((AT91_REG *) 	0x0080009C) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG00 ((AT91_REG *) 	0x00800090) /* (UHPHS_EHCI) */
#define AT91C_EHCI_HCSPPORTROUTE ((AT91_REG *) 	0x0080000C) /* (UHPHS_EHCI) */
#define AT91C_EHCI_FRINDEX ((AT91_REG *) 	0x0080001C) /* (UHPHS_EHCI) */
#define AT91C_EHCI_CONFIGFLAG ((AT91_REG *) 	0x00800050) /* (UHPHS_EHCI) */
#define AT91C_EHCI_HCCPARAMS ((AT91_REG *) 	0x00800008) /* (UHPHS_EHCI) */
#define AT91C_EHCI_USBINTR ((AT91_REG *) 	0x00800018) /* (UHPHS_EHCI) */
#define AT91C_EHCI_PORTSC ((AT91_REG *) 	0x00800054) /* (UHPHS_EHCI) */
#define AT91C_EHCI_CTRLDSSEGMENT ((AT91_REG *) 	0x00800020) /* (UHPHS_EHCI) */
#define AT91C_EHCI_VERSION ((AT91_REG *) 	0x00800000) /* (UHPHS_EHCI) */
#define AT91C_EHCI_USBCMD ((AT91_REG *) 	0x00800010) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG04 ((AT91_REG *) 	0x008000A0) /* (UHPHS_EHCI) */
#define AT91C_EHCI_PERIODICLISTBASE ((AT91_REG *) 	0x00800024) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG01 ((AT91_REG *) 	0x00800094) /* (UHPHS_EHCI) */
#define AT91C_EHCI_HCSPARAMS ((AT91_REG *) 	0x00800004) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG05 ((AT91_REG *) 	0x008000A4) /* (UHPHS_EHCI) */
#define AT91C_EHCI_ASYNCLISTADDR ((AT91_REG *) 	0x00800028) /* (UHPHS_EHCI) */
#define AT91C_EHCI_INSNREG02 ((AT91_REG *) 	0x00800098) /* (UHPHS_EHCI) */
/* ========== Register definition for AES peripheral ========== */
#define AT91C_AES_IVxR  ((AT91_REG *) 	0xFFFC0060) /* (AES) Initialization Vector x Register*/
#define AT91C_AES_KEYWxR ((AT91_REG *) 	0xFFFC0020) /* (AES) Key Word x Register*/
#define AT91C_AES_CR    ((AT91_REG *) 	0xFFFC0000) /* (AES) Control Register*/
#define AT91C_AES_IER   ((AT91_REG *) 	0xFFFC0010) /* (AES) Interrupt Enable Register*/
#define AT91C_AES_IDATAxR ((AT91_REG *) 	0xFFFC0040) /* (AES) Input Data x Register*/
#define AT91C_AES_MR    ((AT91_REG *) 	0xFFFC0004) /* (AES) Mode Register*/
#define AT91C_AES_IDR   ((AT91_REG *) 	0xFFFC0014) /* (AES) Interrupt Disable Register*/
#define AT91C_AES_IMR   ((AT91_REG *) 	0xFFFC0018) /* (AES) Interrupt Mask Register*/
#define AT91C_AES_ODATAxR ((AT91_REG *) 	0xFFFC0050) /* (AES) Output Data x Register*/
#define AT91C_AES_ISR   ((AT91_REG *) 	0xFFFC001C) /* (AES) Interrupt Status Register*/
#define AT91C_AES_VR    ((AT91_REG *) 	0xFFFC00FC) /* (AES) AES Version Register*/
/* ========== Register definition for TDES peripheral ========== */
#define AT91C_TDES_IDR  ((AT91_REG *) 	0xFFFC4014) /* (TDES) Interrupt Disable Register*/
#define AT91C_TDES_ISR  ((AT91_REG *) 	0xFFFC401C) /* (TDES) Interrupt Status Register*/
#define AT91C_TDES_KEY2WxR ((AT91_REG *) 	0xFFFC4028) /* (TDES) Key 2 Word x Register*/
#define AT91C_TDES_KEY3WxR ((AT91_REG *) 	0xFFFC4030) /* (TDES) Key 3 Word x Register*/
#define AT91C_TDES_IMR  ((AT91_REG *) 	0xFFFC4018) /* (TDES) Interrupt Mask Register*/
#define AT91C_TDES_KEY1WxR ((AT91_REG *) 	0xFFFC4020) /* (TDES) Key 1 Word x Register*/
#define AT91C_TDES_VR   ((AT91_REG *) 	0xFFFC40FC) /* (TDES) TDES Version Register*/
#define AT91C_TDES_IER  ((AT91_REG *) 	0xFFFC4010) /* (TDES) Interrupt Enable Register*/
#define AT91C_TDES_IVxR ((AT91_REG *) 	0xFFFC4060) /* (TDES) Initialization Vector x Register*/
#define AT91C_TDES_IDATAxR ((AT91_REG *) 	0xFFFC4040) /* (TDES) Input Data x Register*/
#define AT91C_TDES_CR   ((AT91_REG *) 	0xFFFC4000) /* (TDES) Control Register*/
#define AT91C_TDES_MR   ((AT91_REG *) 	0xFFFC4004) /* (TDES) Mode Register*/
#define AT91C_TDES_ODATAxR ((AT91_REG *) 	0xFFFC4050) /* (TDES) Output Data x Register*/
/* ========== Register definition for PDC_TDES peripheral ========== */
#define AT91C_TDES_RNCR ((AT91_REG *) 	0xFFFC4114) /* (PDC_TDES) Receive Next Counter Register*/
#define AT91C_TDES_PTCR ((AT91_REG *) 	0xFFFC4120) /* (PDC_TDES) PDC Transfer Control Register*/
#define AT91C_TDES_TCR  ((AT91_REG *) 	0xFFFC410C) /* (PDC_TDES) Transmit Counter Register*/
#define AT91C_TDES_PTSR ((AT91_REG *) 	0xFFFC4124) /* (PDC_TDES) PDC Transfer Status Register*/
#define AT91C_TDES_TNPR ((AT91_REG *) 	0xFFFC4118) /* (PDC_TDES) Transmit Next Pointer Register*/
#define AT91C_TDES_RCR  ((AT91_REG *) 	0xFFFC4104) /* (PDC_TDES) Receive Counter Register*/
#define AT91C_TDES_RNPR ((AT91_REG *) 	0xFFFC4110) /* (PDC_TDES) Receive Next Pointer Register*/
#define AT91C_TDES_RPR  ((AT91_REG *) 	0xFFFC4100) /* (PDC_TDES) Receive Pointer Register*/
#define AT91C_TDES_TNCR ((AT91_REG *) 	0xFFFC411C) /* (PDC_TDES) Transmit Next Counter Register*/
#define AT91C_TDES_TPR  ((AT91_REG *) 	0xFFFC4108) /* (PDC_TDES) Transmit Pointer Register*/
/* ========== Register definition for SHA peripheral ========== */
#define AT91C_SHA_IMR   ((AT91_REG *) 	0xFFFC8018) /* (SHA) Interrupt Mask Register*/
#define AT91C_SHA_IER   ((AT91_REG *) 	0xFFFC8010) /* (SHA) Interrupt Enable Register*/
#define AT91C_SHA_VR    ((AT91_REG *) 	0xFFFC80FC) /* (SHA) SHA Version Register*/
#define AT91C_SHA_CR    ((AT91_REG *) 	0xFFFC8000) /* (SHA) Control Register*/
#define AT91C_SHA_MR    ((AT91_REG *) 	0xFFFC8004) /* (SHA) Mode Register*/
#define AT91C_SHA_IDR   ((AT91_REG *) 	0xFFFC8014) /* (SHA) Interrupt Disable Register*/
#define AT91C_SHA_ISR   ((AT91_REG *) 	0xFFFC801C) /* (SHA) Interrupt Status Register*/
#define AT91C_SHA_IDATAxR ((AT91_REG *) 	0xFFFC8040) /* (SHA) Input Data x Register*/
#define AT91C_SHA_ODATAxR ((AT91_REG *) 	0xFFFC8080) /* (SHA) Output Data x Register*/
/* ========== Register definition for PDC_SHA peripheral ========== */
#define AT91C_SHA_PTCR  ((AT91_REG *) 	0xFFFC8120) /* (PDC_SHA) PDC Transfer Control Register*/
#define AT91C_SHA_TCR   ((AT91_REG *) 	0xFFFC810C) /* (PDC_SHA) Transmit Counter Register*/
#define AT91C_SHA_RPR   ((AT91_REG *) 	0xFFFC8100) /* (PDC_SHA) Receive Pointer Register*/
#define AT91C_SHA_TPR   ((AT91_REG *) 	0xFFFC8108) /* (PDC_SHA) Transmit Pointer Register*/
#define AT91C_SHA_PTSR  ((AT91_REG *) 	0xFFFC8124) /* (PDC_SHA) PDC Transfer Status Register*/
#define AT91C_SHA_RNCR  ((AT91_REG *) 	0xFFFC8114) /* (PDC_SHA) Receive Next Counter Register*/
#define AT91C_SHA_TNPR  ((AT91_REG *) 	0xFFFC8118) /* (PDC_SHA) Transmit Next Pointer Register*/
#define AT91C_SHA_RCR   ((AT91_REG *) 	0xFFFC8104) /* (PDC_SHA) Receive Counter Register*/
#define AT91C_SHA_RNPR  ((AT91_REG *) 	0xFFFC8110) /* (PDC_SHA) Receive Next Pointer Register*/
#define AT91C_SHA_TNCR  ((AT91_REG *) 	0xFFFC811C) /* (PDC_SHA) Transmit Next Counter Register*/
/* ========== Register definition for TRNG peripheral ========== */
#define AT91C_TRNG_IDR  ((AT91_REG *) 	0xFFFCC014) /* (TRNG) Interrupt Disable Register*/
#define AT91C_TRNG_IER  ((AT91_REG *) 	0xFFFCC010) /* (TRNG) Interrupt Enable Register*/
#define AT91C_TRNG_VERSION ((AT91_REG *) 	0xFFFCC0FC) /* (TRNG) TRNG Version Register*/
#define AT91C_TRNG_ISR  ((AT91_REG *) 	0xFFFCC01C) /* (TRNG) Interrupt Status Register*/
#define AT91C_TRNG_CR   ((AT91_REG *) 	0xFFFCC000) /* (TRNG) Control Register*/
#define AT91C_TRNG_ODATA ((AT91_REG *) 	0xFFFCC050) /* (TRNG) Output Data Register*/
#define AT91C_TRNG_IMR  ((AT91_REG *) 	0xFFFCC018) /* (TRNG) Interrupt Mask Register*/

