una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
#define AT91C_PE10_LCDD3    ((unsigned int) AT91C_PIO_PE10) /*  */
#define AT91C_PE10_LCDD5    ((unsigned int) AT91C_PIO_PE10) /*  */
#define AT91C_PIO_PE11       ((unsigned int) 1 << 11) /* Pin Controlled by PE11*/
#define AT91C_PE11_LCDD4    ((unsigned int) AT91C_PIO_PE11) /*  */
#define AT91C_PE11_LCDD6    ((unsigned int) AT91C_PIO_PE11) /*  */
#define AT91C_PIO_PE12       ((unsigned int) 1 << 12) /* Pin Controlled by PE12*/
#define AT91C_PE12_LCDD5    ((unsigned int) AT91C_PIO_PE12) /*  */
#define AT91C_PE12_LCDD7    ((unsigned int) AT91C_PIO_PE12) /*  */
#define AT91C_PIO_PE13       ((unsigned int) 1 << 13) /* Pin Controlled by PE13*/
#define AT91C_PE13_LCDD6    ((unsigned int) AT91C_PIO_PE13) /*  */
#define AT91C_PE13_LCDD10   ((unsigned int) AT91C_PIO_PE13) /*  */
#define AT91C_PIO_PE14       ((unsigned int) 1 << 14) /* Pin Controlled by PE14*/
#define AT91C_PE14_LCDD7    ((unsigned int) AT91C_PIO_PE14) /*  */
#define AT91C_PE14_LCDD11   ((unsigned int) AT91C_PIO_PE14) /*  */
#define AT91C_PIO_PE15       ((unsigned int) 1 << 15) /* Pin Controlled by PE15*/
#define AT91C_PE15_LCDD8    ((unsigned int) AT91C_PIO_PE15) /*  */
#define AT91C_PE15_LCDD12   ((unsigned int) AT91C_PIO_PE15) /*  */
#define AT91C_PIO_PE16       ((unsigned int) 1 << 16) /* Pin Controlled by PE16*/
#define AT91C_PE16_LCDD9    ((unsigned int) AT91C_PIO_PE16) /*  */
#define AT91C_PE16_LCDD13   ((unsigned int) AT91C_PIO_PE16) /*  */
#define AT91C_PIO_PE17       ((unsigned int) 1 << 17) /* Pin Controlled by PE17*/
#define AT91C_PE17_LCDD10   ((unsigned int) AT91C_PIO_PE17) /*  */
#define AT91C_PE17_LCDD14   ((unsigned int) AT91C_PIO_PE17) /*  */
#define AT91C_PIO_PE18       ((unsigned int) 1 << 18) /* Pin Controlled by PE18*/
#define AT91C_PE18_LCDD11   ((unsigned int) AT91C_PIO_PE18) /*  */
#define AT91C_PE18_LCDD15   ((unsigned int) AT91C_PIO_PE18) /*  */
#define AT91C_PIO_PE19       ((unsigned int) 1 << 19) /* Pin Controlled by PE19*/
#define AT91C_PE19_LCDD12   ((unsigned int) AT91C_PIO_PE19) /*  */
#define AT91C_PE19_LCDD18   ((unsigned int) AT91C_PIO_PE19) /*  */
#define AT91C_PIO_PE2        ((unsigned int) 1 <<  2) /* Pin Controlled by PE2*/
#define AT91C_PE2_LCDCC    ((unsigned int) AT91C_PIO_PE2) /*  */
#define AT91C_PIO_PE20       ((unsigned int) 1 << 20) /* Pin Controlled by PE20*/
#define AT91C_PE20_LCDD13   ((unsigned int) AT91C_PIO_PE20) /*  */
#define AT91C_PE20_LCDD19   ((unsigned int) AT91C_PIO_PE20) /*  */
#define AT91C_PIO_PE21       ((unsigned int) 1 << 21) /* Pin Controlled by PE21*/
#define AT91C_PE21_LCDD14   ((unsigned int) AT91C_PIO_PE21) /*  */
#define AT91C_PE21_LCDD20   ((unsigned int) AT91C_PIO_PE21) /*  */
#define AT91C_PIO_PE22       ((unsigned int) 1 << 22) /* Pin Controlled by PE22*/
#define AT91C_PE22_LCDD15   ((unsigned int) AT91C_PIO_PE22) /*  */
#define AT91C_PE22_LCDD21   ((unsigned int) AT91C_PIO_PE22) /*  */
#define AT91C_PIO_PE23       ((unsigned int) 1 << 23) /* Pin Controlled by PE23*/
#define AT91C_PE23_LCDD16   ((unsigned int) AT91C_PIO_PE23) /*  */
#define AT91C_PE23_LCDD22   ((unsigned int) AT91C_PIO_PE23) /*  */
#define AT91C_PIO_PE24       ((unsigned int) 1 << 24) /* Pin Controlled by PE24*/
#define AT91C_PE24_LCDD17   ((unsigned int) AT91C_PIO_PE24) /*  */
#define AT91C_PE24_LCDD23   ((unsigned int) AT91C_PIO_PE24) /*  */
#define AT91C_PIO_PE25       ((unsigned int) 1 << 25) /* Pin Controlled by PE25*/
#define AT91C_PE25_LCDD18   ((unsigned int) AT91C_PIO_PE25) /*  */
#define AT91C_PIO_PE26       ((unsigned int) 1 << 26) /* Pin Controlled by PE26*/
#define AT91C_PE26_LCDD19   ((unsigned int) AT91C_PIO_PE26) /*  */
#define AT91C_PIO_PE27       ((unsigned int) 1 << 27) /* Pin Controlled by PE27*/
#define AT91C_PE27_LCDD20   ((unsigned int) AT91C_PIO_PE27) /*  */
#define AT91C_PIO_PE28       ((unsigned int) 1 << 28) /* Pin Controlled by PE28*/
#define AT91C_PE28_LCDD21   ((unsigned int) AT91C_PIO_PE28) /*  */
#define AT91C_PIO_PE29       ((unsigned int) 1 << 29) /* Pin Controlled by PE29*/
#define AT91C_PE29_LCDD22   ((unsigned int) AT91C_PIO_PE29) /*  */
#define AT91C_PIO_PE3        ((unsigned int) 1 <<  3) /* Pin Controlled by PE3*/
#define AT91C_PE3_LCDVSYNC ((unsigned int) AT91C_PIO_PE3) /*  */
#define AT91C_PIO_PE30       ((unsigned int) 1 << 30) /* Pin Controlled by PE30*/
#define AT91C_PE30_LCDD23   ((unsigned int) AT91C_PIO_PE30) /*  */
#define AT91C_PIO_PE31       ((unsigned int) 1 << 31) /* Pin Controlled by PE31*/
#define AT91C_PE31_PWM2     ((unsigned int) AT91C_PIO_PE31) /*  */
#define AT91C_PE31_PCK1     ((unsigned int) AT91C_PIO_PE31) /*  */
#define AT91C_PIO_PE4        ((unsigned int) 1 <<  4) /* Pin Controlled by PE4*/
#define AT91C_PE4_LCDHSYNC ((unsigned int) AT91C_PIO_PE4) /*  */
#define AT91C_PIO_PE5        ((unsigned int) 1 <<  5) /* Pin Controlled by PE5*/
#define AT91C_PE5_LCDDOTCK ((unsigned int) AT91C_PIO_PE5) /*  */
#define AT91C_PIO_PE6        ((unsigned int) 1 <<  6) /* Pin Controlled by PE6*/
#define AT91C_PE6_LCDDEN   ((unsigned int) AT91C_PIO_PE6) /*  */
#define AT91C_PIO_PE7        ((unsigned int) 1 <<  7) /* Pin Controlled by PE7*/
#define AT91C_PE7_LCDD0    ((unsigned int) AT91C_PIO_PE7) /*  */
#define AT91C_PE7_LCDD2    ((unsigned int) AT91C_PIO_PE7) /*  */
#define AT91C_PIO_PE8        ((unsigned int) 1 <<  8) /* Pin Controlled by PE8*/
#define AT91C_PE8_LCDD1    ((unsigned int) AT91C_PIO_PE8) /*  */
#define AT91C_PE8_LCDD3    ((unsigned int) AT91C_PIO_PE8) /*  */
#define AT91C_PIO_PE9        ((unsigned int) 1 <<  9) /* Pin Controlled by PE9*/
#define AT91C_PE9_LCDD2    ((unsigned int) AT91C_PIO_PE9) /*  */
#define AT91C_PE9_LCDD4    ((unsigned int) AT91C_PIO_PE9) /*  */

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM9264*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Controller*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_PIOD_E ((unsigned int)  5) /* Parallel IO Controller D and E*/
#define AT91C_ID_TRNG   ((unsigned int)  6) /* */
#define AT91C_ID_US0    ((unsigned int)  7) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  8) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  9) /* USART 2*/
#define AT91C_ID_US3    ((unsigned int) 10) /* USART 2*/
#define AT91C_ID_MCI0   ((unsigned int) 11) /* Multimedia Card Interface 0*/
#define AT91C_ID_TWI0   ((unsigned int) 12) /* TWI 0*/
#define AT91C_ID_TWI1   ((unsigned int) 13) /* TWI 1*/
#define AT91C_ID_SPI0   ((unsigned int) 14) /* Serial Peripheral Interface*/
#define AT91C_ID_SPI1   ((unsigned int) 15) /* Serial Peripheral Interface*/
#define AT91C_ID_SSC0   ((unsigned int) 16) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 17) /* Serial Synchronous Controller 1*/
#define AT91C_ID_TC     ((unsigned int) 18) /* Timer Counter 0, 1, 2, 3, 4, 5*/
#define AT91C_ID_PWMC   ((unsigned int) 19) /* Pulse Width Modulation Controller*/
#define AT91C_ID_TSADC  ((unsigned int) 20) /* Touch Screen Controller*/
#define AT91C_ID_HDMA   ((unsigned int) 21) /* HDMA*/
#define AT91C_ID_UHPHS  ((unsigned int) 22) /* USB Host High Speed*/
#define AT91C_ID_LCDC   ((unsigned int) 23) /* LCD Controller*/
#define AT91C_ID_AC97C  ((unsigned int) 24) /* AC97 Controller*/
#define AT91C_ID_EMAC   ((unsigned int) 25) /* Ethernet MAC*/
#define AT91C_ID_ISI    ((unsigned int) 26) /* Image Sensor Interface*/
#define AT91C_ID_UDPHS  ((unsigned int) 27) /* USB Device HS*/
#define AT91C_ID_TDES   ((unsigned int) 28) /* TDES/SHA/AES/TRNG*/
#define AT91C_ID_MCI1   ((unsigned int) 29) /* Multimedia Card Interface 1*/
#define AT91C_ID_VDEC   ((unsigned int) 30) /* Video Decoder*/
#define AT91C_ID_IRQ0   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ALL_INT   ((unsigned int) 0xFFFFFFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM9264*/
/* ******************************************************************************/
#define AT91C_BASE_SFR       ((AT91PS_SFR) 	0xFFF74000) /* (SFR) Base Address*/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFC000) /* (SYS) Base Address*/
#define AT91C_BASE_EBI       ((AT91PS_EBI) 	0xFFFFE200) /* (EBI) Base Address*/
#define AT91C_BASE_DDR2CP1   ((AT91PS_HDDRSDRC2) 	0xFFFFE400) /* (DDR2CP1) Base Address*/
#define AT91C_BASE_DDR2C     ((AT91PS_HDDRSDRC2) 	0xFFFFE600) /* (DDR2C) Base Address*/
#define AT91C_BASE_SMC       ((AT91PS_SMC) 	0xFFFFE800) /* (SMC) Base Address*/
#define AT91C_BASE_MATRIX    ((AT91PS_MATRIX) 	0xFFFFEA00) /* (MATRIX) Base Address*/
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0xFFFFEB10) /* (CCFG) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFEF00) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFEE00) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF200) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOC) Base Address*/
#define AT91C_BASE_PIOD      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOD) Base Address*/
#define AT91C_BASE_PIOE      ((AT91PS_PIO) 	0xFFFFFA00) /* (PIOE) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC1C) /* (CKGR) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) /* (SHDWC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0xFFFFFDB0) /* (RTC) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFF7C000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFF7C040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFF7C080) /* (TC2) Base Address*/
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0xFFFD4000) /* (TC3) Base Address*/
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0xFFFD4040) /* (TC4) Base Address*/
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0xFFFD4080) /* (TC5) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFF7C000) /* (TCB0) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFD4000) /* (TCB1) Base Address*/
#define AT91C_BASE_MCI0      ((AT91PS_MCI) 	0xFFF80000) /* (MCI0) Base Address*/
#define AT91C_BASE_MCI1      ((AT91PS_MCI) 	0xFFFD0000) /* (MCI1) Base Address*/
#define AT91C_BASE_TWI0      ((AT91PS_TWI) 	0xFFF84000) /* (TWI0) Base Address*/
#define AT91C_BASE_TWI1      ((AT91PS_TWI) 	0xFFF88000) /* (TWI1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFF8C100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFF8C000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFF90100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFF90000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFF94100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFF94000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0xFFF98100) /* (PDC_US3) Base Address*/
#define AT91C_BASE_US3       ((AT91PS_USART) 	0xFFF98000) /* (US3) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFF9C100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFF9C000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFFA0100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFFA0000) /* (SSC1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFB8200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFB8220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFB8240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFB8260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFB8000) /* (PWMC) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFA4100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFA4000) /* (SPI0) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFA8000) /* (SPI1) Base Address*/
#define AT91C_BASE_PDC_TSADC ((AT91PS_PDC) 	0xFFFB0100) /* (PDC_TSADC) Base Address*/
#define AT91C_BASE_TSADC     ((AT91PS_TSADC) 	0xFFFB0000) /* (TSADC) Base Address*/
#define AT91C_BASE_UDPHS_EPTFIFO ((AT91PS_UDPHS_EPTFIFO) 	0x00600000) /* (UDPHS_EPTFIFO) Base Address*/
#define AT91C_BASE_UDPHS_EPT_0 ((AT91PS_UDPHS_EPT) 	0xFFF78100) /* (UDPHS_EPT_0) Base Address*/
#define AT91C_BASE_UDPHS_EPT_1 ((AT91PS_UDPHS_EPT) 	0xFFF78120) /* (UDPHS_EPT_1) Base Address*/
#define AT91C_BASE_UDPHS_EPT_2 ((AT91PS_UDPHS_EPT) 	0xFFF78140) /* (UDPHS_EPT_2) Base Address*/
#define AT91C_BASE_UDPHS_EPT_3 ((AT91PS_UDPHS_EPT) 	0xFFF78160) /* (UDPHS_EPT_3) Base Address*/
#define AT91C_BASE_UDPHS_EPT_4 ((AT91PS_UDPHS_EPT) 	0xFFF78180) /* (UDPHS_EPT_4) Base Address*/
#define AT91C_BASE_UDPHS_EPT_5 ((AT91PS_UDPHS_EPT) 	0xFFF781A0) /* (UDPHS_EPT_5) Base Address*/
#define AT91C_BASE_UDPHS_EPT_6 ((AT91PS_UDPHS_EPT) 	0xFFF781C0) /* (UDPHS_EPT_6) Base Address*/
#define AT91C_BASE_UDPHS_DMA_1 ((AT91PS_UDPHS_DMA) 	0xFFF78310) /* (UDPHS_DMA_1) Base Address*/
#define AT91C_BASE_UDPHS_DMA_2 ((AT91PS_UDPHS_DMA) 	0xFFF78320) /* (UDPHS_DMA_2) Base Address*/
#define AT91C_BASE_UDPHS_DMA_3 ((AT91PS_UDPHS_DMA) 	0xFFF78330) /* (UDPHS_DMA_3) Base Address*/
#define AT91C_BASE_UDPHS_DMA_4 ((AT91PS_UDPHS_DMA) 	0xFFF78340) /* (UDPHS_DMA_4) Base Address*/
#define AT91C_BASE_UDPHS_DMA_5 ((AT91PS_UDPHS_DMA) 	0xFFF78350) /* (UDPHS_DMA_5) Base Address*/
#define AT91C_BASE_UDPHS_DMA_6 ((AT91PS_UDPHS_DMA) 	0xFFF78360) /* (UDPHS_DMA_6) Base Address*/
#define AT91C_BASE_UDPHS     ((AT91PS_UDPHS) 	0xFFF78000) /* (UDPHS) Base Address*/
#define AT91C_BASE_PDC_AC97C ((AT91PS_PDC) 	0xFFFAC100) /* (PDC_AC97C) Base Address*/
#define AT91C_BASE_AC97C     ((AT91PS_AC97C) 	0xFFFAC000) /* (AC97C) Base Address*/
#define AT91C_BASE_LCDC      ((AT91PS_LCDC) 	0x00500000) /* (LCDC) Base Address*/
#define AT91C_BASE_LCDC_16B_TFT ((AT91PS_LCDC) 	0x00500000) /* (LCDC_16B_TFT) Base Address*/
#define AT91C_BASE_HDMA_CH_0 ((AT91PS_HDMA_CH) 	0xFFFFEC3C) /* (HDMA_CH_0) Base Address*/
#define AT91C_BASE_HDMA_CH_1 ((AT91PS_HDMA_CH) 	0xFFFFEC64) /* (HDMA_CH_1) Base Address*/
#define AT91C_BASE_HDMA_CH_2 ((AT91PS_HDMA_CH) 	0xFFFFEC8C) /* (HDMA_CH_2) Base Address*/
#define AT91C_BASE_HDMA_CH_3 ((AT91PS_HDMA_CH) 	0xFFFFECB4) /* (HDMA_CH_3) Base Address*/
#define AT91C_BASE_HDMA_CH_4 ((AT91PS_HDMA_CH) 	0xFFFFECDC) /* (HDMA_CH_4) Base Address*/
#define AT91C_BASE_HDMA_CH_5 ((AT91PS_HDMA_CH) 	0xFFFFED04) /* (HDMA_CH_5) Base Address*/
#define AT91C_BASE_HDMA_CH_6 ((AT91PS_HDMA_CH) 	0xFFFFED2C) /* (HDMA_CH_6) Base Address*/
#define AT91C_BASE_HDMA_CH_7 ((AT91PS_HDMA_CH) 	0xFFFFED54) /* (HDMA_CH_7) Base Address*/
#define AT91C_BASE_HDMA      ((AT91PS_HDMA) 	0xFFFFEC00) /* (HDMA) Base Address*/
#define AT91C_BASE_HECC      ((AT91PS_ECC) 	0xFFFFE200) /* (HECC) Base Address*/
#define AT91C_BASE_EMACB     ((AT91PS_EMAC) 	0xFFFBC000) /* (EMACB) Base Address*/
#define AT91C_BASE_ISI       ((AT91PS_ISI) 	0xFFFB4000) /* (ISI) Base Address*/
#define AT91C_BASE_VDEC      ((AT91PS_VDEC) 	0x00900000) /* (VDEC) Base Address*/
#define AT91C_BASE_UHPHS_OHCI ((AT91PS_UHPHS_OHCI) 	0x00700000) /* (UHPHS_OHCI) Base Address*/
#define AT91C_BASE_UHPHS_EHCI ((AT91PS_UHPHS_EHCI) 	0x00800000) /* (UHPHS_EHCI) Base Address*/
#define AT91C_BASE_AES       ((AT91PS_AES) 	0xFFFC0000) /* (AES) Base Address*/
#define AT91C_BASE_TDES      ((AT91PS_TDES) 	0xFFFC4000) /* (TDES) Base Address*/
#define AT91C_BASE_PDC_TDES  ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_TDES) Base Address*/
#define AT91C_BASE_SHA       ((AT91PS_SHA) 	0xFFFC8000) /* (SHA) Base Address*/
#define AT91C_BASE_PDC_SHA   ((AT91PS_PDC) 	0xFFFC8100) /* (PDC_SHA) Base Address*/
#define AT91C_BASE_TRNG      ((AT91PS_TRNG) 	0xFFFCC000) /* (TRNG) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM9264*/
/* ******************************************************************************/
/* ITCM*/
#define AT91C_ITCM 	 ((char *) 	0x00100000) /* Maximum ITCM Area base address*/
#define AT91C_ITCM_SIZE	 ((unsigned int) 0x00008000) /* Maximum ITCM Area size in byte (32 Kbytes)*/
/* DTCM*/
#define AT91C_DTCM 	 ((char *) 	0x00200000) /* Maximum DTCM Area base address*/
#define AT91C_DTCM_SIZE	 ((unsigned int) 0x00010000) /* Maximum DTCM Area size in byte (64 Kbytes)*/
/* IRAM*/
#define AT91C_IRAM 	 ((char *) 	0x00300000) /* Maximum Internal SRAM base address*/
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00010000) /* Maximum Internal SRAM size in byte (64 Kbytes)*/
/* IRAM_MIN*/
#define AT91C_IRAM_MIN	 ((char *) 	0x00300000) /* Minimum Internal RAM base address*/
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00004000) /* Minimum Internal RAM size in byte (16 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00400000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00010000) /* Internal ROM size in byte (64 Kbytes)*/
/* EBI_CS0*/
#define AT91C_EBI_CS0	 ((char *) 	0x10000000) /* EBI Chip Select 0 base address*/
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI_CS1*/
#define AT91C_EBI_CS1	 ((char *) 	0x20000000) /* EBI Chip Select 1 base address*/
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM*/
#define AT91C_EBI_SDRAM	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) /* SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_SDRAM_16BIT*/
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI_SDRAM_32BIT*/
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x20000000) /* SDRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI_CS2*/
#define AT91C_EBI_CS2	 ((char *) 	0x30000000) /* EBI Chip Select 2 base address*/
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI_CS3*/
#define AT91C_EBI_CS3	 ((char *) 	0x40000000) /* EBI Chip Select 3 base address*/
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_SM*/
#define AT91C_EBI_SM	 ((char *) 	0x40000000) /* NANDFLASH on EBI Chip Select 3 base address*/
#define AT91C_EBI_SM_SIZE	 ((unsigned int) 0x10000000) /* NANDFLASH on EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_CS4*/
#define AT91C_EBI_CS4	 ((char *) 	0x50000000) /* EBI Chip Select 4 base address*/
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CF0*/
#define AT91C_EBI_CF0	 ((char *) 	0x50000000) /* CompactFlash 0 on EBI Chip Select 4 base address*/
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CS5*/
#define AT91C_EBI_CS5	 ((char *) 	0x60000000) /* EBI Chip Select 5 base address*/
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_CF1*/
#define AT91C_EBI_CF1	 ((char *) 	0x60000000) /* CompactFlash 1 on EBIChip Select 5 base address*/
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)*/
/* DDR2*/
#define AT91C_DDR2 	 ((char *) 	0x70000000) /* DDR2/LPDDR space base address*/
#define AT91C_DDR2_SIZE	 ((unsigned int) 0x10000000) /* DDR2/LPDDR space size in byte (262144 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

