una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* - ******************************************************************************/
/* - -------- SLCKSEL : (SYS Offset: 0x3d50) Slow Clock Selection Register -------- */
AT91C_SLCKSEL_RCEN        EQU (0x1 <<  0) ;- (SYS) Enable Internal RC Oscillator
AT91C_SLCKSEL_OSC32EN     EQU (0x1 <<  1) ;- (SYS) Enable External Oscillator
AT91C_SLCKSEL_OSC32BYP    EQU (0x1 <<  2) ;- (SYS) Bypass External Oscillator
AT91C_SLCKSEL_OSCSEL      EQU (0x1 <<  3) ;- (SYS) OSC Selection
/* - -------- GPBR : (SYS Offset: 0x3d60) GPBR General Purpose Register -------- */
AT91C_GPBR_GPRV           EQU (0x0 <<  0) ;- (SYS) General Purpose Register Value

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR External Bus Interface*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR DDR2/SDRAM Controller*/
/* - ******************************************************************************/
/* - -------- HDDRSDRC2_MR : (HDDRSDRC2 Offset: 0x0) Mode Register -------- */
AT91C_DDRC2_MODE          EQU (0x7 <<  0) ;- (HDDRSDRC2) DDR/SDRAM Command Mode
AT91C_DDRC2_MODE_NORMAL_CMD EQU (0x0) ;- (HDDRSDRC2) Normal Mode
AT91C_DDRC2_MODE_NOP_CMD  EQU (0x1) ;- (HDDRSDRC2) Issue a NOP Command at every access
AT91C_DDRC2_MODE_PRCGALL_CMD EQU (0x2) ;- (HDDRSDRC2) Issue a All Banks Precharge Command at every access
AT91C_DDRC2_MODE_LMR_CMD  EQU (0x3) ;- (HDDRSDRC2) Issue a Load Mode Register at every access
AT91C_DDRC2_MODE_RFSH_CMD EQU (0x4) ;- (HDDRSDRC2) Issue a Refresh
AT91C_DDRC2_MODE_EXT_LMR_CMD EQU (0x5) ;- (HDDRSDRC2) Issue an Extended Load Mode Register
AT91C_DDRC2_MODE_DEEP_CMD EQU (0x6) ;- (HDDRSDRC2) Enter Deep Power Mode
AT91C_DDRC2_MODE_Reserved EQU (0x7) ;- (HDDRSDRC2) Reserved value
/* - -------- HDDRSDRC2_RTR : (HDDRSDRC2 Offset: 0x4) Refresh Timer Register -------- */
AT91C_DDRC2_COUNT         EQU (0xFFF <<  0) ;- (HDDRSDRC2) Refresh Timer Count
/* - -------- HDDRSDRC2_CR : (HDDRSDRC2 Offset: 0x8) Configuration Register -------- */
AT91C_DDRC2_NC            EQU (0x3 <<  0) ;- (HDDRSDRC2) Number of Column Bits
AT91C_DDRC2_NC_DDR9_SDR8  EQU (0x0) ;- (HDDRSDRC2) DDR 9 Bits | SDR 8 Bits
AT91C_DDRC2_NC_DDR10_SDR9 EQU (0x1) ;- (HDDRSDRC2) DDR 10 Bits | SDR 9 Bits
AT91C_DDRC2_NC_DDR11_SDR10 EQU (0x2) ;- (HDDRSDRC2) DDR 11 Bits | SDR 10 Bits
AT91C_DDRC2_NC_DDR12_SDR11 EQU (0x3) ;- (HDDRSDRC2) DDR 12 Bits | SDR 11 Bits
AT91C_DDRC2_NR            EQU (0x3 <<  2) ;- (HDDRSDRC2) Number of Row Bits
AT91C_DDRC2_NR_11         EQU (0x0 <<  2) ;- (HDDRSDRC2) 11 Bits
AT91C_DDRC2_NR_12         EQU (0x1 <<  2) ;- (HDDRSDRC2) 12 Bits
AT91C_DDRC2_NR_13         EQU (0x2 <<  2) ;- (HDDRSDRC2) 13 Bits
AT91C_DDRC2_NR_14         EQU (0x3 <<  2) ;- (HDDRSDRC2) 14 Bits
AT91C_DDRC2_CAS           EQU (0x7 <<  4) ;- (HDDRSDRC2) CAS Latency
AT91C_DDRC2_CAS_2         EQU (0x2 <<  4) ;- (HDDRSDRC2) 2 cycles (DDR1/SDR)
AT91C_DDRC2_CAS_3         EQU (0x3 <<  4) ;- (HDDRSDRC2) 3 cycles (DDR2/DDR1/SDR)
AT91C_DDRC2_CAS_4         EQU (0x4 <<  4) ;- (HDDRSDRC2) 4 cycles (DDR2)
AT91C_DDRC2_CAS_2_5       EQU (0x6 <<  4) ;- (HDDRSDRC2) 2.5 cycles (DDR1)
AT91C_DDRC2_DLL           EQU (0x1 <<  7) ;- (HDDRSDRC2) DLL Reset
AT91C_DDRC2_DLL_RESET_DISABLED EQU (0x0 <<  7) ;- (HDDRSDRC2) DLL normal mode
AT91C_DDRC2_DLL_RESET_ENABLED EQU (0x1 <<  7) ;- (HDDRSDRC2) Reset DLL
AT91C_DDRC2_DIC_DS        EQU (0x1 <<  8) ;- (HDDRSDRC2) Output driver impedance control
AT91C_DDRC2_OCD           EQU (0x7 << 12) ;- (HDDRSDRC2) Off chip driver
AT91C_DDRC2_OCD_EXIT      EQU (0x0 << 12) ;- (HDDRSDRC2) Exit OCD calibration mode.
AT91C_DDRC2_OCD_DEFAULT   EQU (0x7 << 12) ;- (HDDRSDRC2) Program OCD calibration default value.
AT91C_DDRC2_DQMS          EQU (0x1 << 16) ;- (HDDRSDRC2) Data Mask share
AT91C_DDRC2_DQMS_NOT_SHARED EQU (0x0 << 16) ;- (HDDRSDRC2) Used DQM bits are not shared
AT91C_DDRC2_DQMS_SHARED   EQU (0x1 << 16) ;- (HDDRSDRC2) Used DQM bits are shared
AT91C_DDRC2_ENRDM         EQU (0x1 << 17) ;- (HDDRSDRC2) DQS/DATA phase error correction
AT91C_DDRC2_ENRDM_OFF     EQU (0x0 << 17) ;- (HDDRSDRC2) phase error correction disabled
AT91C_DDRC2_ENRDM_ON      EQU (0x1 << 17) ;- (HDDRSDRC2) phase error correction enabled
/* - -------- HDDRSDRC2_T0PR : (HDDRSDRC2 Offset: 0xc) Timing0 Register -------- */
AT91C_DDRC2_TRAS          EQU (0xF <<  0) ;- (HDDRSDRC2) Active to precharge delay
AT91C_DDRC2_TRAS_0        EQU (0x0) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRAS_1        EQU (0x1) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRAS_2        EQU (0x2) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRAS_3        EQU (0x3) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRAS_4        EQU (0x4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRAS_5        EQU (0x5) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRAS_6        EQU (0x6) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRAS_7        EQU (0x7) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRAS_8        EQU (0x8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRAS_9        EQU (0x9) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRAS_10       EQU (0xA) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRAS_11       EQU (0xB) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRAS_12       EQU (0xC) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRAS_13       EQU (0xD) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRAS_14       EQU (0xE) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRAS_15       EQU (0xF) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRCD          EQU (0xF <<  4) ;- (HDDRSDRC2) Row to column delay
AT91C_DDRC2_TRCD_0        EQU (0x0 <<  4) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRCD_1        EQU (0x1 <<  4) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRCD_2        EQU (0x2 <<  4) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRCD_3        EQU (0x3 <<  4) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRCD_4        EQU (0x4 <<  4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRCD_5        EQU (0x5 <<  4) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRCD_6        EQU (0x6 <<  4) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRCD_7        EQU (0x7 <<  4) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRCD_8        EQU (0x8 <<  4) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRCD_9        EQU (0x9 <<  4) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRCD_10       EQU (0xA <<  4) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRCD_11       EQU (0xB <<  4) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRCD_12       EQU (0xC <<  4) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRCD_13       EQU (0xD <<  4) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRCD_14       EQU (0xE <<  4) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRCD_15       EQU (0xF <<  4) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TWR           EQU (0xF <<  8) ;- (HDDRSDRC2) Write recovery delay
AT91C_DDRC2_TWR_0         EQU (0x0 <<  8) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TWR_1         EQU (0x1 <<  8) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TWR_2         EQU (0x2 <<  8) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TWR_3         EQU (0x3 <<  8) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TWR_4         EQU (0x4 <<  8) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TWR_5         EQU (0x5 <<  8) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TWR_6         EQU (0x6 <<  8) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TWR_7         EQU (0x7 <<  8) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TWR_8         EQU (0x8 <<  8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TWR_9         EQU (0x9 <<  8) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TWR_10        EQU (0xA <<  8) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TWR_11        EQU (0xB <<  8) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TWR_12        EQU (0xC <<  8) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TWR_13        EQU (0xD <<  8) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TWR_14        EQU (0xE <<  8) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TWR_15        EQU (0xF <<  8) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRC           EQU (0xF << 12) ;- (HDDRSDRC2) Row cycle delay
AT91C_DDRC2_TRC_0         EQU (0x0 << 12) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRC_1         EQU (0x1 << 12) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRC_2         EQU (0x2 << 12) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRC_3         EQU (0x3 << 12) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRC_4         EQU (0x4 << 12) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRC_5         EQU (0x5 << 12) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRC_6         EQU (0x6 << 12) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRC_7         EQU (0x7 << 12) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRC_8         EQU (0x8 << 12) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRC_9         EQU (0x9 << 12) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRC_10        EQU (0xA << 12) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRC_11        EQU (0xB << 12) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRC_12        EQU (0xC << 12) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRC_13        EQU (0xD << 12) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRC_14        EQU (0xE << 12) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRC_15        EQU (0xF << 12) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRP           EQU (0xF << 16) ;- (HDDRSDRC2) Row precharge delay
AT91C_DDRC2_TRP_0         EQU (0x0 << 16) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRP_1         EQU (0x1 << 16) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRP_2         EQU (0x2 << 16) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRP_3         EQU (0x3 << 16) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRP_4         EQU (0x4 << 16) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRP_5         EQU (0x5 << 16) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRP_6         EQU (0x6 << 16) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRP_7         EQU (0x7 << 16) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRP_8         EQU (0x8 << 16) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRP_9         EQU (0x9 << 16) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRP_10        EQU (0xA << 16) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRP_11        EQU (0xB << 16) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRP_12        EQU (0xC << 16) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRP_13        EQU (0xD << 16) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRP_14        EQU (0xE << 16) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRP_15        EQU (0xF << 16) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRRD          EQU (0xF << 20) ;- (HDDRSDRC2) Active bankA to Active bankB
AT91C_DDRC2_TRRD_0        EQU (0x0 << 20) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRRD_1        EQU (0x1 << 20) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRRD_2        EQU (0x2 << 20) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRRD_3        EQU (0x3 << 20) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRRD_4        EQU (0x4 << 20) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRRD_5        EQU (0x5 << 20) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRRD_6        EQU (0x6 << 20) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRRD_7        EQU (0x7 << 20) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRRD_8        EQU (0x8 << 20) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRRD_9        EQU (0x9 << 20) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRRD_10       EQU (0xA << 20) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRRD_11       EQU (0xB << 20) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRRD_12       EQU (0xC << 20) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRRD_13       EQU (0xD << 20) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRRD_14       EQU (0xE << 20) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRRD_15       EQU (0xF << 20) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TWTR          EQU (0x1 << 24) ;- (HDDRSDRC2) Internal write to read delay
AT91C_DDRC2_TWTR_0        EQU (0x0 << 24) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TWTR_1        EQU (0x1 << 24) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TMRD          EQU (0xF << 28) ;- (HDDRSDRC2) Load mode register command to active or refresh command
AT91C_DDRC2_TMRD_0        EQU (0x0 << 28) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TMRD_1        EQU (0x1 << 28) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TMRD_2        EQU (0x2 << 28) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TMRD_3        EQU (0x3 << 28) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TMRD_4        EQU (0x4 << 28) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TMRD_5        EQU (0x5 << 28) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TMRD_6        EQU (0x6 << 28) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TMRD_7        EQU (0x7 << 28) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TMRD_8        EQU (0x8 << 28) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TMRD_9        EQU (0x9 << 28) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TMRD_10       EQU (0xA << 28) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TMRD_11       EQU (0xB << 28) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TMRD_12       EQU (0xC << 28) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TMRD_13       EQU (0xD << 28) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TMRD_14       EQU (0xE << 28) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TMRD_15       EQU (0xF << 28) ;- (HDDRSDRC2) Value : 15
/* - -------- HDDRSDRC2_T1PR : (HDDRSDRC2 Offset: 0x10) Timing1 Register -------- */
AT91C_DDRC2_TRFC          EQU (0x1F <<  0) ;- (HDDRSDRC2) row cycle delay
AT91C_DDRC2_TRFC_0        EQU (0x0) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRFC_1        EQU (0x1) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRFC_2        EQU (0x2) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRFC_3        EQU (0x3) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRFC_4        EQU (0x4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRFC_5        EQU (0x5) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRFC_6        EQU (0x6) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRFC_7        EQU (0x7) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRFC_8        EQU (0x8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRFC_9        EQU (0x9) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRFC_10       EQU (0xA) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRFC_11       EQU (0xB) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRFC_12       EQU (0xC) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRFC_13       EQU (0xD) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRFC_14       EQU (0xE) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRFC_15       EQU (0xF) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRFC_16       EQU (0x10) ;- (HDDRSDRC2) Value : 16
AT91C_DDRC2_TRFC_17       EQU (0x11) ;- (HDDRSDRC2) Value : 17
AT91C_DDRC2_TRFC_18       EQU (0x12) ;- (HDDRSDRC2) Value : 18
AT91C_DDRC2_TRFC_19       EQU (0x13) ;- (HDDRSDRC2) Value : 19
AT91C_DDRC2_TRFC_20       EQU (0x14) ;- (HDDRSDRC2) Value : 20
AT91C_DDRC2_TRFC_21       EQU (0x15) ;- (HDDRSDRC2) Value : 21
AT91C_DDRC2_TRFC_22       EQU (0x16) ;- (HDDRSDRC2) Value : 22
AT91C_DDRC2_TRFC_23       EQU (0x17) ;- (HDDRSDRC2) Value : 23
AT91C_DDRC2_TRFC_24       EQU (0x18) ;- (HDDRSDRC2) Value : 24
AT91C_DDRC2_TRFC_25       EQU (0x19) ;- (HDDRSDRC2) Value : 25
AT91C_DDRC2_TRFC_26       EQU (0x1A) ;- (HDDRSDRC2) Value : 26
AT91C_DDRC2_TRFC_27       EQU (0x1B) ;- (HDDRSDRC2) Value : 27
AT91C_DDRC2_TRFC_28       EQU (0x1C) ;- (HDDRSDRC2) Value : 28
AT91C_DDRC2_TRFC_29       EQU (0x1D) ;- (HDDRSDRC2) Value : 29
AT91C_DDRC2_TRFC_30       EQU (0x1E) ;- (HDDRSDRC2) Value : 30
AT91C_DDRC2_TRFC_31       EQU (0x1F) ;- (HDDRSDRC2) Value : 31
AT91C_DDRC2_TXSNR         EQU (0xFF <<  8) ;- (HDDRSDRC2) Exit self refresh delay to Read command
AT91C_DDRC2_TXSNR_0       EQU (0x0 <<  8) ;- (HDDRSDRC2) Value :   0
AT91C_DDRC2_TXSNR_8       EQU (0x8 <<  8) ;- (HDDRSDRC2) Value :   8
AT91C_DDRC2_TXSNR_16      EQU (0x10 <<  8) ;- (HDDRSDRC2) Value :  16
AT91C_DDRC2_TXSNR_32      EQU (0x20 <<  8) ;- (HDDRSDRC2) Value :  32
AT91C_DDRC2_TXSNR_48      EQU (0x30 <<  8) ;- (HDDRSDRC2) Value :  48
AT91C_DDRC2_TXSNR_64      EQU (0x40 <<  8) ;- (HDDRSDRC2) Value :  64
AT91C_DDRC2_TXSNR_80      EQU (0x50 <<  8) ;- (HDDRSDRC2) Value :  80
AT91C_DDRC2_TXSNR_96      EQU (0x60 <<  8) ;- (HDDRSDRC2) Value :  96
AT91C_DDRC2_TXSNR_112     EQU (0x70 <<  8) ;- (HDDRSDRC2) Value : 112
AT91C_DDRC2_TXSNR_128     EQU (0x80 <<  8) ;- (HDDRSDRC2) Value : 128
AT91C_DDRC2_TXSNR_144     EQU (0x90 <<  8) ;- (HDDRSDRC2) Value : 144
AT91C_DDRC2_TXSNR_160     EQU (0xA0 <<  8) ;- (HDDRSDRC2) Value : 160
AT91C_DDRC2_TXSNR_176     EQU (0xB0 <<  8) ;- (HDDRSDRC2) Value : 176
AT91C_DDRC2_TXSNR_192     EQU (0xC0 <<  8) ;- (HDDRSDRC2) Value : 192
AT91C_DDRC2_TXSNR_208     EQU (0xD0 <<  8) ;- (HDDRSDRC2) Value : 208
AT91C_DDRC2_TXSNR_224     EQU (0xE0 <<  8) ;- (HDDRSDRC2) Value : 224
AT91C_DDRC2_TXSNR_240     EQU (0xF0 <<  8) ;- (HDDRSDRC2) Value : 240
AT91C_DDRC2_TXSNR_255     EQU (0xFF <<  8) ;- (HDDRSDRC2) Value : 255
AT91C_DDRC2_TXSRD         EQU (0xFF << 16) ;- (HDDRSDRC2) Exit self refresh delay to Read command
AT91C_DDRC2_TXSRD_0       EQU (0x0 << 16) ;- (HDDRSDRC2) Value :   0
AT91C_DDRC2_TXSRD_8       EQU (0x8 << 16) ;- (HDDRSDRC2) Value :   8
AT91C_DDRC2_TXSRD_16      EQU (0x10 << 16) ;- (HDDRSDRC2) Value :  16
AT91C_DDRC2_TXSRD_32      EQU (0x20 << 16) ;- (HDDRSDRC2) Value :  32
AT91C_DDRC2_TXSRD_48      EQU (0x30 << 16) ;- (HDDRSDRC2) Value :  48
AT91C_DDRC2_TXSRD_64      EQU (0x40 << 16) ;- (HDDRSDRC2) Value :  64
AT91C_DDRC2_TXSRD_80      EQU (0x50 << 16) ;- (HDDRSDRC2) Value :  80
AT91C_DDRC2_TXSRD_96      EQU (0x60 << 16) ;- (HDDRSDRC2) Value :  96
AT91C_DDRC2_TXSRD_112     EQU (0x70 << 16) ;- (HDDRSDRC2) Value : 112
AT91C_DDRC2_TXSRD_128     EQU (0x80 << 16) ;- (HDDRSDRC2) Value : 128
AT91C_DDRC2_TXSRD_144     EQU (0x90 << 16) ;- (HDDRSDRC2) Value : 144
AT91C_DDRC2_TXSRD_160     EQU (0xA0 << 16) ;- (HDDRSDRC2) Value : 160
AT91C_DDRC2_TXSRD_176     EQU (0xB0 << 16) ;- (HDDRSDRC2) Value : 176
AT91C_DDRC2_TXSRD_192     EQU (0xC0 << 16) ;- (HDDRSDRC2) Value : 192
AT91C_DDRC2_TXSRD_208     EQU (0xD0 << 16) ;- (HDDRSDRC2) Value : 208
AT91C_DDRC2_TXSRD_224     EQU (0xE0 << 16) ;- (HDDRSDRC2) Value : 224
AT91C_DDRC2_TXSRD_240     EQU (0xF0 << 16) ;- (HDDRSDRC2) Value : 240
AT91C_DDRC2_TXSRD_255     EQU (0xFF << 16) ;- (HDDRSDRC2) Value : 255
AT91C_DDRC2_TXP           EQU (0xF << 24) ;- (HDDRSDRC2) Exit Power-down delay to first command
AT91C_DDRC2_TXP_0         EQU (0x0 << 24) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TXP_1         EQU (0x1 << 24) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TXP_2         EQU (0x2 << 24) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TXP_3         EQU (0x3 << 24) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TXP_4         EQU (0x4 << 24) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TXP_5         EQU (0x5 << 24) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TXP_6         EQU (0x6 << 24) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TXP_7         EQU (0x7 << 24) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TXP_8         EQU (0x8 << 24) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TXP_9         EQU (0x9 << 24) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TXP_10        EQU (0xA << 24) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TXP_11        EQU (0xB << 24) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TXP_12        EQU (0xC << 24) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TXP_13        EQU (0xD << 24) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TXP_14        EQU (0xE << 24) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TXP_15        EQU (0xF << 24) ;- (HDDRSDRC2) Value : 15
/* - -------- HDDRSDRC2_T2PR : (HDDRSDRC2 Offset: 0x14) Timing2 Register -------- */
AT91C_DDRC2_TXARD         EQU (0xF <<  0) ;- (HDDRSDRC2) Exit active power down delay to read command in 'Fast Exit' mode.
AT91C_DDRC2_TXARD_0       EQU (0x0) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TXARD_1       EQU (0x1) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TXARD_2       EQU (0x2) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TXARD_3       EQU (0x3) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TXARD_4       EQU (0x4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TXARD_5       EQU (0x5) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TXARD_6       EQU (0x6) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TXARD_7       EQU (0x7) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TXARD_8       EQU (0x8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TXARD_9       EQU (0x9) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TXARD_10      EQU (0xA) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TXARD_11      EQU (0xB) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TXARD_12      EQU (0xC) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TXARD_13      EQU (0xD) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TXARD_14      EQU (0xE) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TXARD_15      EQU (0xF) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TXARDS        EQU (0xF <<  8) ;- (HDDRSDRC2) Exit active power down delay to read command in 'Slow Exit' mode.
AT91C_DDRC2_TXARDS_0      EQU (0x0 <<  8) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TXARDS_1      EQU (0x1 <<  8) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TXARDS_2      EQU (0x2 <<  8) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TXARDS_3      EQU (0x3 <<  8) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TXARDS_4      EQU (0x4 <<  8) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TXARDS_5      EQU (0x5 <<  8) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TXARDS_6      EQU (0x6 <<  8) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TXARDS_7      EQU (0x7 <<  8) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TXARDS_8      EQU (0x8 <<  8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TXARDS_9      EQU (0x9 <<  8) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TXARDS_10     EQU (0xA <<  8) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TXARDS_11     EQU (0xB <<  8) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TXARDS_12     EQU (0xC <<  8) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TXARDS_13     EQU (0xD <<  8) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TXARDS_14     EQU (0xE <<  8) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TXARDS_15     EQU (0xF <<  8) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRPA          EQU (0xF << 16) ;- (HDDRSDRC2) Row precharge all delay
AT91C_DDRC2_TRPA_0        EQU (0x0 << 16) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRPA_1        EQU (0x1 << 16) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRPA_2        EQU (0x2 << 16) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRPA_3        EQU (0x3 << 16) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRPA_4        EQU (0x4 << 16) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRPA_5        EQU (0x5 << 16) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRPA_6        EQU (0x6 << 16) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRPA_7        EQU (0x7 << 16) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRPA_8        EQU (0x8 << 16) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRPA_9        EQU (0x9 << 16) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRPA_10       EQU (0xA << 16) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRPA_11       EQU (0xB << 16) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRPA_12       EQU (0xC << 16) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRPA_13       EQU (0xD << 16) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRPA_14       EQU (0xE << 16) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TRPA_15       EQU (0xF << 16) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TRTP          EQU (0xF << 24) ;- (HDDRSDRC2) Read to Precharge delay
AT91C_DDRC2_TRTP_0        EQU (0x0 << 24) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TRTP_1        EQU (0x1 << 24) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TRTP_2        EQU (0x2 << 24) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TRTP_3        EQU (0x3 << 24) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TRTP_4        EQU (0x4 << 24) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TRTP_5        EQU (0x5 << 24) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TRTP_6        EQU (0x6 << 24) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TRTP_7        EQU (0x7 << 24) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TRTP_8        EQU (0x8 << 24) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TRTP_9        EQU (0x9 << 24) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TRTP_10       EQU (0xA << 24) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TRTP_11       EQU (0xB << 24) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TRTP_12       EQU (0xC << 24) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TRTP_13       EQU (0xD << 24) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TRTP_14       EQU (0xE << 24) ;- (HDDRSDRC2) Value : 14
