una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
AT91C_DDRC2_TRTP_15       EQU (0xF << 24) ;- (HDDRSDRC2) Value : 15
/* - -------- HDDRSDRC2_T3PR : (HDDRSDRC2 Offset: 0x18) Timing3 Register -------- */
AT91C_DDRC2_TANPD         EQU (0xF <<  0) ;- (HDDRSDRC2) ODT to power down entry
AT91C_DDRC2_TANPD_0       EQU (0x0) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TANPD_1       EQU (0x1) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TANPD_2       EQU (0x2) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TANPD_3       EQU (0x3) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TANPD_4       EQU (0x4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TANPD_5       EQU (0x5) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TANPD_6       EQU (0x6) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TANPD_7       EQU (0x7) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TANPD_8       EQU (0x8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TANPD_9       EQU (0x9) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TANPD_10      EQU (0xA) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TANPD_11      EQU (0xB) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TANPD_12      EQU (0xC) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TANPD_13      EQU (0xD) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TANPD_14      EQU (0xE) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TANPD_15      EQU (0xF) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TAXPD         EQU (0xF <<  4) ;- (HDDRSDRC2) ODT power down exit
AT91C_DDRC2_TAXPD_0       EQU (0x0 <<  4) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TAXPD_1       EQU (0x1 <<  4) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TAXPD_2       EQU (0x2 <<  4) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TAXPD_3       EQU (0x3 <<  4) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TAXPD_4       EQU (0x4 <<  4) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TAXPD_5       EQU (0x5 <<  4) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TAXPD_6       EQU (0x6 <<  4) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TAXPD_7       EQU (0x7 <<  4) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TAXPD_8       EQU (0x8 <<  4) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TAXPD_9       EQU (0x9 <<  4) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TAXPD_10      EQU (0xA <<  4) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TAXPD_11      EQU (0xB <<  4) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TAXPD_12      EQU (0xC <<  4) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TAXPD_13      EQU (0xD <<  4) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TAXPD_14      EQU (0xE <<  4) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TAXPD_15      EQU (0xF <<  4) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TAOFPD        EQU (0xF <<  8) ;- (HDDRSDRC2) ODT turn off in power down mode
AT91C_DDRC2_TAOFPD_0      EQU (0x0 <<  8) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TAOFPD_1      EQU (0x1 <<  8) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TAOFPD_2      EQU (0x2 <<  8) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TAOFPD_3      EQU (0x3 <<  8) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TAOFPD_4      EQU (0x4 <<  8) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TAOFPD_5      EQU (0x5 <<  8) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TAOFPD_6      EQU (0x6 <<  8) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TAOFPD_7      EQU (0x7 <<  8) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TAOFPD_8      EQU (0x8 <<  8) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TAOFPD_9      EQU (0x9 <<  8) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TAOFPD_10     EQU (0xA <<  8) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TAOFPD_11     EQU (0xB <<  8) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TAOFPD_12     EQU (0xC <<  8) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TAOFPD_13     EQU (0xD <<  8) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TAOFPD_14     EQU (0xE <<  8) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TAOFPD_15     EQU (0xF <<  8) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TAOFD         EQU (0xF << 12) ;- (HDDRSDRC2) ODT turn off delay
AT91C_DDRC2_TAOFD_0       EQU (0x0 << 12) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TAOFD_1       EQU (0x1 << 12) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TAOFD_2       EQU (0x2 << 12) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TAOFD_3       EQU (0x3 << 12) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TAOFD_4       EQU (0x4 << 12) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TAOFD_5       EQU (0x5 << 12) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TAOFD_6       EQU (0x6 << 12) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TAOFD_7       EQU (0x7 << 12) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TAOFD_8       EQU (0x8 << 12) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TAOFD_9       EQU (0x9 << 12) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TAOFD_10      EQU (0xA << 12) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TAOFD_11      EQU (0xB << 12) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TAOFD_12      EQU (0xC << 12) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TAOFD_13      EQU (0xD << 12) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TAOFD_14      EQU (0xE << 12) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TAOFD_15      EQU (0xF << 12) ;- (HDDRSDRC2) Value : 15
AT91C_DDRC2_TAONPD        EQU (0xF << 16) ;- (HDDRSDRC2) ODT turn on in power down mode
AT91C_DDRC2_TAONPD_0      EQU (0x0 << 16) ;- (HDDRSDRC2) Value :  0
AT91C_DDRC2_TAONPD_1      EQU (0x1 << 16) ;- (HDDRSDRC2) Value :  1
AT91C_DDRC2_TAONPD_2      EQU (0x2 << 16) ;- (HDDRSDRC2) Value :  2
AT91C_DDRC2_TAONPD_3      EQU (0x3 << 16) ;- (HDDRSDRC2) Value :  3
AT91C_DDRC2_TAONPD_4      EQU (0x4 << 16) ;- (HDDRSDRC2) Value :  4
AT91C_DDRC2_TAONPD_5      EQU (0x5 << 16) ;- (HDDRSDRC2) Value :  5
AT91C_DDRC2_TAONPD_6      EQU (0x6 << 16) ;- (HDDRSDRC2) Value :  6
AT91C_DDRC2_TAONPD_7      EQU (0x7 << 16) ;- (HDDRSDRC2) Value :  7
AT91C_DDRC2_TAONPD_8      EQU (0x8 << 16) ;- (HDDRSDRC2) Value :  8
AT91C_DDRC2_TAONPD_9      EQU (0x9 << 16) ;- (HDDRSDRC2) Value :  9
AT91C_DDRC2_TAONPD_10     EQU (0xA << 16) ;- (HDDRSDRC2) Value : 10
AT91C_DDRC2_TAONPD_11     EQU (0xB << 16) ;- (HDDRSDRC2) Value : 11
AT91C_DDRC2_TAONPD_12     EQU (0xC << 16) ;- (HDDRSDRC2) Value : 12
AT91C_DDRC2_TAONPD_13     EQU (0xD << 16) ;- (HDDRSDRC2) Value : 13
AT91C_DDRC2_TAONPD_14     EQU (0xE << 16) ;- (HDDRSDRC2) Value : 14
AT91C_DDRC2_TAONPD_15     EQU (0xF << 16) ;- (HDDRSDRC2) Value : 15
/* - -------- HDDRSDRC2_LPR : (HDDRSDRC2 Offset: 0x1c)  -------- */
AT91C_DDRC2_LPCB          EQU (0x3 <<  0) ;- (HDDRSDRC2) Low-power Command Bit
AT91C_DDRC2_LPCB_DISABLED EQU (0x0) ;- (HDDRSDRC2) Low-power Feature is inhibited: no power-down, self refresh and Deep power mode are issued to the SDRAM device.
AT91C_DDRC2_LPCB_SELFREFRESH EQU (0x1) ;- (HDDRSDRC2) The DDRSDRAMC Controller issues a Self Refresh Command to the SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The SDRAM device leaves the self refresh mode when accessed and enters it after the access.
AT91C_DDRC2_LPCB_POWERDOWN EQU (0x2) ;- (HDDRSDRC2) The HDDRSDRC2 Controller issues a Power-down Command to the SDRAM device after each access, the CKE signal is set low. The SDRAM device leaves the power-down mode when accessed and enters it after the access.
AT91C_DDRC2_LPCB_DEEP_PWD EQU (0x3) ;- (HDDRSDRC2) The HDDRSDRC2 Controller issues a Deep Power-down Command to the Mobile SDRAM device. This mode is unique to Mobile SDRAM devices
AT91C_DDRC2_CLK_FR        EQU (0x1 <<  2) ;- (HDDRSDRC2) Clock frozen Command Bit
AT91C_DDRC2_CLK_FR_DISABLED EQU (0x0 <<  2) ;- (HDDRSDRC2) Low-power Feature is inhibited: no power-down, self refresh and Deep power mode are issued to the SDRAM device.
AT91C_DDRC2_CLK_FR_SELFREFRESH EQU (0x1 <<  2) ;- (HDDRSDRC2) The DDRSDRAMC Controller issues a Self Refresh Command to the SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The SDRAM device leaves the self refresh mode when accessed and enters it after the access.
AT91C_DDRC2_CLK_FR_POWERDOWN EQU (0x2 <<  2) ;- (HDDRSDRC2) The HDDRSDRC2 Controller issues a Power-down Command to the SDRAM device after each access, the CKE signal is set low. The SDRAM device leaves the power-down mode when accessed and enters it after the access.
AT91C_DDRC2_CLK_FR_DEEP_PWD EQU (0x3 <<  2) ;- (HDDRSDRC2) The HDDRSDRC2 Controller issues a Deep Power-down Command to the Mobile SDRAM device. This mode is unique to Mobile SDRAM devices
AT91C_DDRC2_PASR          EQU (0x7 <<  4) ;- (HDDRSDRC2) Partial Array Self Refresh
AT91C_                    EQU (0x0 <<  8) ;- (HDDRSDRC2) 
AT91C_DDRC2_DS            EQU (0x3 << 10) ;- (HDDRSDRC2) Drive strength
AT91C_DDRC2_TIMEOUT       EQU (0x3 << 12) ;- (HDDRSDRC2) low-power mode delay
AT91C_DDRC2_TIMEOUT_0     EQU (0x0 << 12) ;- (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer.
AT91C_DDRC2_TIMEOUT_64    EQU (0x1 << 12) ;- (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer.
AT91C_DDRC2_TIMEOUT_128   EQU (0x2 << 12) ;- (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer.
AT91C_DDRC2_TIMEOUT_Reserved EQU (0x3 << 12) ;- (HDDRSDRC2) Reserved
AT91C_DDRC2_ADPE          EQU (0x1 << 16) ;- (HDDRSDRC2) Active Power Down Exit time
AT91C_DDRC2_ADPE_FAST     EQU (0x0 << 16) ;- (HDDRSDRC2) Fast Exit
AT91C_DDRC2_ADPE_SLOW     EQU (0x1 << 16) ;- (HDDRSDRC2) Slow Exit
/* - -------- HDDRSDRC2_MDR : (HDDRSDRC2 Offset: 0x20) Memory Device Register -------- */
AT91C_DDRC2_MD            EQU (0x7 <<  0) ;- (HDDRSDRC2) memory device
AT91C_DDRC2_MD_SDR_SDRAM  EQU (0x0) ;- (HDDRSDRC2) SDR SDRAM
AT91C_DDRC2_MD_LP_SDR_SDRAM EQU (0x1) ;- (HDDRSDRC2) Low Power SDR SDRAM
AT91C_DDRC2_MD_DDR_SDRAM  EQU (0x2) ;- (HDDRSDRC2) DDR SDRAM
AT91C_DDRC2_MD_LP_DDR_SDRAM EQU (0x3) ;- (HDDRSDRC2) Low Power DDR SDRAM
AT91C_DDRC2_MD_DDR2_SDRAM EQU (0x6) ;- (HDDRSDRC2) DDR2 SDRAM
AT91C_DDRC2_DBW           EQU (0x1 <<  4) ;- (HDDRSDRC2) Data Bus Width
AT91C_DDRC2_DBW_32_BITS   EQU (0x0 <<  4) ;- (HDDRSDRC2) 32 Bits datas bus
AT91C_DDRC2_DBW_16_BITS   EQU (0x1 <<  4) ;- (HDDRSDRC2) 16 Bits datas bus
/* - -------- HDDRSDRC2_DLL : (HDDRSDRC2 Offset: 0x24) DLL Information Register -------- */
AT91C_DDRC2_MDINC         EQU (0x1 <<  0) ;- (HDDRSDRC2) DLL Master Delay Increment
AT91C_DDRC2_MDDEC         EQU (0x1 <<  1) ;- (HDDRSDRC2) DLL Master Delay Decrement
AT91C_DDRC2_MDOVF         EQU (0x1 <<  2) ;- (HDDRSDRC2) DLL Master Delay Overflow Flag
AT91C_DDRC2_SDCOVF        EQU (0x1 <<  3) ;- (HDDRSDRC2) DLL Slave Delay Correction Overflow Flag
AT91C_DDRC2_SDCUDF        EQU (0x1 <<  4) ;- (HDDRSDRC2) DLL Slave Delay Correction Underflow Flag
AT91C_DDRC2_SDERF         EQU (0x1 <<  5) ;- (HDDRSDRC2) DLL Slave Delay Correction Error Flag
AT91C_DDRC2_MDVAL         EQU (0xFF <<  8) ;- (HDDRSDRC2) DLL Master Delay Value
AT91C_DDRC2_SDVAL         EQU (0xFF << 16) ;- (HDDRSDRC2) DLL Slave Delay Value
AT91C_DDRC2_SDCVAL        EQU (0xFF << 24) ;- (HDDRSDRC2) DLL Slave Delay Correction Value
/* - -------- HDDRSDRC2_HS : (HDDRSDRC2 Offset: 0x2c) High Speed Register -------- */
AT91C_DDRC2_DA            EQU (0x1 <<  0) ;- (HDDRSDRC2) Decode cycle
AT91C_DDRC2_NO_OPT        EQU (0x1 <<  1) ;- (HDDRSDRC2) Disable optimization
AT91C_DDRC2_NO_ANT        EQU (0x1 <<  2) ;- (HDDRSDRC2) Disable Anticipated read
AT91C_DDRC2_RES_DQS       EQU (0x1 <<  3) ;- (HDDRSDRC2) Reset DQS Active
/* - -------- HDDRSDRC2_DELAY1 : (HDDRSDRC2 Offset: 0x30) Pad delay1 Register -------- */
AT91C_DDRC2_DELAY         EQU (0xF <<  0) ;- (HDDRSDRC2) Pad delay value
/* - -------- HDDRSDRC2_DELAY2 : (HDDRSDRC2 Offset: 0x34) Pad delay2 Register -------- */
/* - -------- HDDRSDRC2_DELAY3 : (HDDRSDRC2 Offset: 0x38) Pad delay3 Register -------- */
/* - -------- HDDRSDRC2_DELAY4 : (HDDRSDRC2 Offset: 0x3c) Pad delay4 Register -------- */
/* - -------- HDDRSDRC2_DELAY5 : (HDDRSDRC2 Offset: 0x40) Pad delay5 Register -------- */
/* - -------- HDDRSDRC2_DELAY6 : (HDDRSDRC2 Offset: 0x44) Pad delay6 Register -------- */
/* - -------- HDDRSDRC2_DELAY7 : (HDDRSDRC2 Offset: 0x48) Pad delay7 Register -------- */
/* - -------- HDDRSDRC2_DELAY8 : (HDDRSDRC2 Offset: 0x4c) Pad delay8 Register -------- */
/* - -------- HDDRSDRC2_WPCR : (HDDRSDRC2 Offset: 0xe4) Write Protect Control Register -------- */
AT91C_DDRC2_WPEN          EQU (0x1 <<  0) ;- (HDDRSDRC2) write protect enable
AT91C_DDRC2_WPKEY         EQU (0xFFFFFF <<  8) ;- (HDDRSDRC2) write protect key
/* - -------- HDDRSDRC2_WPSR : (HDDRSDRC2 Offset: 0xe8) Write Protect Status Register -------- */
AT91C_DDRC2_WPVS          EQU (0x1 <<  0) ;- (HDDRSDRC2) write protect violation status
AT91C_DDRC2_WPSRC         EQU (0xFFFF <<  8) ;- (HDDRSDRC2) write protect source address

