una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Static Memory Controller Interface*/
/* - ******************************************************************************/
/* - -------- SMC_SETUP : (SMC Offset: 0x0) Setup Register for CS x -------- */
AT91C_SMC_NWESETUP        EQU (0x3F <<  0) ;- (SMC) NWE Setup Length
AT91C_SMC_NCSSETUPWR      EQU (0x3F <<  8) ;- (SMC) NCS Setup Length in WRite Access
AT91C_SMC_NRDSETUP        EQU (0x3F << 16) ;- (SMC) NRD Setup Length
AT91C_SMC_NCSSETUPRD      EQU (0x3F << 24) ;- (SMC) NCS Setup Length in ReaD Access
/* - -------- SMC_PULSE : (SMC Offset: 0x4) Pulse Register for CS x -------- */
AT91C_SMC_NWEPULSE        EQU (0x7F <<  0) ;- (SMC) NWE Pulse Length
AT91C_SMC_NCSPULSEWR      EQU (0x7F <<  8) ;- (SMC) NCS Pulse Length in WRite Access
AT91C_SMC_NRDPULSE        EQU (0x7F << 16) ;- (SMC) NRD Pulse Length
AT91C_SMC_NCSPULSERD      EQU (0x7F << 24) ;- (SMC) NCS Pulse Length in ReaD Access
/* - -------- SMC_CYC : (SMC Offset: 0x8) Cycle Register for CS x -------- */
AT91C_SMC_NWECYCLE        EQU (0x1FF <<  0) ;- (SMC) Total Write Cycle Length
AT91C_SMC_NRDCYCLE        EQU (0x1FF << 16) ;- (SMC) Total Read Cycle Length
/* - -------- SMC_CTRL : (SMC Offset: 0xc) Control Register for CS x -------- */
AT91C_SMC_READMODE        EQU (0x1 <<  0) ;- (SMC) Read Mode
AT91C_SMC_WRITEMODE       EQU (0x1 <<  1) ;- (SMC) Write Mode
AT91C_SMC_NWAITM          EQU (0x3 <<  5) ;- (SMC) NWAIT Mode
AT91C_SMC_NWAITM_NWAIT_DISABLE EQU (0x0 <<  5) ;- (SMC) External NWAIT disabled.
AT91C_SMC_NWAITM_NWAIT_ENABLE_FROZEN EQU (0x2 <<  5) ;- (SMC) External NWAIT enabled in frozen mode.
AT91C_SMC_NWAITM_NWAIT_ENABLE_READY EQU (0x3 <<  5) ;- (SMC) External NWAIT enabled in ready mode.
AT91C_SMC_BAT             EQU (0x1 <<  8) ;- (SMC) Byte Access Type
AT91C_SMC_BAT_BYTE_SELECT EQU (0x0 <<  8) ;- (SMC) Write controled by ncs, nbs0, nbs1, nbs2, nbs3. Read controled by ncs, nrd, nbs0, nbs1, nbs2, nbs3.
AT91C_SMC_BAT_BYTE_WRITE  EQU (0x1 <<  8) ;- (SMC) Write controled by ncs, nwe0, nwe1, nwe2, nwe3. Read controled by ncs and nrd.
AT91C_SMC_DBW             EQU (0x3 << 12) ;- (SMC) Data Bus Width
AT91C_SMC_DBW_WIDTH_EIGTH_BITS EQU (0x0 << 12) ;- (SMC) 8 bits.
AT91C_SMC_DBW_WIDTH_SIXTEEN_BITS EQU (0x1 << 12) ;- (SMC) 16 bits.
AT91C_SMC_DBW_WIDTH_THIRTY_TWO_BITS EQU (0x2 << 12) ;- (SMC) 32 bits.
AT91C_SMC_TDF             EQU (0xF << 16) ;- (SMC) Data Float Time.
AT91C_SMC_TDFEN           EQU (0x1 << 20) ;- (SMC) TDF Enabled.
AT91C_SMC_PMEN            EQU (0x1 << 24) ;- (SMC) Page Mode Enabled.
AT91C_SMC_PS              EQU (0x3 << 28) ;- (SMC) Page Size
AT91C_SMC_PS_SIZE_FOUR_BYTES EQU (0x0 << 28) ;- (SMC) 4 bytes.
AT91C_SMC_PS_SIZE_EIGHT_BYTES EQU (0x1 << 28) ;- (SMC) 8 bytes.
AT91C_SMC_PS_SIZE_SIXTEEN_BYTES EQU (0x2 << 28) ;- (SMC) 16 bytes.
AT91C_SMC_PS_SIZE_THIRTY_TWO_BYTES EQU (0x3 << 28) ;- (SMC) 32 bytes.
/* - -------- SMC_SETUP : (SMC Offset: 0x10) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x14) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x18) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x1c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x20) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x24) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x28) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x2c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x30) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x34) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x38) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x3c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x40) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x44) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x48) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x4c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x50) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x54) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x58) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x5c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x60) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x64) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x68) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x6c) Control Register for CS x -------- */
/* - -------- SMC_SETUP : (SMC Offset: 0x70) Setup Register for CS x -------- */
/* - -------- SMC_PULSE : (SMC Offset: 0x74) Pulse Register for CS x -------- */
/* - -------- SMC_CYC : (SMC Offset: 0x78) Cycle Register for CS x -------- */
/* - -------- SMC_CTRL : (SMC Offset: 0x7c) Control Register for CS x -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR AHB Matrix Interface*/
/* - ******************************************************************************/
/* - -------- MATRIX_MCFG0 : (MATRIX Offset: 0x0) Master Configuration Register ARM-I -------- */
AT91C_MATRIX_ULBT         EQU (0x7 <<  0) ;- (MATRIX) Undefined Length Burst Type
/* - -------- MATRIX_MCFG1 : (MATRIX Offset: 0x4) Master Configuration Register ARM-D -------- */
/* - -------- MATRIX_MCFG2 : (MATRIX Offset: 0x8) Master Configuration Register PDC -------- */
/* - -------- MATRIX_MCFG3 : (MATRIX Offset: 0xc) Master Configuration Register USB Host OHCI -------- */
/* - -------- MATRIX_MCFG4 : (MATRIX Offset: 0x10) Master Configuration Register DMA0 -------- */
/* - -------- MATRIX_MCFG5 : (MATRIX Offset: 0x14) Master Configuration Register DMA1 -------- */
/* - -------- MATRIX_MCFG6 : (MATRIX Offset: 0x18) Master Configuration Register HISI -------- */
/* - -------- MATRIX_MCFG7 : (MATRIX Offset: 0x1c) Master Configuration Register LCD -------- */
/* - -------- MATRIX_MCFG8 : (MATRIX Offset: 0x20) Master Configuration Register EMAC -------- */
/* - -------- MATRIX_MCFG9 : (MATRIX Offset: 0x24) Master Configuration Register USB Device -------- */
/* - -------- MATRIX_MCFG10 : (MATRIX Offset: 0x28) Master Configuration Register USB Host EHCI -------- */
/* - -------- MATRIX_MCFG11 : (MATRIX Offset: 0x2c) Master Configuration Register Video Decoder -------- */
/* - -------- MATRIX_SCFG0 : (MATRIX Offset: 0x40) Slave Configuration Register 0 -------- */
AT91C_MATRIX_SLOT_CYCLE   EQU (0xFF <<  0) ;- (MATRIX) Maximum Number of Allowed Cycles for a Burst
AT91C_MATRIX_DEFMSTR_TYPE EQU (0x3 << 16) ;- (MATRIX) Default Master Type
AT91C_MATRIX_DEFMSTR_TYPE_NO_DEFMSTR EQU (0x0 << 16) ;- (MATRIX) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This results in having a one cycle latency for the first transfer of a burst.
AT91C_MATRIX_DEFMSTR_TYPE_LAST_DEFMSTR EQU (0x1 << 16) ;- (MATRIX) Last Default Master. At the end of current slave access, if no other master request is pending, the slave stay connected with the last master having accessed it. This results in not having the one cycle latency when the last master re-trying access on the slave.
AT91C_MATRIX_DEFMSTR_TYPE_FIXED_DEFMSTR EQU (0x2 << 16) ;- (MATRIX) Fixed Default Master. At the end of current slave access, if no other master request is pending, the slave connects with fixed which number is in FIXED_DEFMSTR field. This results in not having the one cycle latency when the fixed master re-trying access on the slave.
AT91C_MATRIX_FIXED_DEFMSTR0 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
AT91C_MATRIX_ARBT         EQU (0x3 << 24) ;- (MATRIX) Arbitration Type
/* - -------- MATRIX_SCFG1 : (MATRIX Offset: 0x44) Slave Configuration Register 1 -------- */
AT91C_MATRIX_FIXED_DEFMSTR1 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
/* - -------- MATRIX_SCFG2 : (MATRIX Offset: 0x48) Slave Configuration Register 2 -------- */
AT91C_MATRIX_FIXED_DEFMSTR2 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR2_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR2_VDEC EQU (0xB << 18) ;- (MATRIX) Video Decoder Master is Default Master
/* - -------- MATRIX_SCFG3 : (MATRIX Offset: 0x4c) Slave Configuration Register 3 -------- */
AT91C_MATRIX_FIXED_DEFMSTR3 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR3_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR3_LCD EQU (0x7 << 18) ;- (MATRIX) LCD Master is Default Master
/* - -------- MATRIX_SCFG4 : (MATRIX Offset: 0x50) Slave Configuration Register 4 -------- */
AT91C_MATRIX_FIXED_DEFMSTR4 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
/* - -------- MATRIX_SCFG5 : (MATRIX Offset: 0x54) Slave Configuration Register 5 -------- */
AT91C_MATRIX_FIXED_DEFMSTR5 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
/* - -------- MATRIX_SCFG6 : (MATRIX Offset: 0x58) Slave Configuration Register 6 -------- */
AT91C_MATRIX_FIXED_DEFMSTR6 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_LCD EQU (0x7 << 18) ;- (MATRIX) LCD Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_VDEC EQU (0xB << 18) ;- (MATRIX) Video Decoder Master is Default Master
/* - -------- MATRIX_SCFG7 : (MATRIX Offset: 0x5c) Slave Configuration Register 7 -------- */
AT91C_MATRIX_FIXED_DEFMSTR7 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
/* - -------- MATRIX_PRAS0 : (MATRIX Offset: 0x80) PRAS0 Register -------- */
AT91C_MATRIX_M0PR         EQU (0x3 <<  0) ;- (MATRIX) ARM926EJ-S Instruction priority
AT91C_MATRIX_M1PR         EQU (0x3 <<  4) ;- (MATRIX) ARM926EJ-S Data priority
AT91C_MATRIX_M2PR         EQU (0x3 <<  8) ;- (MATRIX) PDC priority
AT91C_MATRIX_M3PR         EQU (0x3 << 12) ;- (MATRIX) USB Host OHCI priority
AT91C_MATRIX_M4PR         EQU (0x3 << 16) ;- (MATRIX) DMA0 priority
AT91C_MATRIX_M5PR         EQU (0x3 << 20) ;- (MATRIX) DMA1 priority
AT91C_MATRIX_M6PR         EQU (0x3 << 24) ;- (MATRIX) ISI priority
AT91C_MATRIX_M7PR         EQU (0x3 << 28) ;- (MATRIX) LCD priority
/* - -------- MATRIX_PRBS0 : (MATRIX Offset: 0x84) PRBS0 Register -------- */
AT91C_MATRIX_M8PR         EQU (0x3 <<  0) ;- (MATRIX) EMAC priority
AT91C_MATRIX_M9PR         EQU (0x3 <<  4) ;- (MATRIX) USB Device priority
AT91C_MATRIX_M10PR        EQU (0x3 <<  8) ;- (MATRIX) USB Host EHCI priority
AT91C_MATRIX_M11PR        EQU (0x3 << 12) ;- (MATRIX) Video Decoder priority
/* - -------- MATRIX_PRAS1 : (MATRIX Offset: 0x88) PRAS1 Register -------- */
/* - -------- MATRIX_PRBS1 : (MATRIX Offset: 0x8c) PRBS1 Register -------- */
/* - -------- MATRIX_PRAS2 : (MATRIX Offset: 0x90) PRAS2 Register -------- */
/* - -------- MATRIX_PRBS2 : (MATRIX Offset: 0x94) PRBS2 Register -------- */
/* - -------- MATRIX_PRAS3 : (MATRIX Offset: 0x98) PRAS3 Register -------- */
/* - -------- MATRIX_PRBS3 : (MATRIX Offset: 0x9c) PRBS3 Register -------- */
/* - -------- MATRIX_PRAS4 : (MATRIX Offset: 0xa0) PRAS4 Register -------- */
/* - -------- MATRIX_PRBS4 : (MATRIX Offset: 0xa4) PRBS4 Register -------- */
/* - -------- MATRIX_PRAS5 : (MATRIX Offset: 0xa8) PRAS5 Register -------- */
/* - -------- MATRIX_PRBS5 : (MATRIX Offset: 0xac) PRBS5 Register -------- */
/* - -------- MATRIX_PRAS6 : (MATRIX Offset: 0xb0) PRAS6 Register -------- */
/* - -------- MATRIX_PRBS6 : (MATRIX Offset: 0xb4) PRBS6 Register -------- */
/* - -------- MATRIX_PRAS7 : (MATRIX Offset: 0xb8) PRAS7 Register -------- */
/* - -------- MATRIX_PRBS7 : (MATRIX Offset: 0xbc) PRBS7 Register -------- */
/* - -------- MATRIX_MRCR : (MATRIX Offset: 0x100) MRCR Register -------- */
AT91C_MATRIX_RCA926I      EQU (0x1 <<  0) ;- (MATRIX) Remap Command Bit for ARM926EJ-S Instruction
AT91C_MATRIX_RCA926D      EQU (0x1 <<  1) ;- (MATRIX) Remap Command Bit for ARM926EJ-S Data
AT91C_MATRIX_RCB2         EQU (0x1 <<  2) ;- (MATRIX) Remap Command Bit for PDC
AT91C_MATRIX_RCB3         EQU (0x1 <<  3) ;- (MATRIX) Remap Command Bit for USB Host OHCI
AT91C_MATRIX_RCB4         EQU (0x1 <<  4) ;- (MATRIX) Remap Command Bit for DMA0
AT91C_MATRIX_RCB5         EQU (0x1 <<  5) ;- (MATRIX) Remap Command Bit for DMA1
AT91C_MATRIX_RCB6         EQU (0x1 <<  6) ;- (MATRIX) Remap Command Bit for ISI
AT91C_MATRIX_RCB7         EQU (0x1 <<  7) ;- (MATRIX) Remap Command Bit for LCD
AT91C_MATRIX_RCB8         EQU (0x1 <<  8) ;- (MATRIX) Remap Command Bit for EMAC
AT91C_MATRIX_RCB9         EQU (0x1 <<  9) ;- (MATRIX) Remap Command Bit for USB Device
AT91C_MATRIX_RCB10        EQU (0x1 << 10) ;- (MATRIX) Remap Command Bit for USB Host EHCI
AT91C_MATRIX_RCB11        EQU (0x1 << 11) ;- (MATRIX) Remap Command Bit for Video Decoder
/* - -------- MATRIX_WRPROTEN : (MATRIX Offset: 0x1e4) Write Protection Control Register -------- */
AT91C_MATRIX_WRPROT       EQU (0x1 <<  0) ;- (MATRIX) Enable/Disable Write Protection of HMATRIX2 configuration registers (requires key)
AT91C_MATRIX_WRPROT_DISABLE EQU (0x0) ;- (MATRIX) Disable Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_ENABLE EQU (0x1) ;- (MATRIX) Enable  Write Protection of HMATRIX2 configuration registers
/* - -------- MATRIX_WRPROTST : (MATRIX Offset: 0x1e8) Write Protection Status Register -------- */
AT91C_MATRIX_WRPROT_VIOLATION EQU (0x1 <<  0) ;- (MATRIX) Violation of Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_UNDETECTED EQU (0x0) ;- (MATRIX) No violation of Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_DETECTED EQU (0x1) ;- (MATRIX) Violation of  Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_OFFSET EQU (0x1FF <<  8) ;- (MATRIX) Offset where violation of Write Protection of HMATRIX2 configuration registers is detected

