una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Parallel Input Output Controler*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Power Management Controller V610*/
/* - ******************************************************************************/
/* - -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- */
AT91C_PMC_DDR             EQU (0x1 <<  2) ;- (PMC) DDR controller Clock2x
AT91C_PMC_UHP             EQU (0x1 <<  6) ;- (PMC) USB Host Port Clock
AT91C_PMC_UDP             EQU (0x1 <<  7) ;- (PMC) USB Device Port Clock
AT91C_PMC_PCK0            EQU (0x1 <<  8) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK1            EQU (0x1 <<  9) ;- (PMC) Programmable Clock Output
/* - -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- */
AT91C_PMC_PCK             EQU (0x1 <<  0) ;- (PMC) Processor Clock
/* - -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- */
/* - -------- CKGR_UCKR : (PMC Offset: 0x1c) UTMI Clock Configuration Register -------- */
AT91C_CKGR_UPLLEN         EQU (0x1 << 16) ;- (PMC) UTMI PLL Enable
AT91C_CKGR_UPLLEN_DISABLED EQU (0x0 << 16) ;- (PMC) The UTMI PLL is disabled
AT91C_CKGR_UPLLEN_ENABLED EQU (0x1 << 16) ;- (PMC) The UTMI PLL is enabled
AT91C_CKGR_PLLCOUNT       EQU (0xF << 20) ;- (PMC) UTMI Oscillator Start-up Time
AT91C_CKGR_BIASEN         EQU (0x1 << 24) ;- (PMC) UTMI BIAS Enable
AT91C_CKGR_BIASEN_DISABLED EQU (0x0 << 24) ;- (PMC) The UTMI BIAS is disabled
AT91C_CKGR_BIASEN_ENABLED EQU (0x1 << 24) ;- (PMC) The UTMI BIAS is enabled
AT91C_CKGR_BIASCOUNT      EQU (0xF << 28) ;- (PMC) UTMI BIAS Start-up Time
/* - -------- CKGR_MOR : (PMC Offset: 0x20) Main Oscillator Register -------- */
AT91C_CKGR_MOSCEN         EQU (0x1 <<  0) ;- (PMC) Main Oscillator Enable
AT91C_CKGR_OSCBYPASS      EQU (0x1 <<  1) ;- (PMC) Main Oscillator Bypass
AT91C_CKGR_OSCOUNT        EQU (0xFF <<  8) ;- (PMC) Main Oscillator Start-up Time
/* - -------- CKGR_MCFR : (PMC Offset: 0x24) Main Clock Frequency Register -------- */
AT91C_CKGR_MAINF          EQU (0xFFFF <<  0) ;- (PMC) Main Clock Frequency
AT91C_CKGR_MAINRDY        EQU (0x1 << 16) ;- (PMC) Main Clock Ready
/* - -------- CKGR_PLLAR : (PMC Offset: 0x28) PLL A Register -------- */
AT91C_CKGR_DIVA           EQU (0xFF <<  0) ;- (PMC) Divider A Selected
AT91C_CKGR_DIVA_0         EQU (0x0) ;- (PMC) Divider A output is 0
AT91C_CKGR_DIVA_BYPASS    EQU (0x1) ;- (PMC) Divider A is bypassed
AT91C_CKGR_PLLACOUNT      EQU (0x3F <<  8) ;- (PMC) PLL A Counter
AT91C_CKGR_OUTA           EQU (0x3 << 14) ;- (PMC) PLL A Output Frequency Range
AT91C_CKGR_OUTA_0         EQU (0x0 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_1         EQU (0x1 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_2         EQU (0x2 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_3         EQU (0x3 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_MULA           EQU (0xFF << 16) ;- (PMC) PLL A Multiplier
AT91C_CKGR_SRCA           EQU (0x1 << 29) ;- (PMC) 
/* - -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- */
AT91C_PMC_CSS             EQU (0x3 <<  0) ;- (PMC) Programmable Clock Selection
AT91C_PMC_CSS_SLOW_CLK    EQU (0x0) ;- (PMC) Slow Clock is selected
AT91C_PMC_CSS_MAIN_CLK    EQU (0x1) ;- (PMC) Main Clock is selected
AT91C_PMC_CSS_PLLA_CLK    EQU (0x2) ;- (PMC) Clock from PLL A is selected
AT91C_PMC_CSS_UPLL_CLK    EQU (0x3) ;- (PMC) Clock from UTMI PLL is selected
AT91C_PMC_PRES            EQU (0x7 <<  2) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_PRES_CLK        EQU (0x0 <<  2) ;- (PMC) Selected clock
AT91C_PMC_PRES_CLK_2      EQU (0x1 <<  2) ;- (PMC) Selected clock divided by 2
AT91C_PMC_PRES_CLK_4      EQU (0x2 <<  2) ;- (PMC) Selected clock divided by 4
AT91C_PMC_PRES_CLK_8      EQU (0x3 <<  2) ;- (PMC) Selected clock divided by 8
AT91C_PMC_PRES_CLK_16     EQU (0x4 <<  2) ;- (PMC) Selected clock divided by 16
AT91C_PMC_PRES_CLK_32     EQU (0x5 <<  2) ;- (PMC) Selected clock divided by 32
AT91C_PMC_PRES_CLK_64     EQU (0x6 <<  2) ;- (PMC) Selected clock divided by 64
AT91C_PMC_MDIV            EQU (0x3 <<  8) ;- (PMC) Master Clock Division
AT91C_PMC_MDIV_1          EQU (0x0 <<  8) ;- (PMC) Processor clock = Master Clock ; DDR Clock = Master Clock
AT91C_PMC_MDIV_2          EQU (0x1 <<  8) ;- (PMC) Processor clock = 2 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_MDIV_4          EQU (0x2 <<  8) ;- (PMC) Processor clock = 4 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_MDIV_3          EQU (0x3 <<  8) ;- (PMC) Processor clock = 3 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_PLLADIV2        EQU (0x1 << 12) ;- (PMC) PLLA divisor by 2
AT91C_PMC_PLLADIV2_1      EQU (0x0 << 12) ;- (PMC) PLLA clock frequency is divided by 1
AT91C_PMC_PLLADIV2_2      EQU (0x1 << 12) ;- (PMC) PLLA clock frequency is divided by 2
/* - -------- PMC_USB : (PMC Offset: 0x38) USB Clock Register -------- */
AT91C_PMC_USBS            EQU (0x1 <<  0) ;- (PMC) USBS
AT91C_PMC_USBS_USB_PLLA   EQU (0x0) ;- (PMC) USB Clock Input is PLLA
AT91C_PMC_USBS_USB_UPLL   EQU (0x1) ;- (PMC) USB Clock Input is UPLL
AT91C_PMC_USBDIV          EQU (0xF <<  8) ;- (PMC) USBDIV
AT91C_PMC_USBDIV_1        EQU (0x0 <<  8) ;- (PMC) USB Clock divided by 1
AT91C_PMC_USBDIV_2        EQU (0x1 <<  8) ;- (PMC) USB Clock divided by 2
AT91C_PMC_USBDIV_3        EQU (0x2 <<  8) ;- (PMC) USB Clock divided by 3
AT91C_PMC_USBDIV_4        EQU (0x3 <<  8) ;- (PMC) USB Clock divided by 4
AT91C_PMC_USBDIV_5        EQU (0x4 <<  8) ;- (PMC) USB Clock divided by 5
AT91C_PMC_USBDIV_6        EQU (0x5 <<  8) ;- (PMC) USB Clock divided by 6
AT91C_PMC_USBDIV_7        EQU (0x6 <<  8) ;- (PMC) USB Clock divided by 7
AT91C_PMC_USBDIV_8        EQU (0x7 <<  8) ;- (PMC) USB Clock divided by 8
AT91C_PMC_USBDIV_9        EQU (0x8 <<  8) ;- (PMC) USB Clock divided by 9
AT91C_PMC_USBDIV_10       EQU (0x9 <<  8) ;- (PMC) USB Clock divided by 10
AT91C_PMC_USBDIV_11       EQU (0xA <<  8) ;- (PMC) USB Clock divided by 11
AT91C_PMC_USBDIV_12       EQU (0xB <<  8) ;- (PMC) USB Clock divided by 12
AT91C_PMC_USBDIV_13       EQU (0xC <<  8) ;- (PMC) USB Clock divided by 13
AT91C_PMC_USBDIV_14       EQU (0xD <<  8) ;- (PMC) USB Clock divided by 14
AT91C_PMC_USBDIV_15       EQU (0xE <<  8) ;- (PMC) USB Clock divided by 15
AT91C_PMC_USBDIV_16       EQU (0xF <<  8) ;- (PMC) USB Clock divided by 16
/* - -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock 0 Register -------- */
AT91C_PMC_SLCKMCK         EQU (0x1 <<  8) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_SLCKMCK_SLCK    EQU (0x0 <<  8) ;- (PMC) Slow Clock selected
AT91C_PMC_SLCKMCK_MCK     EQU (0x1 <<  8) ;- (PMC) Master Clock selected
/* - -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- */
AT91C_PMC_MOSCS           EQU (0x1 <<  0) ;- (PMC) MOSC Status/Enable/Disable/Mask
AT91C_PMC_LOCKA           EQU (0x1 <<  1) ;- (PMC) PLL A Status/Enable/Disable/Mask
AT91C_PMC_MCKRDY          EQU (0x1 <<  3) ;- (PMC) Master Clock Status/Enable/Disable/Mask
AT91C_PMC_LOCKU           EQU (0x1 <<  6) ;- (PMC) PLL UTMI Status/Enable/Disable/Mask
AT91C_PMC_PCK0RDY         EQU (0x1 <<  8) ;- (PMC) PCK0_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK1RDY         EQU (0x1 <<  9) ;- (PMC) PCK1_RDY Status/Enable/Disable/Mask
/* - -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- */
/* - -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- */
/* - -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- */
/* - -------- PMC_PLLICPR : (PMC Offset: 0x80) PLL Charge Pump Current Register -------- */
AT91C_PMC_ICPPLLA         EQU (0xF <<  0) ;- (PMC) PLLA charge pump current setting
AT91C_PMC_ICPPLLA_0       EQU (0x0) ;- (PMC) 595-800 MHz
AT91C_PMC_ICPPLLA_1       EQU (0x1) ;- (PMC) 395-600 MHz
AT91C_PMC_REALLOCK        EQU (0x1 <<  7) ;- (PMC) PLLs use real lock signals when 1
AT91C_PMC_IPLLA           EQU (0xF <<  8) ;- (PMC) PLLA special setting
AT91C_PMC_IPLLA_0         EQU (0x0 <<  8) ;- (PMC) Internal LFT
AT91C_PMC_IPLLA_1         EQU (0x1 <<  8) ;- (PMC) External LFT
/* - -------- PMC_FEATURES : (PMC Offset: 0xf8)   -------- */
AT91C_PMC_CFGAHBCLK       EQU (0x1 <<  0) ;- (PMC) 
AT91C_PMC_CFGAHBCLK_0     EQU (0x0) ;- (PMC) 
AT91C_PMC_CFGAHBCLK_1     EQU (0x1) ;- (PMC) 
AT91C_PMC_HCLKEN          EQU (0x1 <<  1) ;- (PMC) 
AT91C_PMC_HCLKEN_0        EQU (0x0 <<  1) ;- (PMC) 
AT91C_PMC_HCLKEN_1        EQU (0x1 <<  1) ;- (PMC) 
AT91C_PMC_PERMCLK         EQU (0x1 <<  2) ;- (PMC) 
AT91C_PMC_PERMCLK_0       EQU (0x0 <<  2) ;- (PMC) 
AT91C_PMC_PERMCLK_1       EQU (0x1 <<  2) ;- (PMC) 
AT91C_PMC_CORE2           EQU (0x1 <<  3) ;- (PMC) 
AT91C_PMC_CORE2_0         EQU (0x0 <<  3) ;- (PMC) 
AT91C_PMC_CORE2_1         EQU (0x1 <<  3) ;- (PMC) 
AT91C_PMC_USBDEVCK        EQU (0x1 <<  4) ;- (PMC) 
AT91C_PMC_USBDEVCK_0      EQU (0x0 <<  4) ;- (PMC) 
AT91C_PMC_USBDEVCK_1      EQU (0x1 <<  4) ;- (PMC) 
AT91C_PMC_USBHOSTCK       EQU (0x1 <<  5) ;- (PMC) 
AT91C_PMC_USBHOSTCK_0     EQU (0x0 <<  5) ;- (PMC) 
AT91C_PMC_USBHOSTCK_1     EQU (0x1 <<  5) ;- (PMC) 
AT91C_PMC_USBOTGCK        EQU (0x1 <<  6) ;- (PMC) 
AT91C_PMC_USBOTGCK_0      EQU (0x0 <<  6) ;- (PMC) 
AT91C_PMC_USBOTGCK_1      EQU (0x1 <<  6) ;- (PMC) 
AT91C_PMC_UHSYNRST        EQU (0x1 <<  7) ;- (PMC) 
AT91C_PMC_UHSYNRST_0      EQU (0x0 <<  7) ;- (PMC) 
AT91C_PMC_UHSYNRST_1      EQU (0x1 <<  7) ;- (PMC) 
AT91C_PMC_UOSYNRST        EQU (0x1 <<  8) ;- (PMC) 
AT91C_PMC_UOSYNRST_0      EQU (0x0 <<  8) ;- (PMC) 
AT91C_PMC_UOSYNRST_1      EQU (0x1 <<  8) ;- (PMC) 
AT91C_PMC_PLLENPOL        EQU (0x1 <<  9) ;- (PMC) 
AT91C_PMC_PLLENPOL_0      EQU (0x0 <<  9) ;- (PMC) 
AT91C_PMC_PLLENPOL_1      EQU (0x1 <<  9) ;- (PMC) 
AT91C_PMC_BIASREG         EQU (0x1 << 10) ;- (PMC) 
AT91C_PMC_BIASREG_0       EQU (0x0 << 10) ;- (PMC) 
AT91C_PMC_BIASREG_1       EQU (0x1 << 10) ;- (PMC) 
AT91C_PMC_OUTPLL          EQU (0x1 << 11) ;- (PMC) 
AT91C_PMC_OUTPLL_0        EQU (0x0 << 11) ;- (PMC) 
AT91C_PMC_OUTPLL_1        EQU (0x1 << 11) ;- (PMC) 
AT91C_PMC_OUTCURR         EQU (0x1 << 12) ;- (PMC) 
AT91C_PMC_OUTCURR_0       EQU (0x0 << 12) ;- (PMC) 
AT91C_PMC_OUTCURR_1       EQU (0x1 << 12) ;- (PMC) 
AT91C_PMC_FWUP            EQU (0x1 << 13) ;- (PMC) 
AT91C_PMC_FWUP_0          EQU (0x0 << 13) ;- (PMC) 
AT91C_PMC_FWUP_1          EQU (0x1 << 13) ;- (PMC) 
AT91C_PMC_SELMAINCLK      EQU (0x1 << 14) ;- (PMC) 
AT91C_PMC_SELMAINCLK_0    EQU (0x0 << 14) ;- (PMC) 
AT91C_PMC_SELMAINCLK_1    EQU (0x1 << 14) ;- (PMC) 
AT91C_PMC_RSTCLKM         EQU (0x1 << 15) ;- (PMC) 
AT91C_PMC_RSTCLKM_0       EQU (0x0 << 15) ;- (PMC) 
AT91C_PMC_RSTCLKM_1       EQU (0x1 << 15) ;- (PMC) 
AT91C_PMC_NB_PERIPH_CLOCK EQU (0xFF << 16) ;- (PMC) 
/* - -------- PMC_VERSION : (PMC Offset: 0xfc)   -------- */
AT91C_PMC_Version         EQU (0xFFFF <<  0) ;- (PMC) 
AT91C_PMC_Version_0       EQU (0x0) ;- (PMC) 
AT91C_PMC_Version_1       EQU (0x1) ;- (PMC) 
AT91C_PMC_MFN             EQU (0x7 << 16) ;- (PMC) 
AT91C_PMC_MFN_0           EQU (0x0 << 16) ;- (PMC) 
AT91C_PMC_MFN_1           EQU (0x1 << 16) ;- (PMC) 

