una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR TSADC*/
/* - ******************************************************************************/
/* - -------- TSADC_CR : (TSADC Offset: 0x0) Control Register -------- */
AT91C_TSADC_SWRST         EQU (0x1 <<  0) ;- (TSADC) Software Reset
AT91C_TSADC_START         EQU (0x1 <<  1) ;- (TSADC) Start Conversion
/* - -------- TSADC_MR : (TSADC Offset: 0x4) Mode Register -------- */
AT91C_TSADC_TSAMOD        EQU (0x3 <<  0) ;- (TSADC) Touch Screen ADC Mode
AT91C_TSADC_TSAMOD_ADC_ONLY_MODE EQU (0x0) ;- (TSADC) ADC Mode
AT91C_TSADC_TSAMOD_TS_ONLY_MODE EQU (0x1) ;- (TSADC) Touch Screen Only Mode
AT91C_TSADC_LOWRES        EQU (0x1 <<  4) ;- (TSADC) ADC Resolution
AT91C_TSADC_SLEEP         EQU (0x1 <<  5) ;- (TSADC) Sleep Mode
AT91C_TSADC_PENDET        EQU (0x1 <<  6) ;- (TSADC) Pen Detect Selection
AT91C_TSADC_PRESCAL       EQU (0x3F <<  8) ;- (TSADC) Prescaler Rate Selection
AT91C_TSADC_STARTUP       EQU (0x7F << 16) ;- (TSADC) Startup Time
AT91C_TSADC_SHTIM         EQU (0xF << 24) ;- (TSADC) Sample and Hold Time for ADC Channels
AT91C_TSADC_PENDBC        EQU (0xF << 28) ;- (TSADC) Pen Detect Debouncing Period
/* - -------- TSADC_TRGR : (TSADC Offset: 0x8) Trigger Register -------- */
AT91C_TSADC_TRGMOD        EQU (0x7 <<  0) ;- (TSADC) Trigger Mode
AT91C_TSADC_TRGMOD_NO_TRIGGER EQU (0x0) ;- (TSADC) No Trigger
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_RE EQU (0x1) ;- (TSADC) External Trigger Rising Edge
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_FE EQU (0x2) ;- (TSADC) External Trigger Falling Edge
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_AE EQU (0x3) ;- (TSADC) External Trigger Any Edge
AT91C_TSADC_TRGMOD_PENDET_TRIGGER EQU (0x4) ;- (TSADC) Pen Detect Trigger (only if PENDET is set and in Touch Screen mode only)
AT91C_TSADC_TRGMOD_PERIODIC_TRIGGER EQU (0x5) ;- (TSADC) Periodic Trigger (wrt TRGPER)
AT91C_TSADC_TRGMOD_CONT_TRIGGER EQU (0x6) ;- (TSADC) Continuous Trigger
AT91C_TSADC_TRGPER        EQU (0xFFFF << 16) ;- (TSADC) Trigger Period
/* - -------- TSADC_TSR : (TSADC Offset: 0xc) Touch Screen Register -------- */
AT91C_TSADC_TSSHTIM       EQU (0xF << 24) ;- (TSADC) Sample and Hold Time for Touch Screen Channels
/* - -------- TSADC_CHER : (TSADC Offset: 0x10) Channel Enable Register -------- */
AT91C_TSADC_CHENA0        EQU (0x1 <<  0) ;- (TSADC) Channel 0 Enable
AT91C_TSADC_CHENA1        EQU (0x1 <<  1) ;- (TSADC) Channel 1 Enable
AT91C_TSADC_CHENA2        EQU (0x1 <<  2) ;- (TSADC) Channel 2 Enable
AT91C_TSADC_CHENA3        EQU (0x1 <<  3) ;- (TSADC) Channel 3 Enable
AT91C_TSADC_CHENA4        EQU (0x1 <<  4) ;- (TSADC) Channel 4 Enable
AT91C_TSADC_CHENA5        EQU (0x1 <<  5) ;- (TSADC) Channel 5 Enable
AT91C_TSADC_CHENA6        EQU (0x1 <<  6) ;- (TSADC) Channel 6 Enable
AT91C_TSADC_CHENA7        EQU (0x1 <<  7) ;- (TSADC) Channel 7 Enable
/* - -------- TSADC_CHDR : (TSADC Offset: 0x14) Channel Disable Register -------- */
AT91C_TSADC_CHDIS0        EQU (0x1 <<  0) ;- (TSADC) Channel 0 Disable
AT91C_TSADC_CHDIS1        EQU (0x1 <<  1) ;- (TSADC) Channel 1 Disable
AT91C_TSADC_CHDIS2        EQU (0x1 <<  2) ;- (TSADC) Channel 2 Disable
AT91C_TSADC_CHDIS3        EQU (0x1 <<  3) ;- (TSADC) Channel 3 Disable
AT91C_TSADC_CHDIS4        EQU (0x1 <<  4) ;- (TSADC) Channel 4 Disable
AT91C_TSADC_CHDIS5        EQU (0x1 <<  5) ;- (TSADC) Channel 5 Disable
AT91C_TSADC_CHDIS6        EQU (0x1 <<  6) ;- (TSADC) Channel 6 Disable
AT91C_TSADC_CHDIS7        EQU (0x1 <<  7) ;- (TSADC) Channel 7 Disable
/* - -------- TSADC_CHSR : (TSADC Offset: 0x18) Channel Status Register -------- */
AT91C_TSADC_CHS0          EQU (0x1 <<  0) ;- (TSADC) Channel 0 Status
AT91C_TSADC_CHS1          EQU (0x1 <<  1) ;- (TSADC) Channel 1 Status
AT91C_TSADC_CHS2          EQU (0x1 <<  2) ;- (TSADC) Channel 2 Status
AT91C_TSADC_CHS3          EQU (0x1 <<  3) ;- (TSADC) Channel 3 Status
AT91C_TSADC_CHS4          EQU (0x1 <<  4) ;- (TSADC) Channel 4 Status
AT91C_TSADC_CHS5          EQU (0x1 <<  5) ;- (TSADC) Channel 5 Status
AT91C_TSADC_CHS6          EQU (0x1 <<  6) ;- (TSADC) Channel 6 Status
AT91C_TSADC_CHS7          EQU (0x1 <<  7) ;- (TSADC) Channel 7 Status
/* - -------- TSADC_SR : (TSADC Offset: 0x1c) Status Register -------- */
AT91C_TSADC_EOC0          EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion
AT91C_TSADC_EOC1          EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion
AT91C_TSADC_EOC2          EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion
AT91C_TSADC_EOC3          EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion
AT91C_TSADC_EOC4          EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion
AT91C_TSADC_EOC5          EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion
AT91C_TSADC_EOC6          EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion
AT91C_TSADC_EOC7          EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion
AT91C_TSADC_OVRE0         EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error
AT91C_TSADC_OVRE1         EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error
AT91C_TSADC_OVRE2         EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error
AT91C_TSADC_OVRE3         EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error
AT91C_TSADC_OVRE4         EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error
AT91C_TSADC_OVRE5         EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error
AT91C_TSADC_OVRE6         EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error
AT91C_TSADC_OVRE7         EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error
AT91C_TSADC_DRDY          EQU (0x1 << 16) ;- (TSADC) Data Ready
AT91C_TSADC_GOVRE         EQU (0x1 << 17) ;- (TSADC) General Overrun Error
AT91C_TSADC_ENDRX         EQU (0x1 << 18) ;- (TSADC) End of RX Buffer
AT91C_TSADC_RXBUFF        EQU (0x1 << 19) ;- (TSADC) RX Buffer Full
AT91C_TSADC_PENCNT        EQU (0x1 << 20) ;- (TSADC) Pen Contact
AT91C_TSADC_NOCNT         EQU (0x1 << 21) ;- (TSADC) No Contact
/* - -------- TSADC_LCDR : (TSADC Offset: 0x20) Last Converted Data Register -------- */
AT91C_TSADC_LDATA         EQU (0x3FF <<  0) ;- (TSADC) Last Converted Data
/* - -------- TSADC_IER : (TSADC Offset: 0x24) Interrupt Enable Register -------- */
AT91C_TSADC_IENAEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Enable
AT91C_TSADC_IENADRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Enable
AT91C_TSADC_IENAGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Enable
AT91C_TSADC_IENAENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Enable
AT91C_TSADC_IENARXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Enable
AT91C_TSADC_IENAPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Enable
AT91C_TSADC_IENANOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Enable
/* - -------- TSADC_IDR : (TSADC Offset: 0x28) Interrupt Disable Register -------- */
AT91C_TSADC_IDISEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Disable
AT91C_TSADC_IDISDRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Disable
AT91C_TSADC_IDISGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Disable
AT91C_TSADC_IDISENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Disable
AT91C_TSADC_IDISRXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Disable
AT91C_TSADC_IDISPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Disable
AT91C_TSADC_IDISNOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Disable
/* - -------- TSADC_IMR : (TSADC Offset: 0x2c) Interrupt Mask Register -------- */
AT91C_TSADC_IMSKEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKDRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Mask
AT91C_TSADC_IMSKGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Mask
AT91C_TSADC_IMSKENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Mask
AT91C_TSADC_IMSKRXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Mask
AT91C_TSADC_IMSKPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Mask
AT91C_TSADC_IMSKNOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Mask
/* - -------- TSADC_CDR0 : (TSADC Offset: 0x30) Channel 0 Data Register -------- */
AT91C_TSADC_DATA0         EQU (0x3FF <<  0) ;- (TSADC) Channel 0 Data
/* - -------- TSADC_CDR1 : (TSADC Offset: 0x34) Channel 1 Data Register -------- */
AT91C_TSADC_DATA1         EQU (0x3FF <<  0) ;- (TSADC) Channel 1 Data
/* - -------- TSADC_CDR2 : (TSADC Offset: 0x38) Channel 2 Data Register -------- */
AT91C_TSADC_DATA2         EQU (0x3FF <<  0) ;- (TSADC) Channel 2 Data
/* - -------- TSADC_CDR3 : (TSADC Offset: 0x3c) Channel 3 Data Register -------- */
AT91C_TSADC_DATA3         EQU (0x3FF <<  0) ;- (TSADC) Channel 3 Data
/* - -------- TSADC_CDR4 : (TSADC Offset: 0x40) Channel 4 Data Register -------- */
AT91C_TSADC_DATA4         EQU (0x3FF <<  0) ;- (TSADC) Channel 4 Data
/* - -------- TSADC_CDR5 : (TSADC Offset: 0x44) Channel 5 Data Register -------- */
AT91C_TSADC_DATA5         EQU (0x3FF <<  0) ;- (TSADC) Channel 5 Data
/* - -------- TSADC_CDR6 : (TSADC Offset: 0x48) Channel 6 Data Register -------- */
AT91C_TSADC_DATA6         EQU (0x3FF <<  0) ;- (TSADC) Channel 6 Data
/* - -------- TSADC_CDR7 : (TSADC Offset: 0x4c) Channel 7 Data Register -------- */
AT91C_TSADC_DATA7         EQU (0x3FF <<  0) ;- (TSADC) Channel 7 Data

