una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
AT91C_HDMA_KEEP3          EQU (0x1 << 27) ;- (HDMA) When set, it resumes the channel 3 from an automatic stall state.
AT91C_HDMA_KEEP3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_KEEP3_1        EQU (0x1 << 27) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_KEEP4          EQU (0x1 << 28) ;- (HDMA) When set, it resumes the channel 4 from an automatic stall state.
AT91C_HDMA_KEEP4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_KEEP4_1        EQU (0x1 << 28) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_KEEP5          EQU (0x1 << 29) ;- (HDMA) When set, it resumes the channel 5 from an automatic stall state.
AT91C_HDMA_KEEP5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_KEEP5_1        EQU (0x1 << 29) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_KEEP6          EQU (0x1 << 30) ;- (HDMA) When set, it resumes the channel 6 from an automatic stall state.
AT91C_HDMA_KEEP6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_KEEP6_1        EQU (0x1 << 30) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_KEEP7          EQU (0x1 << 31) ;- (HDMA) When set, it resumes the channel 7 from an automatic stall state.
AT91C_HDMA_KEEP7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_KEEP7_1        EQU (0x1 << 31) ;- (HDMA) Resumes the channel 7.
/* - -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- */
AT91C_HDMA_DIS0           EQU (0x1 <<  0) ;- (HDMA) Write one to this field to disable the channel 0.
AT91C_HDMA_DIS0_0         EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_DIS0_1         EQU (0x1) ;- (HDMA) Disables the channel 0.
AT91C_HDMA_DIS1           EQU (0x1 <<  1) ;- (HDMA) Write one to this field to disable the channel 1.
AT91C_HDMA_DIS1_0         EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DIS1_1         EQU (0x1 <<  1) ;- (HDMA) Disables the channel 1.
AT91C_HDMA_DIS2           EQU (0x1 <<  2) ;- (HDMA) Write one to this field to disable the channel 2.
AT91C_HDMA_DIS2_0         EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_DIS2_1         EQU (0x1 <<  2) ;- (HDMA) Disables the channel 2.
AT91C_HDMA_DIS3           EQU (0x1 <<  3) ;- (HDMA) Write one to this field to disable the channel 3.
AT91C_HDMA_DIS3_0         EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DIS3_1         EQU (0x1 <<  3) ;- (HDMA) Disables the channel 3.
AT91C_HDMA_DIS4           EQU (0x1 <<  4) ;- (HDMA) Write one to this field to disable the channel 4.
AT91C_HDMA_DIS4_0         EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_DIS4_1         EQU (0x1 <<  4) ;- (HDMA) Disables the channel 4.
AT91C_HDMA_DIS5           EQU (0x1 <<  5) ;- (HDMA) Write one to this field to disable the channel 5.
AT91C_HDMA_DIS5_0         EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DIS5_1         EQU (0x1 <<  5) ;- (HDMA) Disables the channel 5.
AT91C_HDMA_DIS6           EQU (0x1 <<  6) ;- (HDMA) Write one to this field to disable the channel 6.
AT91C_HDMA_DIS6_0         EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_DIS6_1         EQU (0x1 <<  6) ;- (HDMA) Disables the channel 6.
AT91C_HDMA_DIS7           EQU (0x1 <<  7) ;- (HDMA) Write one to this field to disable the channel 7.
AT91C_HDMA_DIS7_0         EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DIS7_1         EQU (0x1 <<  7) ;- (HDMA) Disables the channel 7.
AT91C_HDMA_RES0           EQU (0x1 <<  8) ;- (HDMA) Write one to this field to resume the channel 0 transfer restoring its context.
AT91C_HDMA_RES0_0         EQU (0x0 <<  8) ;- (HDMA) No effect.
AT91C_HDMA_RES0_1         EQU (0x1 <<  8) ;- (HDMA) Resumes the channel 0.
AT91C_HDMA_RES1           EQU (0x1 <<  9) ;- (HDMA) Write one to this field to resume the channel 1 transfer restoring its context.
AT91C_HDMA_RES1_0         EQU (0x0 <<  9) ;- (HDMA) No effect.
AT91C_HDMA_RES1_1         EQU (0x1 <<  9) ;- (HDMA) Resumes the channel 1.
AT91C_HDMA_RES2           EQU (0x1 << 10) ;- (HDMA) Write one to this field to resume the channel 2 transfer restoring its context.
AT91C_HDMA_RES2_0         EQU (0x0 << 10) ;- (HDMA) No effect.
AT91C_HDMA_RES2_1         EQU (0x1 << 10) ;- (HDMA) Resumes the channel 2.
AT91C_HDMA_RES3           EQU (0x1 << 11) ;- (HDMA) Write one to this field to resume the channel 3 transfer restoring its context.
AT91C_HDMA_RES3_0         EQU (0x0 << 11) ;- (HDMA) No effect.
AT91C_HDMA_RES3_1         EQU (0x1 << 11) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_RES4           EQU (0x1 << 12) ;- (HDMA) Write one to this field to resume the channel 4 transfer restoring its context.
AT91C_HDMA_RES4_0         EQU (0x0 << 12) ;- (HDMA) No effect.
AT91C_HDMA_RES4_1         EQU (0x1 << 12) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_RES5           EQU (0x1 << 13) ;- (HDMA) Write one to this field to resume the channel 5 transfer restoring its context.
AT91C_HDMA_RES5_0         EQU (0x0 << 13) ;- (HDMA) No effect.
AT91C_HDMA_RES5_1         EQU (0x1 << 13) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_RES6           EQU (0x1 << 14) ;- (HDMA) Write one to this field to resume the channel 6 transfer restoring its context.
AT91C_HDMA_RES6_0         EQU (0x0 << 14) ;- (HDMA) No effect.
AT91C_HDMA_RES6_1         EQU (0x1 << 14) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_RES7           EQU (0x1 << 15) ;- (HDMA) Write one to this field to resume the channel 7 transfer restoring its context.
AT91C_HDMA_RES7_0         EQU (0x0 << 15) ;- (HDMA) No effect.
AT91C_HDMA_RES7_1         EQU (0x1 << 15) ;- (HDMA) Resumes the channel 7.
/* - -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- */
AT91C_HDMA_EMPT0          EQU (0x1 << 16) ;- (HDMA) When set, channel 0 is empty.
AT91C_HDMA_EMPT0_0        EQU (0x0 << 16) ;- (HDMA) No effect.
AT91C_HDMA_EMPT0_1        EQU (0x1 << 16) ;- (HDMA) Channel 0 empty.
AT91C_HDMA_EMPT1          EQU (0x1 << 17) ;- (HDMA) When set, channel 1 is empty.
AT91C_HDMA_EMPT1_0        EQU (0x0 << 17) ;- (HDMA) No effect.
AT91C_HDMA_EMPT1_1        EQU (0x1 << 17) ;- (HDMA) Channel 1 empty.
AT91C_HDMA_EMPT2          EQU (0x1 << 18) ;- (HDMA) When set, channel 2 is empty.
AT91C_HDMA_EMPT2_0        EQU (0x0 << 18) ;- (HDMA) No effect.
AT91C_HDMA_EMPT2_1        EQU (0x1 << 18) ;- (HDMA) Channel 2 empty.
AT91C_HDMA_EMPT3          EQU (0x1 << 19) ;- (HDMA) When set, channel 3 is empty.
AT91C_HDMA_EMPT3_0        EQU (0x0 << 19) ;- (HDMA) No effect.
AT91C_HDMA_EMPT3_1        EQU (0x1 << 19) ;- (HDMA) Channel 3 empty.
AT91C_HDMA_EMPT4          EQU (0x1 << 20) ;- (HDMA) When set, channel 4 is empty.
AT91C_HDMA_EMPT4_0        EQU (0x0 << 20) ;- (HDMA) No effect.
AT91C_HDMA_EMPT4_1        EQU (0x1 << 20) ;- (HDMA) Channel 4 empty.
AT91C_HDMA_EMPT5          EQU (0x1 << 21) ;- (HDMA) When set, channel 5 is empty.
AT91C_HDMA_EMPT5_0        EQU (0x0 << 21) ;- (HDMA) No effect.
AT91C_HDMA_EMPT5_1        EQU (0x1 << 21) ;- (HDMA) Channel 5 empty.
AT91C_HDMA_EMPT6          EQU (0x1 << 22) ;- (HDMA) When set, channel 6 is empty.
AT91C_HDMA_EMPT6_0        EQU (0x0 << 22) ;- (HDMA) No effect.
AT91C_HDMA_EMPT6_1        EQU (0x1 << 22) ;- (HDMA) Channel 6 empty.
AT91C_HDMA_EMPT7          EQU (0x1 << 23) ;- (HDMA) When set, channel 7 is empty.
AT91C_HDMA_EMPT7_0        EQU (0x0 << 23) ;- (HDMA) No effect.
AT91C_HDMA_EMPT7_1        EQU (0x1 << 23) ;- (HDMA) Channel 7 empty.
AT91C_HDMA_STAL0          EQU (0x1 << 24) ;- (HDMA) When set, channel 0 is stalled.
AT91C_HDMA_STAL0_0        EQU (0x0 << 24) ;- (HDMA) No effect.
AT91C_HDMA_STAL0_1        EQU (0x1 << 24) ;- (HDMA) Channel 0 stalled.
AT91C_HDMA_STAL1          EQU (0x1 << 25) ;- (HDMA) When set, channel 1 is stalled.
AT91C_HDMA_STAL1_0        EQU (0x0 << 25) ;- (HDMA) No effect.
AT91C_HDMA_STAL1_1        EQU (0x1 << 25) ;- (HDMA) Channel 1 stalled.
AT91C_HDMA_STAL2          EQU (0x1 << 26) ;- (HDMA) When set, channel 2 is stalled.
AT91C_HDMA_STAL2_0        EQU (0x0 << 26) ;- (HDMA) No effect.
AT91C_HDMA_STAL2_1        EQU (0x1 << 26) ;- (HDMA) Channel 2 stalled.
AT91C_HDMA_STAL3          EQU (0x1 << 27) ;- (HDMA) When set, channel 3 is stalled.
AT91C_HDMA_STAL3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_STAL3_1        EQU (0x1 << 27) ;- (HDMA) Channel 3 stalled.
AT91C_HDMA_STAL4          EQU (0x1 << 28) ;- (HDMA) When set, channel 4 is stalled.
AT91C_HDMA_STAL4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_STAL4_1        EQU (0x1 << 28) ;- (HDMA) Channel 4 stalled.
AT91C_HDMA_STAL5          EQU (0x1 << 29) ;- (HDMA) When set, channel 5 is stalled.
AT91C_HDMA_STAL5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_STAL5_1        EQU (0x1 << 29) ;- (HDMA) Channel 5 stalled.
AT91C_HDMA_STAL6          EQU (0x1 << 30) ;- (HDMA) When set, channel 6 is stalled.
AT91C_HDMA_STAL6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_STAL6_1        EQU (0x1 << 30) ;- (HDMA) Channel 6 stalled.
AT91C_HDMA_STAL7          EQU (0x1 << 31) ;- (HDMA) When set, channel 7 is stalled.
AT91C_HDMA_STAL7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_STAL7_1        EQU (0x1 << 31) ;- (HDMA) Channel 7 stalled.
/* - -------- HDMA_RSVD : (HDMA Offset: 0x34)  -------- */
/* - -------- HDMA_RSVD : (HDMA Offset: 0x38)  -------- */

