una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Image Sensor Interface*/
/* - ******************************************************************************/
/* - -------- ISI_CFG1 : (ISI Offset: 0x0) ISI Configuration Register 1 -------- */
AT91C_ISI_HSYNC_POL       EQU (0x1 <<  2) ;- (ISI) Horizontal synchronization polarity
AT91C_ISI_HSYNC_POL_ACTIVE_HIGH EQU (0x0 <<  2) ;- (ISI) HSYNC active high.
AT91C_ISI_HSYNC_POL_ACTIVE_LOW EQU (0x1 <<  2) ;- (ISI) HSYNC active low.
AT91C_ISI_PIXCLK_POL      EQU (0x1 <<  4) ;- (ISI) Pixel Clock Polarity
AT91C_ISI_PIXCLK_POL_RISING_EDGE EQU (0x0 <<  4) ;- (ISI) Data is sampled on rising edge of pixel clock.
AT91C_ISI_PIXCLK_POL_FALLING_EDGE EQU (0x1 <<  4) ;- (ISI) Data is sampled on falling edge of pixel clock.
AT91C_ISI_EMB_SYNC        EQU (0x1 <<  6) ;- (ISI) Embedded synchronisation
AT91C_ISI_EMB_SYNC_HSYNC_VSYNC EQU (0x0 <<  6) ;- (ISI) Synchronization by HSYNC, VSYNC.
AT91C_ISI_EMB_SYNC_SAV_EAV EQU (0x1 <<  6) ;- (ISI) Synchronisation by Embedded Synchronization Sequence SAV/EAV.
AT91C_ISI_CRC_SYNC        EQU (0x1 <<  7) ;- (ISI) CRC correction
AT91C_ISI_CRC_SYNC_CORRECTION_OFF EQU (0x0 <<  7) ;- (ISI) No CRC correction performed on embedded synchronization.
AT91C_ISI_CRC_SYNC_CORRECTION_ON EQU (0x1 <<  7) ;- (ISI) CRC correction is performed.
AT91C_ISI_FRATE           EQU (0x7 <<  8) ;- (ISI) Frame rate capture
AT91C_ISI_FULL            EQU (0x1 << 12) ;- (ISI) Full mode is allowed
AT91C_ISI_FULL_MODE_DISABLE EQU (0x0 << 12) ;- (ISI) Full mode disabled.
AT91C_ISI_FULL_MODE_ENABLE EQU (0x1 << 12) ;- (ISI) both codec and preview datapath are working simultaneously.
AT91C_ISI_THMASK          EQU (0x3 << 13) ;- (ISI) DMA Burst Mask
AT91C_ISI_THMASK_4_BURST  EQU (0x0 << 13) ;- (ISI) Only 4 beats AHB bursts are allowed
AT91C_ISI_THMASK_4_8_BURST EQU (0x1 << 13) ;- (ISI) Only 4 and 8 beats AHB bursts are allowed
AT91C_ISI_THMASK_4_8_16_BURST EQU (0x2 << 13) ;- (ISI) 4, 8 and 16 beats AHB bursts are allowed
AT91C_ISI_SLD             EQU (0xFF << 16) ;- (ISI) Start of Line Delay
AT91C_ISI_SFD             EQU (0xFF << 24) ;- (ISI) Start of frame Delay
/* - -------- ISI_CFG2 : (ISI Offset: 0x4) ISI Control Register 2 -------- */
AT91C_ISI_IM_VSIZE        EQU (0x7FF <<  0) ;- (ISI) Vertical size of the Image sensor [0..2047]
AT91C_ISI_GS_MODE         EQU (0x1 << 11) ;- (ISI) Grayscale Memory Mode
AT91C_ISI_GS_MODE_2_PIXELS EQU (0x0 << 11) ;- (ISI) 2 pixels per word.
AT91C_ISI_GS_MODE_1_PIXEL EQU (0x1 << 11) ;- (ISI) 1 pixel per word.
AT91C_ISI_RGB_MODE        EQU (0x1 << 12) ;- (ISI) RGB mode
AT91C_ISI_RGB_MODE_RGB_888 EQU (0x0 << 12) ;- (ISI) RGB 8:8:8 24 bits
AT91C_ISI_RGB_MODE_RGB_565 EQU (0x1 << 12) ;- (ISI) RGB 5:6:5 16 bits
AT91C_ISI_GRAYSCALE       EQU (0x1 << 13) ;- (ISI) Grayscale Mode
AT91C_ISI_GRAYSCALE_DISABLE EQU (0x0 << 13) ;- (ISI) Grayscale mode is disabled
AT91C_ISI_GRAYSCALE_ENABLE EQU (0x1 << 13) ;- (ISI) Input image is assumed to be grayscale coded
AT91C_ISI_RGB_SWAP        EQU (0x1 << 14) ;- (ISI) RGB Swap
AT91C_ISI_RGB_SWAP_DISABLE EQU (0x0 << 14) ;- (ISI) D7 -> R7
AT91C_ISI_RGB_SWAP_ENABLE EQU (0x1 << 14) ;- (ISI) D0 -> R7
AT91C_ISI_COL_SPACE       EQU (0x1 << 15) ;- (ISI) Color space for the image data
AT91C_ISI_COL_SPACE_YCBCR EQU (0x0 << 15) ;- (ISI) YCbCr
AT91C_ISI_COL_SPACE_RGB   EQU (0x1 << 15) ;- (ISI) RGB
AT91C_ISI_IM_HSIZE        EQU (0x7FF << 16) ;- (ISI) Horizontal size of the Image sensor [0..2047]
AT91C_ISI_YCC_SWAP        EQU (0x3 << 28) ;- (ISI) Ycc swap
AT91C_ISI_YCC_SWAP_YCC_DEFAULT EQU (0x0 << 28) ;- (ISI) Cb(i) Y(i) Cr(i) Y(i+1)
AT91C_ISI_YCC_SWAP_YCC_MODE1 EQU (0x1 << 28) ;- (ISI) Cr(i) Y(i) Cb(i) Y(i+1)
AT91C_ISI_YCC_SWAP_YCC_MODE2 EQU (0x2 << 28) ;- (ISI) Y(i) Cb(i) Y(i+1) Cr(i)
AT91C_ISI_YCC_SWAP_YCC_MODE3 EQU (0x3 << 28) ;- (ISI) Y(i) Cr(i) Y(i+1) Cb(i)
AT91C_ISI_RGB_CFG         EQU (0x3 << 30) ;- (ISI) RGB configuration
AT91C_ISI_RGB_CFG_RGB_DEFAULT EQU (0x0 << 30) ;- (ISI) R/G(MSB)  G(LSB)/B  R/G(MSB)  G(LSB)/B
AT91C_ISI_RGB_CFG_RGB_MODE1 EQU (0x1 << 30) ;- (ISI) B/G(MSB)  G(LSB)/R  B/G(MSB)  G(LSB)/R
AT91C_ISI_RGB_CFG_RGB_MODE2 EQU (0x2 << 30) ;- (ISI) G(LSB)/R  B/G(MSB)  G(LSB)/R  B/G(MSB)
AT91C_ISI_RGB_CFG_RGB_MODE3 EQU (0x3 << 30) ;- (ISI) G(LSB)/B  R/G(MSB)  G(LSB)/B  R/G(MSB)
/* - -------- ISI_PSIZE : (ISI Offset: 0x8) ISI Preview Register -------- */
AT91C_ISI_PREV_VSIZE      EQU (0x3FF <<  0) ;- (ISI) Vertical size for the preview path
AT91C_ISI_PREV_HSIZE      EQU (0x3FF << 16) ;- (ISI) Horizontal size for the preview path
/* - -------- ISI_Y2RSET0 : (ISI Offset: 0x10) Color Space Conversion YCrCb to RGB Register -------- */
AT91C_ISI_Y2R_C0          EQU (0xFF <<  0) ;- (ISI) Color Space Conversion Matrix Coefficient C0
AT91C_ISI_Y2R_C1          EQU (0xFF <<  8) ;- (ISI) Color Space Conversion Matrix Coefficient C1
AT91C_ISI_Y2R_C2          EQU (0xFF << 16) ;- (ISI) Color Space Conversion Matrix Coefficient C2
AT91C_ISI_Y2R_C3          EQU (0xFF << 24) ;- (ISI) Color Space Conversion Matrix Coefficient C3
/* - -------- ISI_Y2RSET1 : (ISI Offset: 0x14) ISI Color Space Conversion YCrCb to RGB set 1 Register -------- */
AT91C_ISI_Y2R_C4          EQU (0x1FF <<  0) ;- (ISI) Color Space Conversion Matrix Coefficient C4
AT91C_ISI_Y2R_YOFF        EQU (0x1 << 12) ;- (ISI) Color Space Conversion Luninance default offset
AT91C_ISI_Y2R_YOFF_0      EQU (0x0 << 12) ;- (ISI) Offset is 0
AT91C_ISI_Y2R_YOFF_128    EQU (0x1 << 12) ;- (ISI) Offset is 128
AT91C_ISI_Y2R_CROFF       EQU (0x1 << 13) ;- (ISI) Color Space Conversion Red Chrominance default offset
AT91C_ISI_Y2R_CROFF_0     EQU (0x0 << 13) ;- (ISI) Offset is 0
AT91C_ISI_Y2R_CROFF_16    EQU (0x1 << 13) ;- (ISI) Offset is 16
AT91C_ISI_Y2R_CBOFF       EQU (0x1 << 14) ;- (ISI) Color Space Conversion Blue Chrominance default offset
AT91C_ISI_Y2R_CBOFF_0     EQU (0x0 << 14) ;- (ISI) Offset is 0
AT91C_ISI_Y2R_CBOFF_16    EQU (0x1 << 14) ;- (ISI) Offset is 16
/* - -------- ISI_R2YSET0 : (ISI Offset: 0x18) Color Space Conversion RGB to YCrCb set 0 register -------- */
AT91C_ISI_R2Y_C0          EQU (0xFF <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C0
AT91C_ISI_R2Y_C1          EQU (0xFF <<  8) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C1
AT91C_ISI_R2Y_C2          EQU (0xFF << 16) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C2
AT91C_ISI_R2Y_ROFF        EQU (0x1 << 24) ;- (ISI) Color Space Conversion Red component offset
AT91C_ISI_R2Y_ROFF_0      EQU (0x0 << 24) ;- (ISI) Offset is 0
AT91C_ISI_R2Y_ROFF_16     EQU (0x1 << 24) ;- (ISI) Offset is 16
/* - -------- ISI_R2YSET1 : (ISI Offset: 0x1c) Color Space Conversion RGB to YCrCb set 1 register -------- */
AT91C_ISI_R2Y_C3          EQU (0xFF <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C3
AT91C_ISI_R2Y_C4          EQU (0xFF <<  8) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C4
AT91C_ISI_R2Y_C5          EQU (0xFF << 16) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C5
AT91C_ISI_R2Y_GOFF        EQU (0x1 << 24) ;- (ISI) Color Space Conversion Green component offset
AT91C_ISI_R2Y_GOFF_0      EQU (0x0 << 24) ;- (ISI) Offset is 0
AT91C_ISI_R2Y_GOFF_128    EQU (0x1 << 24) ;- (ISI) Offset is 128
/* - -------- ISI_R2YSET2 : (ISI Offset: 0x20) Color Space Conversion RGB to YCrCb set 2 register -------- */
AT91C_ISI_R2Y_C6          EQU (0xFF <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C6
AT91C_ISI_R2Y_C7          EQU (0xFF <<  8) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C7
AT91C_ISI_R2Y_C8          EQU (0xFF << 16) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C8
AT91C_ISI_R2Y_BOFF        EQU (0x1 << 24) ;- (ISI) Color Space Conversion Blue component offset
AT91C_ISI_R2Y_BOFF_0      EQU (0x0 << 24) ;- (ISI) Offset is 0
AT91C_ISI_R2Y_BOFF_128    EQU (0x1 << 24) ;- (ISI) Offset is 128
/* - -------- ISI_CTRL : (ISI Offset: 0x24) ISI Control Register -------- */
AT91C_ISI_EN              EQU (0x1 <<  0) ;- (ISI) Image Sensor Interface Enable Request
AT91C_ISI_EN_0            EQU (0x0) ;- (ISI) No effect
AT91C_ISI_EN_1            EQU (0x1) ;- (ISI) Enable the module and the capture
AT91C_ISI_DIS             EQU (0x1 <<  1) ;- (ISI) Image Sensor Interface Disable Request
AT91C_ISI_DIS_0           EQU (0x0 <<  1) ;- (ISI) No effect
AT91C_ISI_DIS_1           EQU (0x1 <<  1) ;- (ISI) Disable the module and the capture
AT91C_ISI_SRST            EQU (0x1 <<  2) ;- (ISI) Software Reset Request
AT91C_ISI_SRST_0          EQU (0x0 <<  2) ;- (ISI) No effect
AT91C_ISI_SRST_1          EQU (0x1 <<  2) ;- (ISI) Reset the module
AT91C_ISI_CDC             EQU (0x1 <<  8) ;- (ISI) Codec Request
AT91C_ISI_CDC_0           EQU (0x0 <<  8) ;- (ISI) No effect
AT91C_ISI_CDC_1           EQU (0x1 <<  8) ;- (ISI) Enable the Codec
/* - -------- ISI_SR : (ISI Offset: 0x28) ISI Status Register -------- */
AT91C_ISI_VSYNC           EQU (0x1 << 10) ;- (ISI) Vertical Synchronization
AT91C_ISI_VSYNC_0         EQU (0x0 << 10) ;- (ISI) No effect
AT91C_ISI_VSYNC_1         EQU (0x1 << 10) ;- (ISI) Indicates that a Vertical Synchronization has been detected since last read
AT91C_ISI_PXFR_DONE       EQU (0x1 << 16) ;- (ISI) Preview DMA transfer terminated
AT91C_ISI_PXFR_DONE_0     EQU (0x0 << 16) ;- (ISI) No effect
AT91C_ISI_PXFR_DONE_1     EQU (0x1 << 16) ;- (ISI) Indicates that DATA transfer on preview channel has completed since last read
AT91C_ISI_CXFR_DONE       EQU (0x1 << 17) ;- (ISI) Codec DMA transfer terminated
AT91C_ISI_CXFR_DONE_0     EQU (0x0 << 17) ;- (ISI) No effect
AT91C_ISI_CXFR_DONE_1     EQU (0x1 << 17) ;- (ISI) Indicates that DATA transfer on preview channel has completed since last read
AT91C_ISI_SIP             EQU (0x1 << 19) ;- (ISI) Synchronization In Progress
AT91C_ISI_SIP_0           EQU (0x0 << 19) ;- (ISI) No effect
AT91C_ISI_SIP_1           EQU (0x1 << 19) ;- (ISI) Indicates that Synchronization is in progress
AT91C_ISI_P_OVR           EQU (0x1 << 24) ;- (ISI) Fifo Preview Overflow 
AT91C_ISI_P_OVR_0         EQU (0x0 << 24) ;- (ISI) No error
AT91C_ISI_P_OVR_1         EQU (0x1 << 24) ;- (ISI) An overrun condition has occurred in input FIFO on the preview path
AT91C_ISI_C_OVR           EQU (0x1 << 25) ;- (ISI) Fifo Codec Overflow 
AT91C_ISI_C_OVR_0         EQU (0x0 << 25) ;- (ISI) No error
AT91C_ISI_C_OVR_1         EQU (0x1 << 25) ;- (ISI) An overrun condition has occurred in input FIFO on the codec path
AT91C_ISI_CRC_ERR         EQU (0x1 << 26) ;- (ISI) CRC synchronisation error
AT91C_ISI_CRC_ERR_0       EQU (0x0 << 26) ;- (ISI) No error
AT91C_ISI_CRC_ERR_1       EQU (0x1 << 26) ;- (ISI) CRC_SYNC is enabled in the control register and an error has been detected and not corrected. The frame is discarded and the ISI waits for a new one.
AT91C_ISI_FR_OVR          EQU (0x1 << 27) ;- (ISI) Frame rate overun
AT91C_ISI_FR_OVR_0        EQU (0x0 << 27) ;- (ISI) No error
AT91C_ISI_FR_OVR_1        EQU (0x1 << 27) ;- (ISI) Frame overrun, the current frame is being skipped because a vsync signal has been detected while flushing FIFOs.
/* - -------- ISI_IER : (ISI Offset: 0x2c) ISI Interrupt Enable Register -------- */
/* - -------- ISI_IDR : (ISI Offset: 0x30) ISI Interrupt Disable Register -------- */
/* - -------- ISI_IMR : (ISI Offset: 0x34) ISI Interrupt Mask Register -------- */
/* - -------- ISI_DMACHER : (ISI Offset: 0x38) DMA Channel Enable Register -------- */
AT91C_ISI_P_CH_EN         EQU (0x1 <<  0) ;- (ISI) Preview Channel Enable
AT91C_ISI_P_CH_EN_0       EQU (0x0) ;- (ISI) No effect
AT91C_ISI_P_CH_EN_1       EQU (0x1) ;- (ISI) Enable the Preview Channel
AT91C_ISI_C_CH_EN         EQU (0x1 <<  1) ;- (ISI) Codec Channel Enable
AT91C_ISI_C_CH_EN_0       EQU (0x0 <<  1) ;- (ISI) No effect
AT91C_ISI_C_CH_EN_1       EQU (0x1 <<  1) ;- (ISI) Enable the Codec Channel
/* - -------- ISI_DMACHDR : (ISI Offset: 0x3c) DMA Channel Enable Register -------- */
AT91C_ISI_P_CH_DIS        EQU (0x1 <<  0) ;- (ISI) Preview Channel Disable
AT91C_ISI_P_CH_DIS_0      EQU (0x0) ;- (ISI) No effect
AT91C_ISI_P_CH_DIS_1      EQU (0x1) ;- (ISI) Disable the Preview Channel
AT91C_ISI_C_CH_DIS        EQU (0x1 <<  1) ;- (ISI) Codec Channel Disable
AT91C_ISI_C_CH_DIS_0      EQU (0x0 <<  1) ;- (ISI) No effect
AT91C_ISI_C_CH_DIS_1      EQU (0x1 <<  1) ;- (ISI) Disable the Codec Channel
/* - -------- ISI_DMACHSR : (ISI Offset: 0x40) DMA Channel Status Register -------- */
AT91C_ISI_P_CH_S          EQU (0x1 <<  0) ;- (ISI) Preview Channel Disable
AT91C_ISI_P_CH_S_0        EQU (0x0) ;- (ISI) Preview Channel is disabled
AT91C_ISI_P_CH_S_1        EQU (0x1) ;- (ISI) Preview Channel is enabled
AT91C_ISI_C_CH_S          EQU (0x1 <<  1) ;- (ISI) Codec Channel Disable
AT91C_ISI_C_CH_S_0        EQU (0x0 <<  1) ;- (ISI) Codec Channel is disabled
AT91C_ISI_C_CH_S_1        EQU (0x1 <<  1) ;- (ISI) Codec Channel is enabled
/* - -------- ISI_DMAPCTRL : (ISI Offset: 0x48) DMA Preview Control Register -------- */
AT91C_ISI_P_FETCH         EQU (0x1 <<  0) ;- (ISI) Preview Descriptor Fetch Control Field
AT91C_ISI_P_FETCH_DISABLE EQU (0x0) ;- (ISI) Preview Channel Fetch Operation is disabled
AT91C_ISI_P_FETCH_ENABLE  EQU (0x1) ;- (ISI) Preview Channel Fetch Operation is enabled
AT91C_ISI_P_DONE          EQU (0x1 <<  1) ;- (ISI) Preview Transfer Done Flag
AT91C_ISI_P_DONE_0        EQU (0x0 <<  1) ;- (ISI) Preview Transfer has not been performed
AT91C_ISI_P_DONE_1        EQU (0x1 <<  1) ;- (ISI) Preview Transfer has completed
/* - -------- ISI_DMACCTRL : (ISI Offset: 0x54) DMA Codec Control Register -------- */
AT91C_ISI_C_FETCH         EQU (0x1 <<  0) ;- (ISI) Codec Descriptor Fetch Control Field
AT91C_ISI_C_FETCH_DISABLE EQU (0x0) ;- (ISI) Codec Channel Fetch Operation is disabled
AT91C_ISI_C_FETCH_ENABLE  EQU (0x1) ;- (ISI) Codec Channel Fetch Operation is enabled
AT91C_ISI_C_DONE          EQU (0x1 <<  1) ;- (ISI) Codec Transfer Done Flag
AT91C_ISI_C_DONE_0        EQU (0x0 <<  1) ;- (ISI) Codec Transfer has not been performed
AT91C_ISI_C_DONE_1        EQU (0x1 <<  1) ;- (ISI) Codec Transfer has completed
/* - -------- ISI_WPCR : (ISI Offset: 0xe4) Write Protection Control Register -------- */
AT91C_ISI_WP_EN           EQU (0x1 <<  0) ;- (ISI) Write Protection Enable
AT91C_ISI_WP_EN_DISABLE   EQU (0x0) ;- (ISI) Write Operation is disabled (if WP_KEY corresponds)
AT91C_ISI_WP_EN_ENABLE    EQU (0x1) ;- (ISI) Write Operation is enabled (if WP_KEY corresponds)
AT91C_ISI_WP_KEY          EQU (0xFFFFFF <<  8) ;- (ISI) Write Protection Key
/* - -------- ISI_WPSR : (ISI Offset: 0xe8) Write Protection Status Register -------- */
AT91C_ISI_WP_VS           EQU (0xF <<  0) ;- (ISI) Write Protection Violation Status
AT91C_ISI_WP_VS_NO_VIOLATION EQU (0x0) ;- (ISI) No Write Protection Violation detected since last read
AT91C_ISI_WP_VS_ON_WRITE  EQU (0x1) ;- (ISI) Write Protection Violation detected since last read
AT91C_ISI_WP_VS_ON_RESET  EQU (0x2) ;- (ISI) Software Reset Violation detected since last read
AT91C_ISI_WP_VS_ON_BOTH   EQU (0x3) ;- (ISI) Write Protection and Software Reset Violation detected since last read
AT91C_ISI_WP_VSRC         EQU (0xF <<  8) ;- (ISI) Write Protection Violation Source
AT91C_ISI_WP_VSRC_NO_VIOLATION EQU (0x0 <<  8) ;- (ISI) No Write Protection Violation detected since last read
AT91C_ISI_WP_VSRC_ISI_CFG1 EQU (0x1 <<  8) ;- (ISI) Write Protection Violation detected on ISI_CFG1 since last read
AT91C_ISI_WP_VSRC_ISI_CFG2 EQU (0x2 <<  8) ;- (ISI) Write Protection Violation detected on ISI_CFG2 since last read
AT91C_ISI_WP_VSRC_ISI_PSIZE EQU (0x3 <<  8) ;- (ISI) Write Protection Violation detected on ISI_PSIZE since last read
AT91C_ISI_WP_VSRC_ISI_PDECF EQU (0x4 <<  8) ;- (ISI) Write Protection Violation detected on ISI_PDECF since last read
AT91C_ISI_WP_VSRC_ISI_Y2RSET0 EQU (0x5 <<  8) ;- (ISI) Write Protection Violation detected on ISI_Y2RSET0 since last read
AT91C_ISI_WP_VSRC_ISI_Y2RSET1 EQU (0x6 <<  8) ;- (ISI) Write Protection Violation detected on ISI_Y2RSET1 since last read
AT91C_ISI_WP_VSRC_ISI_R2YSET0 EQU (0x7 <<  8) ;- (ISI) Write Protection Violation detected on ISI_R2YSET0 since last read
AT91C_ISI_WP_VSRC_ISI_R2YSET1 EQU (0x8 <<  8) ;- (ISI) Write Protection Violation detected on ISI_R2YSET1 since last read
AT91C_ISI_WP_VSRC_ISI_R2YSET2 EQU (0x9 <<  8) ;- (ISI) Write Protection Violation detected on ISI_R2YSET2 since last read

