una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR HANTRO VDEC 7190*/
/* - ******************************************************************************/
/* - -------- VDEC_IDR : (VDEC Offset: 0x0) VDEC ID Register -------- */
AT91C_VDEC_ID             EQU (0x0 <<  0) ;- (VDEC) VDEC identification number
/* - -------- VDEC_ISR : (VDEC Offset: 0x4) VDEC Interrupt Status Register -------- */
AT91C_VDEC_DEC_E          EQU (0x1 <<  0) ;- (VDEC) VDEC Decoder Enable
AT91C_VDEC_DEC_IRQ_DIS    EQU (0x1 <<  4) ;- (VDEC) VDEC IRQ disable
AT91C_VDEC_DEC_IRQ        EQU (0x1 <<  8) ;- (VDEC) VDEC Interrupt Request
AT91C_VDEC_DEC_RDY_INT    EQU (0x1 << 12) ;- (VDEC) VDEC Decoder Ready
AT91C_VDEC_DEC_BUS_INT    EQU (0x1 << 13) ;- (VDEC) VDEC Error response from bus
AT91C_VDEC_DEC_BUFFER_INT EQU (0x1 << 14) ;- (VDEC) VDEC Buffer empty
AT91C_VDEC_DEC_ASO_INT    EQU (0x1 << 15) ;- (VDEC) VDEC ASO detected
AT91C_VDEC_DEC_ERROR_INT  EQU (0x1 << 16) ;- (VDEC) VDEC Input Data Stream Error
AT91C_VDEC_DEC_SLICE_INT  EQU (0x1 << 17) ;- (VDEC) VDEC JPEG Slice Decoded Interrupt
AT91C_VDEC_DEC_TIMEOUT    EQU (0x1 << 18) ;- (VDEC) VDEC Decoder Timeout
/* - -------- VDEC_DCR : (VDEC Offset: 0x8) VDEC Device Configuration Register -------- */
AT91C_VDEC_DEC_MAX_BURST  EQU (0x1F <<  0) ;- (VDEC) VDEC maximum burst length
AT91C_VDEC_DEC_MAX_BURST_4 EQU (0x4) ;- (VDEC) INCR4
AT91C_VDEC_DEC_MAX_BURST_8 EQU (0x8) ;- (VDEC) INCR8
AT91C_VDEC_DEC_MAX_BURST_16 EQU (0x10) ;- (VDEC) INCR16
AT91C_VDEC_PRIORITY_MODE  EQU (0x7 <<  5) ;- (VDEC) VDEC priority mode
AT91C_VDEC_PRIORITY_MODE_HW EQU (0x0 <<  5) ;- (VDEC) 
AT91C_VDEC_PRIORITY_MODE_WRITE_FT EQU (0x1 <<  5) ;- (VDEC) 
AT91C_VDEC_PRIORITY_MODE_WRITE_PP EQU (0x2 <<  5) ;- (VDEC) 
AT91C_VDEC_PRIORITY_MODE_READ_FT EQU (0x3 <<  5) ;- (VDEC) 
AT91C_VDEC_PRIORITY_MODE_READ_PP EQU (0x4 <<  5) ;- (VDEC) 
AT91C_VDEC_DEC_OUT_ENDIAN EQU (0x1 <<  8) ;- (VDEC) VDEC decoder output endian mode
AT91C_VDEC_DEC_OUT_ENDIAN_BIG EQU (0x0 <<  8) ;- (VDEC) BIG ENDIAN
AT91C_VDEC_DEC_OUT_ENDIAN_LIT EQU (0x1 <<  8) ;- (VDEC) LITTLE ENDIAN
AT91C_VDEC_DEC_IN_ENDIAN  EQU (0x1 <<  9) ;- (VDEC) VDEC decoder input endian mode
AT91C_VDEC_DEC_IN_ENDIAN_BIG EQU (0x0 <<  9) ;- (VDEC) BIG ENDIAN
AT91C_VDEC_DEC_IN_ENDIAN_LIT EQU (0x1 <<  9) ;- (VDEC) LITTLE ENDIAN
AT91C_VDEC_DEC_CLK_GATE_E EQU (0x1 << 10) ;- (VDEC) VDEC dynamic clock gating enable
AT91C_VDEC_DEC_LATENCY    EQU (0x3F << 11) ;- (VDEC) VDEC decoder latency compensation
AT91C_VDEC_DEC_OUT_TILED_E EQU (0x1 << 17) ;- (VDEC) VDEC identification number
AT91C_VDEC_DEC_DATA_DISC_E EQU (0x1 << 18) ;- (VDEC) VDEC data discard enable
AT91C_VDEC_DEC_OUTSWAP32_E EQU (0x1 << 19) ;- (VDEC) VDEC output 32bit data swap
AT91C_VDEC_DEC_INSWAP32_E EQU (0x1 << 20) ;- (VDEC) VDEC input 32bit data swap
AT91C_VDEC_DEC_STRENDIAN_E EQU (0x1 << 21) ;- (VDEC) VDEC data stream endian mode
AT91C_VDEC_DEC_STRENDIAN_E_BIG EQU (0x0 << 21) ;- (VDEC) BIG ENDIAN
AT91C_VDEC_DEC_STRENDIAN_E_LIT EQU (0x1 << 21) ;- (VDEC) LITTLE ENDIAN
AT91C_VDEC_DEC_STRSWAP32_E EQU (0x1 << 22) ;- (VDEC) VDEC input 32bit data swap for stream data
AT91C_VDEC_DEC_TIMEOUT_E  EQU (0x1 << 23) ;- (VDEC) VDEC timeout interrupt enable

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* - ******************************************************************************/
/* - -------- VERSION : (UHPHS_EHCI Offset: 0x0)  -------- */
AT91C_UHPHS_CAPLENGTH     EQU (0xFF <<  0) ;- (UHPHS_EHCI) CapLength : Offset for control registers
AT91C_UHPHS_HCIVERSION    EQU (0xFF << 16) ;- (UHPHS_EHCI) Hci Version

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Advanced  Encryption Standard*/
/* - ******************************************************************************/
/* - -------- AES_CR : (AES Offset: 0x0) Control Register -------- */
AT91C_AES_START           EQU (0x1 <<  0) ;- (AES) Starts Processing
AT91C_AES_SWRST           EQU (0x1 <<  8) ;- (AES) Software Reset
AT91C_AES_LOADSEED        EQU (0x1 << 16) ;- (AES) Random Number Generator Seed Loading
/* - -------- AES_MR : (AES Offset: 0x4) Mode Register -------- */
AT91C_AES_CIPHER          EQU (0x1 <<  0) ;- (AES) Processing Mode
AT91C_AES_PROCDLY         EQU (0xF <<  4) ;- (AES) Processing Delay
AT91C_AES_SMOD            EQU (0x3 <<  8) ;- (AES) Start Mode
AT91C_AES_SMOD_MANUAL     EQU (0x0 <<  8) ;- (AES) Manual Mode: The START bit in register AES_CR must be set to begin encryption or decryption.
AT91C_AES_SMOD_AUTO       EQU (0x1 <<  8) ;- (AES) Auto Mode: no action in AES_CR is necessary (cf datasheet).
AT91C_AES_SMOD_PDC        EQU (0x2 <<  8) ;- (AES) PDC Mode (cf datasheet).
AT91C_AES_KEYSIZE         EQU (0x3 << 10) ;- (AES) Key Size
AT91C_AES_KEYSIZE_128_BIT EQU (0x0 << 10) ;- (AES) AES Key Size: 128 bits.
AT91C_AES_KEYSIZE_192_BIT EQU (0x1 << 10) ;- (AES) AES Key Size: 192 bits.
AT91C_AES_KEYSIZE_256_BIT EQU (0x2 << 10) ;- (AES) AES Key Size: 256-bits.
AT91C_AES_OPMOD           EQU (0x7 << 12) ;- (AES) Operation Mode
AT91C_AES_OPMOD_ECB       EQU (0x0 << 12) ;- (AES) ECB Electronic CodeBook mode.
AT91C_AES_OPMOD_CBC       EQU (0x1 << 12) ;- (AES) CBC Cipher Block Chaining mode.
AT91C_AES_OPMOD_OFB       EQU (0x2 << 12) ;- (AES) OFB Output Feedback mode.
AT91C_AES_OPMOD_CFB       EQU (0x3 << 12) ;- (AES) CFB Cipher Feedback mode.
AT91C_AES_OPMOD_CTR       EQU (0x4 << 12) ;- (AES) CTR Counter mode.
AT91C_AES_LOD             EQU (0x1 << 15) ;- (AES) Last Output Data Mode
AT91C_AES_CFBS            EQU (0x7 << 16) ;- (AES) Cipher Feedback Data Size
AT91C_AES_CFBS_128_BIT    EQU (0x0 << 16) ;- (AES) 128-bit.
AT91C_AES_CFBS_64_BIT     EQU (0x1 << 16) ;- (AES) 64-bit.
AT91C_AES_CFBS_32_BIT     EQU (0x2 << 16) ;- (AES) 32-bit.
AT91C_AES_CFBS_16_BIT     EQU (0x3 << 16) ;- (AES) 16-bit.
AT91C_AES_CFBS_8_BIT      EQU (0x4 << 16) ;- (AES) 8-bit.
AT91C_AES_CKEY            EQU (0xF << 20) ;- (AES) Countermeasure Key
AT91C_AES_CTYPE           EQU (0x1F << 24) ;- (AES) Countermeasure Type
AT91C_AES_CTYPE_TYPE1_EN  EQU (0x1 << 24) ;- (AES) Countermeasure type 1 is enabled.
AT91C_AES_CTYPE_TYPE2_EN  EQU (0x2 << 24) ;- (AES) Countermeasure type 2 is enabled.
AT91C_AES_CTYPE_TYPE3_EN  EQU (0x4 << 24) ;- (AES) Countermeasure type 3 is enabled.
AT91C_AES_CTYPE_TYPE4_EN  EQU (0x8 << 24) ;- (AES) Countermeasure type 4 is enabled.
AT91C_AES_CTYPE_TYPE5_EN  EQU (0x10 << 24) ;- (AES) Countermeasure type 5 is enabled.
/* - -------- AES_IER : (AES Offset: 0x10) Interrupt Enable Register -------- */
AT91C_AES_DATRDY          EQU (0x1 <<  0) ;- (AES) DATRDY
AT91C_AES_ENDRX           EQU (0x1 <<  1) ;- (AES) PDC Read Buffer End
AT91C_AES_ENDTX           EQU (0x1 <<  2) ;- (AES) PDC Write Buffer End
AT91C_AES_RXBUFF          EQU (0x1 <<  3) ;- (AES) PDC Read Buffer Full
AT91C_AES_TXBUFE          EQU (0x1 <<  4) ;- (AES) PDC Write Buffer Empty
AT91C_AES_URAD            EQU (0x1 <<  8) ;- (AES) Unspecified Register Access Detection
/* - -------- AES_IDR : (AES Offset: 0x14) Interrupt Disable Register -------- */
/* - -------- AES_IMR : (AES Offset: 0x18) Interrupt Mask Register -------- */
/* - -------- AES_ISR : (AES Offset: 0x1c) Interrupt Status Register -------- */
AT91C_AES_URAT            EQU (0x7 << 12) ;- (AES) Unspecified Register Access Type Status
AT91C_AES_URAT_IN_DAT_WRITE_DATPROC EQU (0x0 << 12) ;- (AES) Input data register written during the data processing in PDC mode.
AT91C_AES_URAT_OUT_DAT_READ_DATPROC EQU (0x1 << 12) ;- (AES) Output data register read during the data processing.
AT91C_AES_URAT_MODEREG_WRITE_DATPROC EQU (0x2 << 12) ;- (AES) Mode register written during the data processing.
AT91C_AES_URAT_OUT_DAT_READ_SUBKEY EQU (0x3 << 12) ;- (AES) Output data register read during the sub-keys generation.
AT91C_AES_URAT_MODEREG_WRITE_SUBKEY EQU (0x4 << 12) ;- (AES) Mode register written during the sub-keys generation.
AT91C_AES_URAT_WO_REG_READ EQU (0x5 << 12) ;- (AES) Write-only register read access.

