una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Triple Data Encryption Standard*/
/* - ******************************************************************************/
/* - -------- TDES_CR : (TDES Offset: 0x0) Control Register -------- */
AT91C_TDES_START          EQU (0x1 <<  0) ;- (TDES) Starts Processing
AT91C_TDES_SWRST          EQU (0x1 <<  8) ;- (TDES) Software Reset
/* - -------- TDES_MR : (TDES Offset: 0x4) Mode Register -------- */
AT91C_TDES_CIPHER         EQU (0x1 <<  0) ;- (TDES) Processing Mode
AT91C_TDES_TDESMOD        EQU (0x1 <<  1) ;- (TDES) Single or Triple DES Mode
AT91C_TDES_KEYMOD         EQU (0x1 <<  4) ;- (TDES) Key Mode
AT91C_TDES_SMOD           EQU (0x3 <<  8) ;- (TDES) Start Mode
AT91C_TDES_SMOD_MANUAL    EQU (0x0 <<  8) ;- (TDES) Manual Mode: The START bit in register TDES_CR must be set to begin encryption or decryption.
AT91C_TDES_SMOD_AUTO      EQU (0x1 <<  8) ;- (TDES) Auto Mode: no action in TDES_CR is necessary (cf datasheet).
AT91C_TDES_SMOD_PDC       EQU (0x2 <<  8) ;- (TDES) PDC Mode (cf datasheet).
AT91C_TDES_OPMOD          EQU (0x3 << 12) ;- (TDES) Operation Mode
AT91C_TDES_OPMOD_ECB      EQU (0x0 << 12) ;- (TDES) ECB Electronic CodeBook mode.
AT91C_TDES_OPMOD_CBC      EQU (0x1 << 12) ;- (TDES) CBC Cipher Block Chaining mode.
AT91C_TDES_OPMOD_OFB      EQU (0x2 << 12) ;- (TDES) OFB Output Feedback mode.
AT91C_TDES_OPMOD_CFB      EQU (0x3 << 12) ;- (TDES) CFB Cipher Feedback mode.
AT91C_TDES_LOD            EQU (0x1 << 15) ;- (TDES) Last Output Data Mode
AT91C_TDES_CFBS           EQU (0x3 << 16) ;- (TDES) Cipher Feedback Data Size
AT91C_TDES_CFBS_64_BIT    EQU (0x0 << 16) ;- (TDES) 64-bit.
AT91C_TDES_CFBS_32_BIT    EQU (0x1 << 16) ;- (TDES) 32-bit.
AT91C_TDES_CFBS_16_BIT    EQU (0x2 << 16) ;- (TDES) 16-bit.
AT91C_TDES_CFBS_8_BIT     EQU (0x3 << 16) ;- (TDES) 8-bit.
/* - -------- TDES_IER : (TDES Offset: 0x10) Interrupt Enable Register -------- */
AT91C_TDES_DATRDY         EQU (0x1 <<  0) ;- (TDES) DATRDY
AT91C_TDES_ENDRX          EQU (0x1 <<  1) ;- (TDES) PDC Read Buffer End
AT91C_TDES_ENDTX          EQU (0x1 <<  2) ;- (TDES) PDC Write Buffer End
AT91C_TDES_RXBUFF         EQU (0x1 <<  3) ;- (TDES) PDC Read Buffer Full
AT91C_TDES_TXBUFE         EQU (0x1 <<  4) ;- (TDES) PDC Write Buffer Empty
AT91C_TDES_URAD           EQU (0x1 <<  8) ;- (TDES) Unspecified Register Access Detection
/* - -------- TDES_IDR : (TDES Offset: 0x14) Interrupt Disable Register -------- */
/* - -------- TDES_IMR : (TDES Offset: 0x18) Interrupt Mask Register -------- */
/* - -------- TDES_ISR : (TDES Offset: 0x1c) Interrupt Status Register -------- */
AT91C_TDES_URAT           EQU (0x3 << 12) ;- (TDES) Unspecified Register Access Type Status
AT91C_TDES_URAT_IN_DAT_WRITE_DATPROC EQU (0x0 << 12) ;- (TDES) Input data register written during the data processing in PDC mode.
AT91C_TDES_URAT_OUT_DAT_READ_DATPROC EQU (0x1 << 12) ;- (TDES) Output data register read during the data processing.
AT91C_TDES_URAT_MODEREG_WRITE_DATPROC EQU (0x2 << 12) ;- (TDES) Mode register written during the data processing.
AT91C_TDES_URAT_WO_REG_READ EQU (0x3 << 12) ;- (TDES) Write-only register read access.

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Secure Hash Algorithm*/
/* - ******************************************************************************/
/* - -------- SHA_CR : (SHA Offset: 0x0) Control Register -------- */
AT91C_SHA_START           EQU (0x1 <<  0) ;- (SHA) Starts Processing
AT91C_SHA_FIRST           EQU (0x1 <<  4) ;- (SHA) First Block of a Message
AT91C_SHA_SWRST           EQU (0x1 <<  8) ;- (SHA) Software Reset
/* - -------- SHA_MR : (SHA Offset: 0x4) Mode Register -------- */
AT91C_SHA_SMOD            EQU (0x3 <<  0) ;- (SHA) Start Mode
AT91C_SHA_SMOD_MANUAL     EQU (0x0) ;- (SHA) Manual Mode.
AT91C_SHA_SMOD_AUTO       EQU (0x1) ;- (SHA) Auto Mode.
AT91C_SHA_SMOD_PDC        EQU (0x2) ;- (SHA) PDC Mode.
AT91C_SHA_PROCDLY         EQU (0x1 <<  4) ;- (SHA) Processing Delay
AT91C_SHA_ALGO            EQU (0x1 <<  8) ;- (SHA) Start Mode
/* - -------- SHA_IER : (SHA Offset: 0x10) Interrupt Enable Register -------- */
AT91C_SHA_DATRDY          EQU (0x1 <<  0) ;- (SHA) DATRDY
AT91C_SHA_ENDTX           EQU (0x1 <<  1) ;- (SHA) PDC Write Buffer End
AT91C_SHA_TXBUFE          EQU (0x1 <<  2) ;- (SHA) PDC Write Buffer Empty
AT91C_SHA_URAD            EQU (0x1 <<  8) ;- (SHA) Unspecified Register Access Detection
/* - -------- SHA_IDR : (SHA Offset: 0x14) Interrupt Disable Register -------- */
/* - -------- SHA_IMR : (SHA Offset: 0x18) Interrupt Mask Register -------- */
/* - -------- SHA_ISR : (SHA Offset: 0x1c) Interrupt Status Register -------- */
AT91C_SHA_URAT            EQU (0x7 << 12) ;- (SHA) Unspecified Register Access Type Status
AT91C_SHA_URAT_IN_DAT_WRITE_DATPROC EQU (0x0 << 12) ;- (SHA) Input data register written during the data processing in PDC mode.
AT91C_SHA_URAT_OUT_DAT_READ_DATPROC EQU (0x1 << 12) ;- (SHA) Output data register read during the data processing.
AT91C_SHA_URAT_MODEREG_WRITE_DATPROC EQU (0x2 << 12) ;- (SHA) Mode register written during the data processing.
AT91C_SHA_URAT_OUT_DAT_READ_SUBKEY EQU (0x3 << 12) ;- (SHA) Output data register read during the sub-keys generation.
AT91C_SHA_URAT_MODEREG_WRITE_SUBKEY EQU (0x4 << 12) ;- (SHA) Mode register written during the sub-keys generation.
AT91C_SHA_URAT_WO_REG_READ EQU (0x5 << 12) ;- (SHA) Write-only register read access.

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR True Random Generator*/
/* - ******************************************************************************/
/* - -------- TRNG_CR : (TRNG Offset: 0x0) Control Register -------- */
AT91C_TRNG_ENABLE         EQU (0x1 <<  0) ;- (TRNG) Enable TRNG
/* - -------- TRNG_IER : (TRNG Offset: 0x10) Interrupt Enable Register -------- */
AT91C_TRNG_DATRDY         EQU (0x1 <<  0) ;- (TRNG) DATRDY
/* - -------- TRNG_IDR : (TRNG Offset: 0x14) Interrupt Disable Register -------- */
/* - -------- TRNG_IMR : (TRNG Offset: 0x18) Interrupt Mask Register -------- */
/* - -------- TRNG_ISR : (TRNG Offset: 0x1c) Interrupt Status Register -------- */

