una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
AT91C_PIOC_MDDR           EQU (0xFFFFF654) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_BSR            EQU (0xFFFFF674) ;- (PIOC) Select B Register
AT91C_PIOC_PER            EQU (0xFFFFF600) ;- (PIOC) PIO Enable Register
/* - ========== Register definition for PIOD peripheral ========== */
AT91C_PIOD_DELAY1         EQU (0xFFFFF8C0) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_OWDR           EQU (0xFFFFF8A4) ;- (PIOD) Output Write Disable Register
AT91C_PIOD_SODR           EQU (0xFFFFF830) ;- (PIOD) Set Output Data Register
AT91C_PIOD_PPUER          EQU (0xFFFFF864) ;- (PIOD) Pull-up Enable Register
AT91C_PIOD_CODR           EQU (0xFFFFF834) ;- (PIOD) Clear Output Data Register
AT91C_PIOD_DELAY4         EQU (0xFFFFF8CC) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_PSR            EQU (0xFFFFF808) ;- (PIOD) PIO Status Register
AT91C_PIOD_PDR            EQU (0xFFFFF804) ;- (PIOD) PIO Disable Register
AT91C_PIOD_ODR            EQU (0xFFFFF814) ;- (PIOD) Output Disable Registerr
AT91C_PIOD_PPUSR          EQU (0xFFFFF868) ;- (PIOD) Pull-up Status Register
AT91C_PIOD_IFSR           EQU (0xFFFFF828) ;- (PIOD) Input Filter Status Register
AT91C_PIOD_IMR            EQU (0xFFFFF848) ;- (PIOD) Interrupt Mask Register
AT91C_PIOD_ASR            EQU (0xFFFFF870) ;- (PIOD) Select A Register
AT91C_PIOD_DELAY2         EQU (0xFFFFF8C4) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_OWSR           EQU (0xFFFFF8A8) ;- (PIOD) Output Write Status Register
AT91C_PIOD_PER            EQU (0xFFFFF800) ;- (PIOD) PIO Enable Register
AT91C_PIOD_MDER           EQU (0xFFFFF850) ;- (PIOD) Multi-driver Enable Register
AT91C_PIOD_PDSR           EQU (0xFFFFF83C) ;- (PIOD) Pin Data Status Register
AT91C_PIOD_MDSR           EQU (0xFFFFF858) ;- (PIOD) Multi-driver Status Register
AT91C_PIOD_OWER           EQU (0xFFFFF8A0) ;- (PIOD) Output Write Enable Register
AT91C_PIOD_BSR            EQU (0xFFFFF874) ;- (PIOD) Select B Register
AT91C_PIOD_IFDR           EQU (0xFFFFF824) ;- (PIOD) Input Filter Disable Register
AT91C_PIOD_DELAY3         EQU (0xFFFFF8C8) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_ABSR           EQU (0xFFFFF878) ;- (PIOD) AB Select Status Register
AT91C_PIOD_OER            EQU (0xFFFFF810) ;- (PIOD) Output Enable Register
AT91C_PIOD_MDDR           EQU (0xFFFFF854) ;- (PIOD) Multi-driver Disable Register
AT91C_PIOD_IDR            EQU (0xFFFFF844) ;- (PIOD) Interrupt Disable Register
AT91C_PIOD_IER            EQU (0xFFFFF840) ;- (PIOD) Interrupt Enable Register
AT91C_PIOD_PPUDR          EQU (0xFFFFF860) ;- (PIOD) Pull-up Disable Register
AT91C_PIOD_VERSION        EQU (0xFFFFF8FC) ;- (PIOD) PIO Version Register
AT91C_PIOD_ISR            EQU (0xFFFFF84C) ;- (PIOD) Interrupt Status Register
AT91C_PIOD_ODSR           EQU (0xFFFFF838) ;- (PIOD) Output Data Status Register
AT91C_PIOD_OSR            EQU (0xFFFFF818) ;- (PIOD) Output Status Register
AT91C_PIOD_IFER           EQU (0xFFFFF820) ;- (PIOD) Input Filter Enable Register
AT91C_PIOD_SLEWRATE1      EQU (0xFFFFF8B0) ;- (PIOD) PIO Slewrate Control Register
/* - ========== Register definition for PIOE peripheral ========== */
AT91C_PIOE_ODSR           EQU (0xFFFFFA38) ;- (PIOE) Output Data Status Register
AT91C_PIOE_ABSR           EQU (0xFFFFFA78) ;- (PIOE) AB Select Status Register
AT91C_PIOE_PSR            EQU (0xFFFFFA08) ;- (PIOE) PIO Status Register
AT91C_PIOE_PPUDR          EQU (0xFFFFFA60) ;- (PIOE) Pull-up Disable Register
AT91C_PIOE_OER            EQU (0xFFFFFA10) ;- (PIOE) Output Enable Register
AT91C_PIOE_IFSR           EQU (0xFFFFFA28) ;- (PIOE) Input Filter Status Register
AT91C_PIOE_IFER           EQU (0xFFFFFA20) ;- (PIOE) Input Filter Enable Register
AT91C_PIOE_DELAY3         EQU (0xFFFFFAC8) ;- (PIOE) PIO Delay Control Register
AT91C_PIOE_ODR            EQU (0xFFFFFA14) ;- (PIOE) Output Disable Registerr
AT91C_PIOE_IDR            EQU (0xFFFFFA44) ;- (PIOE) Interrupt Disable Register
AT91C_PIOE_DELAY1         EQU (0xFFFFFAC0) ;- (PIOE) PIO Delay Control Register
AT91C_PIOE_OSR            EQU (0xFFFFFA18) ;- (PIOE) Output Status Register
AT91C_PIOE_CODR           EQU (0xFFFFFA34) ;- (PIOE) Clear Output Data Register
AT91C_PIOE_VERSION        EQU (0xFFFFFAFC) ;- (PIOE) PIO Version Register
AT91C_PIOE_MDSR           EQU (0xFFFFFA58) ;- (PIOE) Multi-driver Status Register
AT91C_PIOE_PDR            EQU (0xFFFFFA04) ;- (PIOE) PIO Disable Register
AT91C_PIOE_IER            EQU (0xFFFFFA40) ;- (PIOE) Interrupt Enable Register
AT91C_PIOE_OWSR           EQU (0xFFFFFAA8) ;- (PIOE) Output Write Status Register
AT91C_PIOE_BSR            EQU (0xFFFFFA74) ;- (PIOE) Select B Register
AT91C_PIOE_SLEWRATE1      EQU (0xFFFFFAB0) ;- (PIOE) PIO Slewrate Control Register
AT91C_PIOE_DELAY4         EQU (0xFFFFFACC) ;- (PIOE) PIO Delay Control Register
AT91C_PIOE_PER            EQU (0xFFFFFA00) ;- (PIOE) PIO Enable Register
AT91C_PIOE_OWDR           EQU (0xFFFFFAA4) ;- (PIOE) Output Write Disable Register
AT91C_PIOE_IFDR           EQU (0xFFFFFA24) ;- (PIOE) Input Filter Disable Register
AT91C_PIOE_PPUSR          EQU (0xFFFFFA68) ;- (PIOE) Pull-up Status Register
AT91C_PIOE_PDSR           EQU (0xFFFFFA3C) ;- (PIOE) Pin Data Status Register
AT91C_PIOE_PPUER          EQU (0xFFFFFA64) ;- (PIOE) Pull-up Enable Register
AT91C_PIOE_MDDR           EQU (0xFFFFFA54) ;- (PIOE) Multi-driver Disable Register
AT91C_PIOE_ISR            EQU (0xFFFFFA4C) ;- (PIOE) Interrupt Status Register
AT91C_PIOE_DELAY2         EQU (0xFFFFFAC4) ;- (PIOE) PIO Delay Control Register
AT91C_PIOE_SODR           EQU (0xFFFFFA30) ;- (PIOE) Set Output Data Register
AT91C_PIOE_ASR            EQU (0xFFFFFA70) ;- (PIOE) Select A Register
AT91C_PIOE_IMR            EQU (0xFFFFFA48) ;- (PIOE) Interrupt Mask Register
AT91C_PIOE_OWER           EQU (0xFFFFFAA0) ;- (PIOE) Output Write Enable Register
AT91C_PIOE_MDER           EQU (0xFFFFFA50) ;- (PIOE) Multi-driver Enable Register
/* - ========== Register definition for PMC peripheral ========== */
AT91C_PMC_ADDRSIZE        EQU (0xFFFFFCEC) ;- (PMC) 
AT91C_PMC_PCER            EQU (0xFFFFFC10) ;- (PMC) Peripheral Clock Enable Register
AT91C_PMC_PCKR            EQU (0xFFFFFC40) ;- (PMC) Programmable Clock 0 Register
AT91C_PMC_MCKR            EQU (0xFFFFFC30) ;- (PMC) Master Clock Register
AT91C_PMC_PLLAR           EQU (0xFFFFFC28) ;- (PMC) PLL A Register
AT91C_PMC_NAME2           EQU (0xFFFFFCF4) ;- (PMC) 
AT91C_PMC_PCDR            EQU (0xFFFFFC14) ;- (PMC) Peripheral Clock Disable Register
AT91C_PMC_SCSR            EQU (0xFFFFFC08) ;- (PMC) System Clock Status Register
AT91C_PMC_MCFR            EQU (0xFFFFFC24) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_FEATURES        EQU (0xFFFFFCF8) ;- (PMC) 
AT91C_PMC_PLLICPR         EQU (0xFFFFFC80) ;- (PMC) PLL Charge Pump Current Register
AT91C_PMC_IMR             EQU (0xFFFFFC6C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IER             EQU (0xFFFFFC60) ;- (PMC) Interrupt Enable Register
AT91C_PMC_UCKR            EQU (0xFFFFFC1C) ;- (PMC) UTMI Clock Configuration Register
AT91C_PMC_USB             EQU (0xFFFFFC38) ;- (PMC) USB clock register
AT91C_PMC_MOR             EQU (0xFFFFFC20) ;- (PMC) Main Oscillator Register
AT91C_PMC_IDR             EQU (0xFFFFFC64) ;- (PMC) Interrupt Disable Register
AT91C_PMC_NAME1           EQU (0xFFFFFCF0) ;- (PMC) 
AT91C_PMC_SCDR            EQU (0xFFFFFC04) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCSR            EQU (0xFFFFFC18) ;- (PMC) Peripheral Clock Status Register
AT91C_PMC_SCER            EQU (0xFFFFFC00) ;- (PMC) System Clock Enable Register
AT91C_PMC_VERSION         EQU (0xFFFFFCFC) ;- (PMC) 
AT91C_PMC_SR              EQU (0xFFFFFC68) ;- (PMC) Status Register
/* - ========== Register definition for CKGR peripheral ========== */
AT91C_CKGR_MOR            EQU (0xFFFFFC20) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_MCFR           EQU (0xFFFFFC24) ;- (CKGR) Main Clock  Frequency Register
AT91C_CKGR_PLLAR          EQU (0xFFFFFC28) ;- (CKGR) PLL A Register
AT91C_CKGR_UCKR           EQU (0xFFFFFC1C) ;- (CKGR) UTMI Clock Configuration Register
/* - ========== Register definition for RSTC peripheral ========== */
AT91C_RSTC_RCR            EQU (0xFFFFFD00) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0xFFFFFD08) ;- (RSTC) Reset Mode Register
AT91C_RSTC_RSR            EQU (0xFFFFFD04) ;- (RSTC) Reset Status Register
/* - ========== Register definition for SHDWC peripheral ========== */
AT91C_SHDWC_SHSR          EQU (0xFFFFFD18) ;- (SHDWC) Shut Down Status Register
AT91C_SHDWC_SHMR          EQU (0xFFFFFD14) ;- (SHDWC) Shut Down Mode Register
AT91C_SHDWC_SHCR          EQU (0xFFFFFD10) ;- (SHDWC) Shut Down Control Register
/* - ========== Register definition for RTTC peripheral ========== */
AT91C_RTTC_RTSR           EQU (0xFFFFFD2C) ;- (RTTC) Real-time Status Register
AT91C_RTTC_RTMR           EQU (0xFFFFFD20) ;- (RTTC) Real-time Mode Register
AT91C_RTTC_RTVR           EQU (0xFFFFFD28) ;- (RTTC) Real-time Value Register
AT91C_RTTC_RTAR           EQU (0xFFFFFD24) ;- (RTTC) Real-time Alarm Register
/* - ========== Register definition for PITC peripheral ========== */
AT91C_PITC_PIVR           EQU (0xFFFFFD38) ;- (PITC) Period Interval Value Register
AT91C_PITC_PISR           EQU (0xFFFFFD34) ;- (PITC) Period Interval Status Register
AT91C_PITC_PIIR           EQU (0xFFFFFD3C) ;- (PITC) Period Interval Image Register
AT91C_PITC_PIMR           EQU (0xFFFFFD30) ;- (PITC) Period Interval Mode Register
/* - ========== Register definition for WDTC peripheral ========== */
AT91C_WDTC_WDCR           EQU (0xFFFFFD40) ;- (WDTC) Watchdog Control Register
AT91C_WDTC_WDSR           EQU (0xFFFFFD48) ;- (WDTC) Watchdog Status Register
AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ;- (WDTC) Watchdog Mode Register
/* - ========== Register definition for RTC peripheral ========== */
AT91C_RTC_IDR             EQU (0xFFFFFDD4) ;- (RTC) Interrupt Disable Register
AT91C_RTC_SR              EQU (0xFFFFFDC8) ;- (RTC) Status Register
AT91C_RTC_MR              EQU (0xFFFFFDB4) ;- (RTC) Mode Register
AT91C_RTC_IER             EQU (0xFFFFFDD0) ;- (RTC) Interrupt Enable Register
AT91C_RTC_TIMALR          EQU (0xFFFFFDC0) ;- (RTC) Time Alarm Register
AT91C_RTC_CALALR          EQU (0xFFFFFDC4) ;- (RTC) Calendar Alarm Register
AT91C_RTC_CR              EQU (0xFFFFFDB0) ;- (RTC) Control Register
AT91C_RTC_TIMR            EQU (0xFFFFFDB8) ;- (RTC) Time Register
AT91C_RTC_CALR            EQU (0xFFFFFDBC) ;- (RTC) Calendar Register
AT91C_RTC_VER             EQU (0xFFFFFDDC) ;- (RTC) Valid Entry Register
AT91C_RTC_SCCR            EQU (0xFFFFFDCC) ;- (RTC) Status Clear Command Register
AT91C_RTC_IMR             EQU (0xFFFFFDD8) ;- (RTC) Interrupt Mask Register
/* - ========== Register definition for TC0 peripheral ========== */
AT91C_TC0_IER             EQU (0xFFF7C024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_IMR             EQU (0xFFF7C02C) ;- (TC0) Interrupt Mask Register
AT91C_TC0_CCR             EQU (0xFFF7C000) ;- (TC0) Channel Control Register
AT91C_TC0_RB              EQU (0xFFF7C018) ;- (TC0) Register B
AT91C_TC0_CV              EQU (0xFFF7C010) ;- (TC0) Counter Value
AT91C_TC0_SR              EQU (0xFFF7C020) ;- (TC0) Status Register
AT91C_TC0_CMR             EQU (0xFFF7C004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_RA              EQU (0xFFF7C014) ;- (TC0) Register A
AT91C_TC0_RC              EQU (0xFFF7C01C) ;- (TC0) Register C
AT91C_TC0_IDR             EQU (0xFFF7C028) ;- (TC0) Interrupt Disable Register
/* - ========== Register definition for TC1 peripheral ========== */
AT91C_TC1_IER             EQU (0xFFF7C064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_SR              EQU (0xFFF7C060) ;- (TC1) Status Register
AT91C_TC1_RC              EQU (0xFFF7C05C) ;- (TC1) Register C
AT91C_TC1_CV              EQU (0xFFF7C050) ;- (TC1) Counter Value
AT91C_TC1_RA              EQU (0xFFF7C054) ;- (TC1) Register A
AT91C_TC1_CMR             EQU (0xFFF7C044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_IDR             EQU (0xFFF7C068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_RB              EQU (0xFFF7C058) ;- (TC1) Register B
AT91C_TC1_IMR             EQU (0xFFF7C06C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CCR             EQU (0xFFF7C040) ;- (TC1) Channel Control Register
/* - ========== Register definition for TC2 peripheral ========== */
AT91C_TC2_SR              EQU (0xFFF7C0A0) ;- (TC2) Status Register
AT91C_TC2_IMR             EQU (0xFFF7C0AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_IER             EQU (0xFFF7C0A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_CV              EQU (0xFFF7C090) ;- (TC2) Counter Value
AT91C_TC2_RB              EQU (0xFFF7C098) ;- (TC2) Register B
AT91C_TC2_CCR             EQU (0xFFF7C080) ;- (TC2) Channel Control Register
AT91C_TC2_CMR             EQU (0xFFF7C084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_RA              EQU (0xFFF7C094) ;- (TC2) Register A
AT91C_TC2_IDR             EQU (0xFFF7C0A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_RC              EQU (0xFFF7C09C) ;- (TC2) Register C
/* - ========== Register definition for TC3 peripheral ========== */
AT91C_TC3_SR              EQU (0xFFFD4020) ;- (TC3) Status Register
AT91C_TC3_RC              EQU (0xFFFD401C) ;- (TC3) Register C
AT91C_TC3_IER             EQU (0xFFFD4024) ;- (TC3) Interrupt Enable Register
AT91C_TC3_CV              EQU (0xFFFD4010) ;- (TC3) Counter Value
AT91C_TC3_IDR             EQU (0xFFFD4028) ;- (TC3) Interrupt Disable Register
AT91C_TC3_IMR             EQU (0xFFFD402C) ;- (TC3) Interrupt Mask Register
AT91C_TC3_CMR             EQU (0xFFFD4004) ;- (TC3) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC3_RB              EQU (0xFFFD4018) ;- (TC3) Register B
AT91C_TC3_CCR             EQU (0xFFFD4000) ;- (TC3) Channel Control Register
AT91C_TC3_RA              EQU (0xFFFD4014) ;- (TC3) Register A
/* - ========== Register definition for TC4 peripheral ========== */
AT91C_TC4_CV              EQU (0xFFFD4050) ;- (TC4) Counter Value
AT91C_TC4_RA              EQU (0xFFFD4054) ;- (TC4) Register A
AT91C_TC4_IDR             EQU (0xFFFD4068) ;- (TC4) Interrupt Disable Register
AT91C_TC4_SR              EQU (0xFFFD4060) ;- (TC4) Status Register
AT91C_TC4_CMR             EQU (0xFFFD4044) ;- (TC4) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC4_CCR             EQU (0xFFFD4040) ;- (TC4) Channel Control Register
AT91C_TC4_RB              EQU (0xFFFD4058) ;- (TC4) Register B
AT91C_TC4_RC              EQU (0xFFFD405C) ;- (TC4) Register C
AT91C_TC4_IER             EQU (0xFFFD4064) ;- (TC4) Interrupt Enable Register
AT91C_TC4_IMR             EQU (0xFFFD406C) ;- (TC4) Interrupt Mask Register
/* - ========== Register definition for TC5 peripheral ========== */
AT91C_TC5_IER             EQU (0xFFFD40A4) ;- (TC5) Interrupt Enable Register
AT91C_TC5_IDR             EQU (0xFFFD40A8) ;- (TC5) Interrupt Disable Register
AT91C_TC5_RA              EQU (0xFFFD4094) ;- (TC5) Register A
AT91C_TC5_RB              EQU (0xFFFD4098) ;- (TC5) Register B
AT91C_TC5_CCR             EQU (0xFFFD4080) ;- (TC5) Channel Control Register
AT91C_TC5_SR              EQU (0xFFFD40A0) ;- (TC5) Status Register
AT91C_TC5_CV              EQU (0xFFFD4090) ;- (TC5) Counter Value
AT91C_TC5_RC              EQU (0xFFFD409C) ;- (TC5) Register C
AT91C_TC5_IMR             EQU (0xFFFD40AC) ;- (TC5) Interrupt Mask Register
AT91C_TC5_CMR             EQU (0xFFFD4084) ;- (TC5) Channel Mode Register (Capture Mode / Waveform Mode)
/* - ========== Register definition for TCB0 peripheral ========== */
AT91C_TCB0_BCR            EQU (0xFFF7C0C0) ;- (TCB0) TC Block Control Register
AT91C_TCB0_BMR            EQU (0xFFF7C0C4) ;- (TCB0) TC Block Mode Register
/* - ========== Register definition for TCB1 peripheral ========== */
AT91C_TCB1_BMR            EQU (0xFFFD40C4) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_BCR            EQU (0xFFFD40C0) ;- (TCB1) TC Block Control Register
/* - ========== Register definition for MCI0 peripheral ========== */
AT91C_MCI0_IMR            EQU (0xFFF8004C) ;- (MCI0) MCI Interrupt Mask Register
AT91C_MCI0_MR             EQU (0xFFF80004) ;- (MCI0) MCI Mode Register
AT91C_MCI0_CR             EQU (0xFFF80000) ;- (MCI0) MCI Control Register
AT91C_MCI0_IER            EQU (0xFFF80044) ;- (MCI0) MCI Interrupt Enable Register
AT91C_MCI0_FIFO           EQU (0xFFF80200) ;- (MCI0) MCI FIFO Aperture Register
AT91C_MCI0_DTOR           EQU (0xFFF80008) ;- (MCI0) MCI Data Timeout Register
AT91C_MCI0_SDCR           EQU (0xFFF8000C) ;- (MCI0) MCI SD/SDIO Card Register
AT91C_MCI0_BLKR           EQU (0xFFF80018) ;- (MCI0) MCI Block Register
AT91C_MCI0_VR             EQU (0xFFF800FC) ;- (MCI0) MCI Version Register
AT91C_MCI0_WPSR           EQU (0xFFF800E8) ;- (MCI0) MCI Write Protection Status Register
AT91C_MCI0_CMDR           EQU (0xFFF80014) ;- (MCI0) MCI Command Register
AT91C_MCI0_CSTOR          EQU (0xFFF8001C) ;- (MCI0) MCI Completion Signal Timeout Register
AT91C_MCI0_DMA            EQU (0xFFF80050) ;- (MCI0) MCI DMA Configuration Register
AT91C_MCI0_RDR            EQU (0xFFF80030) ;- (MCI0) MCI Receive Data Register
AT91C_MCI0_SR             EQU (0xFFF80040) ;- (MCI0) MCI Status Register
AT91C_MCI0_TDR            EQU (0xFFF80034) ;- (MCI0) MCI Transmit Data Register
AT91C_MCI0_CFG            EQU (0xFFF80054) ;- (MCI0) MCI Configuration Register
AT91C_MCI0_ARGR           EQU (0xFFF80010) ;- (MCI0) MCI Argument Register
AT91C_MCI0_RSPR           EQU (0xFFF80020) ;- (MCI0) MCI Response Register
AT91C_MCI0_WPCR           EQU (0xFFF800E4) ;- (MCI0) MCI Write Protection Control Register
AT91C_MCI0_IDR            EQU (0xFFF80048) ;- (MCI0) MCI Interrupt Disable Register
/* - ========== Register definition for MCI1 peripheral ========== */
AT91C_MCI1_IDR            EQU (0xFFFD0048) ;- (MCI1) MCI Interrupt Disable Register
AT91C_MCI1_MR             EQU (0xFFFD0004) ;- (MCI1) MCI Mode Register
AT91C_MCI1_SR             EQU (0xFFFD0040) ;- (MCI1) MCI Status Register
AT91C_MCI1_DTOR           EQU (0xFFFD0008) ;- (MCI1) MCI Data Timeout Register
AT91C_MCI1_WPCR           EQU (0xFFFD00E4) ;- (MCI1) MCI Write Protection Control Register
AT91C_MCI1_ARGR           EQU (0xFFFD0010) ;- (MCI1) MCI Argument Register
AT91C_MCI1_FIFO           EQU (0xFFFD0200) ;- (MCI1) MCI FIFO Aperture Register
AT91C_MCI1_IER            EQU (0xFFFD0044) ;- (MCI1) MCI Interrupt Enable Register
AT91C_MCI1_SDCR           EQU (0xFFFD000C) ;- (MCI1) MCI SD/SDIO Card Register
AT91C_MCI1_CR             EQU (0xFFFD0000) ;- (MCI1) MCI Control Register
AT91C_MCI1_CSTOR          EQU (0xFFFD001C) ;- (MCI1) MCI Completion Signal Timeout Register
AT91C_MCI1_RSPR           EQU (0xFFFD0020) ;- (MCI1) MCI Response Register
AT91C_MCI1_IMR            EQU (0xFFFD004C) ;- (MCI1) MCI Interrupt Mask Register
AT91C_MCI1_DMA            EQU (0xFFFD0050) ;- (MCI1) MCI DMA Configuration Register
AT91C_MCI1_BLKR           EQU (0xFFFD0018) ;- (MCI1) MCI Block Register
AT91C_MCI1_RDR            EQU (0xFFFD0030) ;- (MCI1) MCI Receive Data Register
AT91C_MCI1_CFG            EQU (0xFFFD0054) ;- (MCI1) MCI Configuration Register
AT91C_MCI1_WPSR           EQU (0xFFFD00E8) ;- (MCI1) MCI Write Protection Status Register
AT91C_MCI1_CMDR           EQU (0xFFFD0014) ;- (MCI1) MCI Command Register
AT91C_MCI1_TDR            EQU (0xFFFD0034) ;- (MCI1) MCI Transmit Data Register
AT91C_MCI1_VR             EQU (0xFFFD00FC) ;- (MCI1) MCI Version Register
/* - ========== Register definition for TWI0 peripheral ========== */
AT91C_TWI0_RHR            EQU (0xFFF84030) ;- (TWI0) Receive Holding Register
AT91C_TWI0_IMR            EQU (0xFFF8402C) ;- (TWI0) Interrupt Mask Register
AT91C_TWI0_SR             EQU (0xFFF84020) ;- (TWI0) Status Register
AT91C_TWI0_IADR           EQU (0xFFF8400C) ;- (TWI0) Internal Address Register
AT91C_TWI0_IDR            EQU (0xFFF84028) ;- (TWI0) Interrupt Disable Register
AT91C_TWI0_CWGR           EQU (0xFFF84010) ;- (TWI0) Clock Waveform Generator Register
AT91C_TWI0_IER            EQU (0xFFF84024) ;- (TWI0) Interrupt Enable Register
AT91C_TWI0_THR            EQU (0xFFF84034) ;- (TWI0) Transmit Holding Register
AT91C_TWI0_CR             EQU (0xFFF84000) ;- (TWI0) Control Register
AT91C_TWI0_MMR            EQU (0xFFF84004) ;- (TWI0) Master Mode Register
/* - ========== Register definition for TWI1 peripheral ========== */
AT91C_TWI1_IDR            EQU (0xFFF88028) ;- (TWI1) Interrupt Disable Register
AT91C_TWI1_RHR            EQU (0xFFF88030) ;- (TWI1) Receive Holding Register
AT91C_TWI1_IMR            EQU (0xFFF8802C) ;- (TWI1) Interrupt Mask Register
AT91C_TWI1_THR            EQU (0xFFF88034) ;- (TWI1) Transmit Holding Register
AT91C_TWI1_IER            EQU (0xFFF88024) ;- (TWI1) Interrupt Enable Register
AT91C_TWI1_IADR           EQU (0xFFF8800C) ;- (TWI1) Internal Address Register
AT91C_TWI1_MMR            EQU (0xFFF88004) ;- (TWI1) Master Mode Register
AT91C_TWI1_CR             EQU (0xFFF88000) ;- (TWI1) Control Register
AT91C_TWI1_SR             EQU (0xFFF88020) ;- (TWI1) Status Register
AT91C_TWI1_CWGR           EQU (0xFFF88010) ;- (TWI1) Clock Waveform Generator Register
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TNPR            EQU (0xFFF8C118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_PTSR            EQU (0xFFF8C124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_PTCR            EQU (0xFFF8C120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_RNCR            EQU (0xFFF8C114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_RCR             EQU (0xFFF8C104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TNCR            EQU (0xFFF8C11C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_TCR             EQU (0xFFF8C10C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_RNPR            EQU (0xFFF8C110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RPR             EQU (0xFFF8C100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_TPR             EQU (0xFFF8C108) ;- (PDC_US0) Transmit Pointer Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_RTOR            EQU (0xFFF8C024) ;- (US0) Receiver Time-out Register
AT91C_US0_MAN             EQU (0xFFF8C050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_NER             EQU (0xFFF8C044) ;- (US0) Nb Errors Register
AT91C_US0_THR             EQU (0xFFF8C01C) ;- (US0) Transmitter Holding Register
AT91C_US0_MR              EQU (0xFFF8C004) ;- (US0) Mode Register
AT91C_US0_RHR             EQU (0xFFF8C018) ;- (US0) Receiver Holding Register
AT91C_US0_CSR             EQU (0xFFF8C014) ;- (US0) Channel Status Register
AT91C_US0_IMR             EQU (0xFFF8C010) ;- (US0) Interrupt Mask Register
AT91C_US0_IDR             EQU (0xFFF8C00C) ;- (US0) Interrupt Disable Register
AT91C_US0_FIDI            EQU (0xFFF8C040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_CR              EQU (0xFFF8C000) ;- (US0) Control Register
AT91C_US0_IER             EQU (0xFFF8C008) ;- (US0) Interrupt Enable Register
AT91C_US0_TTGR            EQU (0xFFF8C028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_BRGR            EQU (0xFFF8C020) ;- (US0) Baud Rate Generator Register
AT91C_US0_IF              EQU (0xFFF8C04C) ;- (US0) IRDA_FILTER Register
/* - ========== Register definition for PDC_US1 peripheral ========== */
AT91C_US1_PTCR            EQU (0xFFF90120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_TNCR            EQU (0xFFF9011C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RCR             EQU (0xFFF90104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFF90100) ;- (PDC_US1) Receive Pointer Register
