una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9m10.h
AT91C_UDPHS_EPT_5_EPTCLRSTA EQU (0xFFF781B8) ;- (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_5_EPTCTLENB EQU (0xFFF781A4) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_5_EPTSETSTA EQU (0xFFF781B4) ;- (UDPHS_EPT_5) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_5_EPTCTLDIS EQU (0xFFF781A8) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_5_EPTCFG  EQU (0xFFF781A0) ;- (UDPHS_EPT_5) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_5_EPTCTL  EQU (0xFFF781AC) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Register
/* - ========== Register definition for UDPHS_EPT_6 peripheral ========== */
AT91C_UDPHS_EPT_6_EPTCLRSTA EQU (0xFFF781D8) ;- (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_6_EPTCTLENB EQU (0xFFF781C4) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_6_EPTCTL  EQU (0xFFF781CC) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_6_EPTSETSTA EQU (0xFFF781D4) ;- (UDPHS_EPT_6) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_6_EPTCTLDIS EQU (0xFFF781C8) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_6_EPTSTA  EQU (0xFFF781DC) ;- (UDPHS_EPT_6) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_6_EPTCFG  EQU (0xFFF781C0) ;- (UDPHS_EPT_6) UDPHS Endpoint Config Register
/* - ========== Register definition for UDPHS_DMA_1 peripheral ========== */
AT91C_UDPHS_DMA_1_DMASTATUS EQU (0xFFF7831C) ;- (UDPHS_DMA_1) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_1_DMANXTDSC EQU (0xFFF78310) ;- (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_1_DMACONTROL EQU (0xFFF78318) ;- (UDPHS_DMA_1) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_1_DMAADDRESS EQU (0xFFF78314) ;- (UDPHS_DMA_1) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS_DMA_2 peripheral ========== */
AT91C_UDPHS_DMA_2_DMACONTROL EQU (0xFFF78328) ;- (UDPHS_DMA_2) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_2_DMASTATUS EQU (0xFFF7832C) ;- (UDPHS_DMA_2) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_2_DMAADDRESS EQU (0xFFF78324) ;- (UDPHS_DMA_2) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_2_DMANXTDSC EQU (0xFFF78320) ;- (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address
/* - ========== Register definition for UDPHS_DMA_3 peripheral ========== */
AT91C_UDPHS_DMA_3_DMAADDRESS EQU (0xFFF78334) ;- (UDPHS_DMA_3) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_3_DMANXTDSC EQU (0xFFF78330) ;- (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_3_DMACONTROL EQU (0xFFF78338) ;- (UDPHS_DMA_3) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_3_DMASTATUS EQU (0xFFF7833C) ;- (UDPHS_DMA_3) UDPHS DMA Channel Status Register
/* - ========== Register definition for UDPHS_DMA_4 peripheral ========== */
AT91C_UDPHS_DMA_4_DMANXTDSC EQU (0xFFF78340) ;- (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_4_DMAADDRESS EQU (0xFFF78344) ;- (UDPHS_DMA_4) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_4_DMACONTROL EQU (0xFFF78348) ;- (UDPHS_DMA_4) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_4_DMASTATUS EQU (0xFFF7834C) ;- (UDPHS_DMA_4) UDPHS DMA Channel Status Register
/* - ========== Register definition for UDPHS_DMA_5 peripheral ========== */
AT91C_UDPHS_DMA_5_DMASTATUS EQU (0xFFF7835C) ;- (UDPHS_DMA_5) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_5_DMACONTROL EQU (0xFFF78358) ;- (UDPHS_DMA_5) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_5_DMANXTDSC EQU (0xFFF78350) ;- (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_5_DMAADDRESS EQU (0xFFF78354) ;- (UDPHS_DMA_5) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS_DMA_6 peripheral ========== */
AT91C_UDPHS_DMA_6_DMANXTDSC EQU (0xFFF78360) ;- (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_6_DMACONTROL EQU (0xFFF78368) ;- (UDPHS_DMA_6) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_6_DMASTATUS EQU (0xFFF7836C) ;- (UDPHS_DMA_6) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_6_DMAADDRESS EQU (0xFFF78364) ;- (UDPHS_DMA_6) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS peripheral ========== */
AT91C_UDPHS_IEN           EQU (0xFFF78010) ;- (UDPHS) UDPHS Interrupt Enable Register
AT91C_UDPHS_TSTSOFCNT     EQU (0xFFF780D0) ;- (UDPHS) UDPHS Test SOF Counter Register
AT91C_UDPHS_IPFEATURES    EQU (0xFFF780F8) ;- (UDPHS) UDPHS Features Register
AT91C_UDPHS_TST           EQU (0xFFF780E0) ;- (UDPHS) UDPHS Test Register
AT91C_UDPHS_FNUM          EQU (0xFFF78004) ;- (UDPHS) UDPHS Frame Number Register
AT91C_UDPHS_TSTCNTB       EQU (0xFFF780D8) ;- (UDPHS) UDPHS Test B Counter Register
AT91C_UDPHS_RIPPADDRSIZE  EQU (0xFFF780EC) ;- (UDPHS) UDPHS PADDRSIZE Register
AT91C_UDPHS_INTSTA        EQU (0xFFF78014) ;- (UDPHS) UDPHS Interrupt Status Register
AT91C_UDPHS_EPTRST        EQU (0xFFF7801C) ;- (UDPHS) UDPHS Endpoints Reset Register
AT91C_UDPHS_TSTCNTA       EQU (0xFFF780D4) ;- (UDPHS) UDPHS Test A Counter Register
AT91C_UDPHS_RIPNAME2      EQU (0xFFF780F4) ;- (UDPHS) UDPHS Name2 Register
AT91C_UDPHS_RIPNAME1      EQU (0xFFF780F0) ;- (UDPHS) UDPHS Name1 Register
AT91C_UDPHS_TSTMODREG     EQU (0xFFF780DC) ;- (UDPHS) UDPHS Test Mode Register
AT91C_UDPHS_CLRINT        EQU (0xFFF78018) ;- (UDPHS) UDPHS Clear Interrupt Register
AT91C_UDPHS_IPVERSION     EQU (0xFFF780FC) ;- (UDPHS) UDPHS Version Register
AT91C_UDPHS_CTRL          EQU (0xFFF78000) ;- (UDPHS) UDPHS Control Register
/* - ========== Register definition for PDC_AC97C peripheral ========== */
AT91C_AC97C_PTSR          EQU (0xFFFAC124) ;- (PDC_AC97C) PDC Transfer Status Register
AT91C_AC97C_RPR           EQU (0xFFFAC100) ;- (PDC_AC97C) Receive Pointer Register
AT91C_AC97C_RNCR          EQU (0xFFFAC114) ;- (PDC_AC97C) Receive Next Counter Register
AT91C_AC97C_RCR           EQU (0xFFFAC104) ;- (PDC_AC97C) Receive Counter Register
AT91C_AC97C_PTCR          EQU (0xFFFAC120) ;- (PDC_AC97C) PDC Transfer Control Register
AT91C_AC97C_TPR           EQU (0xFFFAC108) ;- (PDC_AC97C) Transmit Pointer Register
AT91C_AC97C_RNPR          EQU (0xFFFAC110) ;- (PDC_AC97C) Receive Next Pointer Register
AT91C_AC97C_TNPR          EQU (0xFFFAC118) ;- (PDC_AC97C) Transmit Next Pointer Register
AT91C_AC97C_TCR           EQU (0xFFFAC10C) ;- (PDC_AC97C) Transmit Counter Register
AT91C_AC97C_TNCR          EQU (0xFFFAC11C) ;- (PDC_AC97C) Transmit Next Counter Register
/* - ========== Register definition for AC97C peripheral ========== */
AT91C_AC97C_IER           EQU (0xFFFAC054) ;- (AC97C) Interrupt Enable Register
AT91C_AC97C_COTHR         EQU (0xFFFAC044) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_IDR           EQU (0xFFFAC058) ;- (AC97C) Interrupt Disable Register
AT91C_AC97C_ICA           EQU (0xFFFAC010) ;- (AC97C) Input Channel AssignementRegister
AT91C_AC97C_CATHR         EQU (0xFFFAC024) ;- (AC97C) Channel A Transmit Holding Register
AT91C_AC97C_CBSR          EQU (0xFFFAC038) ;- (AC97C) Channel B Status Register
AT91C_AC97C_CAMR          EQU (0xFFFAC02C) ;- (AC97C) Channel A Mode Register
AT91C_AC97C_SR            EQU (0xFFFAC050) ;- (AC97C) Status Register
AT91C_AC97C_CBTHR         EQU (0xFFFAC034) ;- (AC97C) Channel B Transmit Holding Register (optional)
AT91C_AC97C_CASR          EQU (0xFFFAC028) ;- (AC97C) Channel A Status Register
AT91C_AC97C_COSR          EQU (0xFFFAC048) ;- (AC97C) CODEC Status Register
AT91C_AC97C_MR            EQU (0xFFFAC008) ;- (AC97C) Mode Register
AT91C_AC97C_OCA           EQU (0xFFFAC014) ;- (AC97C) Output Channel Assignement Register
AT91C_AC97C_CORHR         EQU (0xFFFAC040) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_CBRHR         EQU (0xFFFAC030) ;- (AC97C) Channel B Receive Holding Register (optional)
AT91C_AC97C_IMR           EQU (0xFFFAC05C) ;- (AC97C) Interrupt Mask Register
AT91C_AC97C_COMR          EQU (0xFFFAC04C) ;- (AC97C) CODEC Mask Status Register
AT91C_AC97C_CARHR         EQU (0xFFFAC020) ;- (AC97C) Channel A Receive Holding Register
AT91C_AC97C_VERSION       EQU (0xFFFAC0FC) ;- (AC97C) Version Register
AT91C_AC97C_CBMR          EQU (0xFFFAC03C) ;- (AC97C) Channel B Mode Register
/* - ========== Register definition for LCDC peripheral ========== */
AT91C_LCDC_MVAL           EQU (0x00500818) ;- (LCDC) LCD Mode Toggle Rate Value Register
AT91C_LCDC_PWRCON         EQU (0x0050083C) ;- (LCDC) Power Control Register
AT91C_LCDC_ISR            EQU (0x00500854) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_FRMP1          EQU (0x00500008) ;- (LCDC) DMA Frame Pointer Register 1
AT91C_LCDC_CTRSTVAL       EQU (0x00500844) ;- (LCDC) Contrast Value Register
AT91C_LCDC_ICR            EQU (0x00500858) ;- (LCDC) Interrupt Clear Register
AT91C_LCDC_TIM1           EQU (0x00500808) ;- (LCDC) LCD Timing Config 1 Register
AT91C_LCDC_DMACON         EQU (0x0050001C) ;- (LCDC) DMA Control Register
AT91C_LCDC_ITR            EQU (0x00500860) ;- (LCDC) Interrupts Test Register
AT91C_LCDC_IDR            EQU (0x0050084C) ;- (LCDC) Interrupt Disable Register
AT91C_LCDC_DP4_7          EQU (0x00500820) ;- (LCDC) Dithering Pattern DP4_7 Register
AT91C_LCDC_DP5_7          EQU (0x0050082C) ;- (LCDC) Dithering Pattern DP5_7 Register
AT91C_LCDC_IRR            EQU (0x00500864) ;- (LCDC) Interrupts Raw Status Register
AT91C_LCDC_DP3_4          EQU (0x00500830) ;- (LCDC) Dithering Pattern DP3_4 Register
AT91C_LCDC_IMR            EQU (0x00500850) ;- (LCDC) Interrupt Mask Register
AT91C_LCDC_LCDFRCFG       EQU (0x00500810) ;- (LCDC) LCD Frame Config Register
AT91C_LCDC_CTRSTCON       EQU (0x00500840) ;- (LCDC) Contrast Control Register
AT91C_LCDC_DP1_2          EQU (0x0050081C) ;- (LCDC) Dithering Pattern DP1_2 Register
AT91C_LCDC_FRMP2          EQU (0x0050000C) ;- (LCDC) DMA Frame Pointer Register 2
AT91C_LCDC_LCDCON1        EQU (0x00500800) ;- (LCDC) LCD Control 1 Register
AT91C_LCDC_DP4_5          EQU (0x00500834) ;- (LCDC) Dithering Pattern DP4_5 Register
AT91C_LCDC_FRMA2          EQU (0x00500014) ;- (LCDC) DMA Frame Address Register 2
AT91C_LCDC_BA1            EQU (0x00500000) ;- (LCDC) DMA Base Address Register 1
AT91C_LCDC_DMA2DCFG       EQU (0x00500020) ;- (LCDC) DMA 2D addressing configuration
AT91C_LCDC_LUT_ENTRY      EQU (0x00500C00) ;- (LCDC) LUT Entries Register
AT91C_LCDC_DP6_7          EQU (0x00500838) ;- (LCDC) Dithering Pattern DP6_7 Register
AT91C_LCDC_FRMCFG         EQU (0x00500018) ;- (LCDC) DMA Frame Configuration Register
AT91C_LCDC_TIM2           EQU (0x0050080C) ;- (LCDC) LCD Timing Config 2 Register
AT91C_LCDC_DP3_5          EQU (0x00500824) ;- (LCDC) Dithering Pattern DP3_5 Register
AT91C_LCDC_FRMA1          EQU (0x00500010) ;- (LCDC) DMA Frame Address Register 1
AT91C_LCDC_IER            EQU (0x00500848) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_DP2_3          EQU (0x00500828) ;- (LCDC) Dithering Pattern DP2_3 Register
AT91C_LCDC_FIFO           EQU (0x00500814) ;- (LCDC) LCD FIFO Register
AT91C_LCDC_BA2            EQU (0x00500004) ;- (LCDC) DMA Base Address Register 2
AT91C_LCDC_LCDCON2        EQU (0x00500804) ;- (LCDC) LCD Control 2 Register
AT91C_LCDC_GPR            EQU (0x0050085C) ;- (LCDC) General Purpose Register
/* - ========== Register definition for LCDC_16B_TFT peripheral ========== */
AT91C_TFT_MVAL            EQU (0x00500818) ;- (LCDC_16B_TFT) LCD Mode Toggle Rate Value Register
AT91C_TFT_PWRCON          EQU (0x0050083C) ;- (LCDC_16B_TFT) Power Control Register
AT91C_TFT_ISR             EQU (0x00500854) ;- (LCDC_16B_TFT) Interrupt Enable Register
AT91C_TFT_FRMP1           EQU (0x00500008) ;- (LCDC_16B_TFT) DMA Frame Pointer Register 1
AT91C_TFT_CTRSTVAL        EQU (0x00500844) ;- (LCDC_16B_TFT) Contrast Value Register
AT91C_TFT_ICR             EQU (0x00500858) ;- (LCDC_16B_TFT) Interrupt Clear Register
AT91C_TFT_TIM1            EQU (0x00500808) ;- (LCDC_16B_TFT) LCD Timing Config 1 Register
AT91C_TFT_DMACON          EQU (0x0050001C) ;- (LCDC_16B_TFT) DMA Control Register
AT91C_TFT_ITR             EQU (0x00500860) ;- (LCDC_16B_TFT) Interrupts Test Register
AT91C_TFT_IDR             EQU (0x0050084C) ;- (LCDC_16B_TFT) Interrupt Disable Register
AT91C_TFT_DP4_7           EQU (0x00500820) ;- (LCDC_16B_TFT) Dithering Pattern DP4_7 Register
AT91C_TFT_DP5_7           EQU (0x0050082C) ;- (LCDC_16B_TFT) Dithering Pattern DP5_7 Register
AT91C_TFT_IRR             EQU (0x00500864) ;- (LCDC_16B_TFT) Interrupts Raw Status Register
AT91C_TFT_DP3_4           EQU (0x00500830) ;- (LCDC_16B_TFT) Dithering Pattern DP3_4 Register
AT91C_TFT_IMR             EQU (0x00500850) ;- (LCDC_16B_TFT) Interrupt Mask Register
AT91C_TFT_LCDFRCFG        EQU (0x00500810) ;- (LCDC_16B_TFT) LCD Frame Config Register
AT91C_TFT_CTRSTCON        EQU (0x00500840) ;- (LCDC_16B_TFT) Contrast Control Register
AT91C_TFT_DP1_2           EQU (0x0050081C) ;- (LCDC_16B_TFT) Dithering Pattern DP1_2 Register
AT91C_TFT_FRMP2           EQU (0x0050000C) ;- (LCDC_16B_TFT) DMA Frame Pointer Register 2
AT91C_TFT_LCDCON1         EQU (0x00500800) ;- (LCDC_16B_TFT) LCD Control 1 Register
AT91C_TFT_DP4_5           EQU (0x00500834) ;- (LCDC_16B_TFT) Dithering Pattern DP4_5 Register
AT91C_TFT_FRMA2           EQU (0x00500014) ;- (LCDC_16B_TFT) DMA Frame Address Register 2
AT91C_TFT_BA1             EQU (0x00500000) ;- (LCDC_16B_TFT) DMA Base Address Register 1
AT91C_TFT_DMA2DCFG        EQU (0x00500020) ;- (LCDC_16B_TFT) DMA 2D addressing configuration
AT91C_TFT_LUT_ENTRY       EQU (0x00500C00) ;- (LCDC_16B_TFT) LUT Entries Register
AT91C_TFT_DP6_7           EQU (0x00500838) ;- (LCDC_16B_TFT) Dithering Pattern DP6_7 Register
AT91C_TFT_FRMCFG          EQU (0x00500018) ;- (LCDC_16B_TFT) DMA Frame Configuration Register
AT91C_TFT_TIM2            EQU (0x0050080C) ;- (LCDC_16B_TFT) LCD Timing Config 2 Register
AT91C_TFT_DP3_5           EQU (0x00500824) ;- (LCDC_16B_TFT) Dithering Pattern DP3_5 Register
AT91C_TFT_FRMA1           EQU (0x00500010) ;- (LCDC_16B_TFT) DMA Frame Address Register 1
AT91C_TFT_IER             EQU (0x00500848) ;- (LCDC_16B_TFT) Interrupt Enable Register
AT91C_TFT_DP2_3           EQU (0x00500828) ;- (LCDC_16B_TFT) Dithering Pattern DP2_3 Register
AT91C_TFT_FIFO            EQU (0x00500814) ;- (LCDC_16B_TFT) LCD FIFO Register
AT91C_TFT_BA2             EQU (0x00500004) ;- (LCDC_16B_TFT) DMA Base Address Register 2
AT91C_TFT_LCDCON2         EQU (0x00500804) ;- (LCDC_16B_TFT) LCD Control 2 Register
AT91C_TFT_GPR             EQU (0x0050085C) ;- (LCDC_16B_TFT) General Purpose Register
/* - ========== Register definition for HDMA_CH_0 peripheral ========== */
AT91C_HDMA_CH_0_BDSCR     EQU (0xFFFFEC5C) ;- (HDMA_CH_0) HDMA Reserved
AT91C_HDMA_CH_0_DADDR     EQU (0xFFFFEC40) ;- (HDMA_CH_0) HDMA Channel Destination Address Register
AT91C_HDMA_CH_0_DPIP      EQU (0xFFFFEC58) ;- (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_0_DSCR      EQU (0xFFFFEC44) ;- (HDMA_CH_0) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_0_CFG       EQU (0xFFFFEC50) ;- (HDMA_CH_0) HDMA Channel Configuration Register
AT91C_HDMA_CH_0_SPIP      EQU (0xFFFFEC54) ;- (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_0_CADDR     EQU (0xFFFFEC60) ;- (HDMA_CH_0) HDMA Reserved
AT91C_HDMA_CH_0_CTRLA     EQU (0xFFFFEC48) ;- (HDMA_CH_0) HDMA Channel Control A Register
AT91C_HDMA_CH_0_CTRLB     EQU (0xFFFFEC4C) ;- (HDMA_CH_0) HDMA Channel Control B Register
AT91C_HDMA_CH_0_SADDR     EQU (0xFFFFEC3C) ;- (HDMA_CH_0) HDMA Channel Source Address Register
/* - ========== Register definition for HDMA_CH_1 peripheral ========== */
AT91C_HDMA_CH_1_CADDR     EQU (0xFFFFEC88) ;- (HDMA_CH_1) HDMA Reserved
AT91C_HDMA_CH_1_DPIP      EQU (0xFFFFEC80) ;- (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_1_CTRLB     EQU (0xFFFFEC74) ;- (HDMA_CH_1) HDMA Channel Control B Register
AT91C_HDMA_CH_1_SADDR     EQU (0xFFFFEC64) ;- (HDMA_CH_1) HDMA Channel Source Address Register
AT91C_HDMA_CH_1_BDSCR     EQU (0xFFFFEC84) ;- (HDMA_CH_1) HDMA Reserved
AT91C_HDMA_CH_1_CFG       EQU (0xFFFFEC78) ;- (HDMA_CH_1) HDMA Channel Configuration Register
AT91C_HDMA_CH_1_DSCR      EQU (0xFFFFEC6C) ;- (HDMA_CH_1) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_1_DADDR     EQU (0xFFFFEC68) ;- (HDMA_CH_1) HDMA Channel Destination Address Register
AT91C_HDMA_CH_1_CTRLA     EQU (0xFFFFEC70) ;- (HDMA_CH_1) HDMA Channel Control A Register
AT91C_HDMA_CH_1_SPIP      EQU (0xFFFFEC7C) ;- (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register
/* - ========== Register definition for HDMA_CH_2 peripheral ========== */
AT91C_HDMA_CH_2_SADDR     EQU (0xFFFFEC8C) ;- (HDMA_CH_2) HDMA Channel Source Address Register
AT91C_HDMA_CH_2_BDSCR     EQU (0xFFFFECAC) ;- (HDMA_CH_2) HDMA Reserved
AT91C_HDMA_CH_2_DPIP      EQU (0xFFFFECA8) ;- (HDMA_CH_2) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_2_SPIP      EQU (0xFFFFECA4) ;- (HDMA_CH_2) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_2_DADDR     EQU (0xFFFFEC90) ;- (HDMA_CH_2) HDMA Channel Destination Address Register
AT91C_HDMA_CH_2_DSCR      EQU (0xFFFFEC94) ;- (HDMA_CH_2) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_2_CTRLA     EQU (0xFFFFEC98) ;- (HDMA_CH_2) HDMA Channel Control A Register
AT91C_HDMA_CH_2_CADDR     EQU (0xFFFFECB0) ;- (HDMA_CH_2) HDMA Reserved
AT91C_HDMA_CH_2_CFG       EQU (0xFFFFECA0) ;- (HDMA_CH_2) HDMA Channel Configuration Register
AT91C_HDMA_CH_2_CTRLB     EQU (0xFFFFEC9C) ;- (HDMA_CH_2) HDMA Channel Control B Register
/* - ========== Register definition for HDMA_CH_3 peripheral ========== */
AT91C_HDMA_CH_3_SPIP      EQU (0xFFFFECCC) ;- (HDMA_CH_3) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_3_CTRLA     EQU (0xFFFFECC0) ;- (HDMA_CH_3) HDMA Channel Control A Register
AT91C_HDMA_CH_3_DPIP      EQU (0xFFFFECD0) ;- (HDMA_CH_3) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_3_CTRLB     EQU (0xFFFFECC4) ;- (HDMA_CH_3) HDMA Channel Control B Register
AT91C_HDMA_CH_3_BDSCR     EQU (0xFFFFECD4) ;- (HDMA_CH_3) HDMA Reserved
AT91C_HDMA_CH_3_DSCR      EQU (0xFFFFECBC) ;- (HDMA_CH_3) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_3_CADDR     EQU (0xFFFFECD8) ;- (HDMA_CH_3) HDMA Reserved
AT91C_HDMA_CH_3_CFG       EQU (0xFFFFECC8) ;- (HDMA_CH_3) HDMA Channel Configuration Register
AT91C_HDMA_CH_3_DADDR     EQU (0xFFFFECB8) ;- (HDMA_CH_3) HDMA Channel Destination Address Register
AT91C_HDMA_CH_3_SADDR     EQU (0xFFFFECB4) ;- (HDMA_CH_3) HDMA Channel Source Address Register
/* - ========== Register definition for HDMA_CH_4 peripheral ========== */
AT91C_HDMA_CH_4_CFG       EQU (0xFFFFECF0) ;- (HDMA_CH_4) HDMA Channel Configuration Register
AT91C_HDMA_CH_4_BDSCR     EQU (0xFFFFECFC) ;- (HDMA_CH_4) HDMA Reserved
AT91C_HDMA_CH_4_CADDR     EQU (0xFFFFED00) ;- (HDMA_CH_4) HDMA Reserved
AT91C_HDMA_CH_4_DADDR     EQU (0xFFFFECE0) ;- (HDMA_CH_4) HDMA Channel Destination Address Register
AT91C_HDMA_CH_4_CTRLA     EQU (0xFFFFECE8) ;- (HDMA_CH_4) HDMA Channel Control A Register
AT91C_HDMA_CH_4_SADDR     EQU (0xFFFFECDC) ;- (HDMA_CH_4) HDMA Channel Source Address Register
AT91C_HDMA_CH_4_CTRLB     EQU (0xFFFFECEC) ;- (HDMA_CH_4) HDMA Channel Control B Register
AT91C_HDMA_CH_4_DSCR      EQU (0xFFFFECE4) ;- (HDMA_CH_4) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_4_SPIP      EQU (0xFFFFECF4) ;- (HDMA_CH_4) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_4_DPIP      EQU (0xFFFFECF8) ;- (HDMA_CH_4) HDMA Channel Destination Picture in Picture Configuration Register
/* - ========== Register definition for HDMA_CH_5 peripheral ========== */
AT91C_HDMA_CH_5_CTRLB     EQU (0xFFFFED14) ;- (HDMA_CH_5) HDMA Channel Control B Register
AT91C_HDMA_CH_5_DADDR     EQU (0xFFFFED08) ;- (HDMA_CH_5) HDMA Channel Destination Address Register
AT91C_HDMA_CH_5_SPIP      EQU (0xFFFFED1C) ;- (HDMA_CH_5) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_5_DSCR      EQU (0xFFFFED0C) ;- (HDMA_CH_5) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_5_DPIP      EQU (0xFFFFED20) ;- (HDMA_CH_5) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_5_CFG       EQU (0xFFFFED18) ;- (HDMA_CH_5) HDMA Channel Configuration Register
AT91C_HDMA_CH_5_CADDR     EQU (0xFFFFED28) ;- (HDMA_CH_5) HDMA Reserved
AT91C_HDMA_CH_5_SADDR     EQU (0xFFFFED04) ;- (HDMA_CH_5) HDMA Channel Source Address Register
AT91C_HDMA_CH_5_BDSCR     EQU (0xFFFFED24) ;- (HDMA_CH_5) HDMA Reserved
AT91C_HDMA_CH_5_CTRLA     EQU (0xFFFFED10) ;- (HDMA_CH_5) HDMA Channel Control A Register
/* - ========== Register definition for HDMA_CH_6 peripheral ========== */
AT91C_HDMA_CH_6_SADDR     EQU (0xFFFFED2C) ;- (HDMA_CH_6) HDMA Channel Source Address Register
AT91C_HDMA_CH_6_BDSCR     EQU (0xFFFFED4C) ;- (HDMA_CH_6) HDMA Reserved
AT91C_HDMA_CH_6_CADDR     EQU (0xFFFFED50) ;- (HDMA_CH_6) HDMA Reserved
AT91C_HDMA_CH_6_SPIP      EQU (0xFFFFED44) ;- (HDMA_CH_6) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_6_CTRLB     EQU (0xFFFFED3C) ;- (HDMA_CH_6) HDMA Channel Control B Register
AT91C_HDMA_CH_6_DSCR      EQU (0xFFFFED34) ;- (HDMA_CH_6) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_6_CFG       EQU (0xFFFFED40) ;- (HDMA_CH_6) HDMA Channel Configuration Register
AT91C_HDMA_CH_6_DPIP      EQU (0xFFFFED48) ;- (HDMA_CH_6) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_6_DADDR     EQU (0xFFFFED30) ;- (HDMA_CH_6) HDMA Channel Destination Address Register
AT91C_HDMA_CH_6_CTRLA     EQU (0xFFFFED38) ;- (HDMA_CH_6) HDMA Channel Control A Register
/* - ========== Register definition for HDMA_CH_7 peripheral ========== */
AT91C_HDMA_CH_7_CADDR     EQU (0xFFFFED78) ;- (HDMA_CH_7) HDMA Reserved
AT91C_HDMA_CH_7_CFG       EQU (0xFFFFED68) ;- (HDMA_CH_7) HDMA Channel Configuration Register
AT91C_HDMA_CH_7_DADDR     EQU (0xFFFFED58) ;- (HDMA_CH_7) HDMA Channel Destination Address Register
AT91C_HDMA_CH_7_CTRLB     EQU (0xFFFFED64) ;- (HDMA_CH_7) HDMA Channel Control B Register
AT91C_HDMA_CH_7_DSCR      EQU (0xFFFFED5C) ;- (HDMA_CH_7) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_7_DPIP      EQU (0xFFFFED70) ;- (HDMA_CH_7) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_7_CTRLA     EQU (0xFFFFED60) ;- (HDMA_CH_7) HDMA Channel Control A Register
AT91C_HDMA_CH_7_BDSCR     EQU (0xFFFFED74) ;- (HDMA_CH_7) HDMA Reserved
AT91C_HDMA_CH_7_SPIP      EQU (0xFFFFED6C) ;- (HDMA_CH_7) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_7_SADDR     EQU (0xFFFFED54) ;- (HDMA_CH_7) HDMA Channel Source Address Register
/* - ========== Register definition for HDMA peripheral ========== */
AT91C_HDMA_EBCIDR         EQU (0xFFFFEC1C) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register
AT91C_HDMA_LAST           EQU (0xFFFFEC10) ;- (HDMA) HDMA Software Last Transfer Flag Register
AT91C_HDMA_SREQ           EQU (0xFFFFEC08) ;- (HDMA) HDMA Software Single Request Register
AT91C_HDMA_RSVD0          EQU (0xFFFFEC34) ;- (HDMA) HDMA Reserved
AT91C_HDMA_EBCIER         EQU (0xFFFFEC18) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
AT91C_HDMA_GCFG           EQU (0xFFFFEC00) ;- (HDMA) HDMA Global Configuration Register
AT91C_HDMA_CHER           EQU (0xFFFFEC28) ;- (HDMA) HDMA Channel Handler Enable Register
AT91C_HDMA_RSVD1          EQU (0xFFFFEC38) ;- (HDMA) HDMA Reserved
AT91C_HDMA_CHDR           EQU (0xFFFFEC2C) ;- (HDMA) HDMA Channel Handler Disable Register
